export default {
    keys: [
        {
            path: ['number'],
            id: 'number',
            weight: 1,
            src: 'number',
            getFn: null,
        },
        {
            path: ['name'],
            id: 'name',
            weight: 1,
            src: 'name',
            getFn: null,
        },
        {
            path: ['syllabus'],
            id: 'syllabus',
            weight: 1,
            src: 'syllabus',
            getFn: null,
        },
    ],
    records: [
        {
            i: 0,
            $: {
                '0': { v: '014003', n: 1 },
                '1': { v: 'סטטיסטיקה', n: 1 },
                '2': {
                    v: 'יסודות תורת ההסתברות: מרחב מדגם ומאורעות, חישוב הסתברויות במרחב סימטרי, הסתברות מותנית ואי-תלות- נוסחת ההסתברות השלימה ונוסחת בייס, אי-תלות של מאורעות. משתנה מקרי בדיד ורציף: משתנים מקריים והתפלגותיהם, תוחלת ושונות של משתנה מקרי, התפלגויות מיוחדות. משתנה מקרי דו-מימדי. משפט הגבול המרכזי. הסקה סטטיסטית: סטטיסטיקה תאורית. אמידה נקודתית. אמידה מרווחית: רווחי סמך. רווח סמך לתוחלת (כאשר השונות ידועה ואינה ידועה), רווח סמך לשונות. בדיקת השערות: רמת מובהקות ועוצמה המבחן. הסקה על תוחלת, שונות ופרופורציה. השוואת שתי אוכלוסיות: מבחן T לשני מדגמים בלתי תלויים ומדגמים מזווגים, השוואת שתי פרופורציות. מבחן חי-בריבוע לטיב התאמה. ניתוח שונות, רגרסיה.',
                    n: 0.103,
                },
            },
        },
        {
            i: 1,
            $: {
                '0': { v: '014004', n: 1 },
                '1': { v: 'נתוח מערכות', n: 0.707 },
                '2': {
                    v: 'בעיות אופטימזציה בהנדסה אזרחית וסביבתית וניסוחן. משפט TKK. תכנות לינארי. דואליות. מבחני רגישות, תכנות דינמי, תורת ההחלטות. יסודות תכנות לא לינארי.מבוא לתכנות בשלמים.',
                    n: 0.209,
                },
            },
        },
        {
            i: 2,
            $: {
                '0': { v: '014005', n: 1 },
                '1': { v: 'מעבדה הנדסית', n: 0.707 },
                '2': {
                    v: 'מעבדה פקולטית בסיסית למכניקת מוצקים: תכונות חומרים, מדידי עבור, מאמצים משולבים, בעיות בכפיפה, פוטואלסטיות, קריסה.',
                    n: 0.258,
                },
            },
        },
        {
            i: 3,
            $: {
                '0': { v: '014006', n: 1 },
                '1': { v: 'מבוא לשיטות נומריות', n: 0.577 },
                '2': {
                    v: 'פתרון מערכות משוואות לינאריות. פתרון משוואות לא לינאריות. אינטרפולציה, אינטגרציה נומרית. גזירה נומרית. פתרון משוואות דיפרנציאליות רגילות, בעיות ערכים התחלתיים ותנאי שפה. התכנסות ויציבות.',
                    n: 0.204,
                },
            },
        },
        {
            i: 4,
            $: {
                '0': { v: '014008', n: 1 },
                '1': { v: 'מידע גרפי הנדסי', n: 0.577 },
                '2': {
                    v: 'הקניית הבנה ויכולת בייצוג ותקשורת מידע הנדסי בענף הבנייה באמצעים גרפיים: חיזוק הראייה המרחבית (קריאה של היטלים/חתכים/ פרטים), תקשורת מושגים באמצעות סקיצות, מידול מידע בנין ( BIM ), כולל מידול D3, שימוש בכלי תכנה מתאימים.',
                    n: 0.169,
                },
            },
        },
        {
            i: 5,
            $: {
                '0': { v: '014101', n: 1 },
                '1': { v: 'פרויקט בקונסטרוקציות', n: 0.707 },
                '2': {
                    v: 'הערה:קביעת הציון עפ"י מעקב במשך הסמסטר, בדיקת הפרויקט המוגש והצגתו בפני ועדת שיפוט. ***דרישות קדם: השלמת מקצועות חובה בהנדסת מבנים: 014105 או 014145, 014146 או 014106, 014109 או 014143 + 2 מקצועות בחירה בהנדסת מבנים. תכנון כללי של פרוייקט בשטח הנדסת מבנים על בסיס לימוד עצמי של בעיה הנדסית. השוואת פתרונות שונים. אנליזת המבנה והכנת תכניות כלליות לאחד הפתרונות כולל פרוט חלקי של רכיבים מבניים. דיווח טכני והצגת הפרויקט בסוף סמסטר הלימוד.',
                    n: 0.118,
                },
            },
        },
        {
            i: 6,
            $: {
                '0': { v: '014103', n: 1 },
                '1': { v: 'מבוא למכניקה הנדסית', n: 0.577 },
                '2': {
                    v: '***דרישות קדם: השלמות פיסיקה 1.***\nוקטור כח, וקטור מומנט, מערכות שקולות במישור ובמרחב, מערכת שקולה פשוטה ביותר.\nמושג הגוף החופשי,שווי משקל, מושגי היציבות והסיום הסטטי.\nמסבכים מישוריים ומרחביים, קורות ומסגרות מישוריות ומרחביות.\nמהלכי כוחות ומומנטים פנימיים במבנים.\nעומסים מפורשים, תכונות גופים ושטחים (מרכז כובד, מרכזית, מומנט ראשון ושני של השטח).\nקשרים דיפרנציאליים לכוחות פנימיים במבנים.\nכבלים.',
                    n: 0.143,
                },
            },
        },
        {
            i: 7,
            $: {
                '0': { v: '014104', n: 1 },
                '1': { v: 'תורת החוזק 1', n: 0.577 },
                '2': {
                    v: 'מבוא. מאמץ ועיבור במשיכה ולחיצה. פיתול חתכים שונים, כפיפת קורות אלסטיות והומוגניות. גזירה בשעת כפיפה, מרכז הגזירה. טרנספורמצית המאמץ והעיבור, שקיעות בעזרת המשוואה הדיפרצניאלית של הקו האלסטי, פתרון מבנים בלתי מסוימים. מושגים ראשונים של קריסה אלסטית.',
                    n: 0.167,
                },
            },
        },
        {
            i: 8,
            $: {
                '0': { v: '014107', n: 1 },
                '1': { v: 'מבוא לתורת האלסטיות', n: 0.577 },
                '2': {
                    v: 'וקטורים וטנסורים. דפורמצייה, עיוותים. מאמצים, משואות שיווי משקל. חוקים קונסטיטוטיבים של אלסטיות. בעית ערך-שפה באלסטיות. תורת הפלטות. קריטריונים של חוזק וכשל.',
                    n: 0.218,
                },
            },
        },
        {
            i: 9,
            $: {
                '0': { v: '014108', n: 1 },
                '1': { v: 'סטטיקת מבנים', n: 0.707 },
                '2': {
                    v: 'מהלכי כוחות פנימיים וקווי השפעה במבנים מסוימים סטטית. משפט בטי וחישוב הזזות אלסטיות. שיטת הגמישות. שיטת הקשיחות. קווי השפעה במבנים בלתי-מסוימים סטטית.',
                    n: 0.213,
                },
            },
        },
        {
            i: 10,
            $: {
                '0': { v: '014113', n: 1 },
                '1': { v: 'יסודות', n: 1 },
                '2': {
                    v: 'הערה: חלק מציון המעקב הינו הגשת פרוייקט. סיווג מבנים קרקעות ויסודות. שיטת מודול המצע בחישוב יסודות. יסודות אקסצנטריים, יסודות משותפים קשיחים. תכן צורני וקונסטרוקטיבי של יסודות בודדים. תכן מערכת יסודות: קריטריוני כשל של מערכת יסודות בודדים. שקיעות דיפרנציאליות בסיסיות, טבעיות ומרוסנות. ריסון שקיעות ורדיסטרבוציה של מומנטים. אינטראקציה בין מבנה וקרקע והשפעת יחסי קשיחות. יסודות גמישים, קורה על מצע אלסטי. יסוד דוברה. חישוב כלונסאות לכוחות אופקיים.',
                    n: 0.124,
                },
            },
        },
        {
            i: 11,
            $: {
                '0': { v: '014131', n: 1 },
                '1': { v: "פרויקט מורחב במבנים-חלק א'", n: 0.5 },
                '2': {
                    v: "מיועד לסטודנטים במסלול מבנים בלבד. דרישות קדם: כל המקצועות החובה של מסלול הנדסת מבנים. הערה: קביעת הציון עפ\"י מעקב במשך הסמסטר. ציון סופי ייקבע בגמר חלק ב' של הפרויקט. אין אפשרות לקבל ניקוד על מקצוע זה ללא השלמת חלק ב'. חלק א' (014131): תכן כללי של פרויקט מורכב בתחום הנדסת מבנים. לימוד עצמי מתוך ספרות מקצועית של נושאים שונים הקשורים לפרויקט. גיבוש חלופות תכן אפשריות שונות והשוואתן, כולל בחירת חלופת התכן המתאימה ביותר. ראה 014132. הערה: במתכונת חד-סמסטריאלית של מקצועות פרויקט מורחב - חלק א+ב היקף הלימוד השבועי הינו כפול מהרשום למעלה.",
                    n: 0.104,
                },
            },
        },
        {
            i: 12,
            $: {
                '0': { v: '014132', n: 1 },
                '1': { v: "פרויקט מורחב במבנים-חלק ב'", n: 0.5 },
                '2': {
                    v: "מיועד לסטודנטים במסלול מבנים בלבד. הערה: קביעת הציון עפ\"י מעקב במשך הסמסטר, בדיקת הפרויקט המוגש והצגתו בפני ועדת שיפוט. אין אפשרות להתחיל בחלק ב' של הפרויקט לפני סיום חלק א' וקבלת ציון עובר על חלק א' של הפרויקט בסוף סמסטר הלימוד. דרישות קדם: כל המקצועות של מסלול הנדסת מבנים. פרויקט מורחב - חלק א'. חלק א' (014131): תכן כללי של פרויקט מורכב בתחום הנדסת מבנים. לימוד עצמי מתוך ספרות מקצועית של נושאים שונים הקשורים לפרויקט. גיבוש חלופות תכן אפשריות שונות והשוואתן, כולל בחירת חלופת התכן המתאימה ביותר. חלק ב' (014132): תכן סופי של חלופת התכן הנבחרת. אנליזה מפורטת של המבנה על חלקיו השונים. תכן מפורט והכנת תכניות כלליות ותכניות פרטניות של הפרויקט, משורטטת באמצעות מחשב. הכנת דו\"ח מסכם של הפרויקט והצגתו בפני ועדת שיפוט בסוף סמסטר הלימוד. הערה: במסגרת הצגת הפרויקט יש להציג את שני חלקיו גם יחד. לא ניתן לקבל ציון על הפרויקט ללא הצגתו בסוף סמסטר הלימוד. הערה: במתכונת חד-סמסטריאלית של מקצועות פרויקט מורחב - חלק א+ב היקף הלימוד השבועי הינו כפול מהרשום למעלה.",
                    n: 0.078,
                },
            },
        },
        {
            i: 13,
            $: {
                '0': { v: '014143', n: 1 },
                '1': { v: 'שיטות מחשב בסטטיקת מבנים', n: 0.5 },
                '2': {
                    v: 'ניסוח של שיטות הגמישות והקשיחות לפתרון מחשב. מטריצ גמישות וקשיחות של מוט פריזמטי. הרכבה שיטתית של מטריצת קשיחות של מבנה. תכנית מחשב לפתרון קורות נמשכות, מסבכים ומסגרות. מטריצת גמישות וקשיחות של מוט לא פריזמטי. מבוא לשיטת אלמנטים סופיים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 14,
            $: {
                '0': { v: '014145', n: 1 },
                '1': { v: 'תורת החוזק 2', n: 0.577 },
                '2': {
                    v: 'קריסה, קריסת עמודים, קריסת מסגרות, סימטריה בקריסת מסגרות, פתרון קריסה במחשב. קורות לחוצות צירית (קורת עמוד). אנרגיה במבנים, אנרגיה אלסטית, העמסה קוזיסטטית. שימור אנרגיה, מינימום אנרגיה, משפט קסטליאנו, שיטת ריץ. כפיפה משופעת, טרנספורמצית מומנטי אינרציה. קורות לא הומוגניות. קריטריוני כניעה, התנהגות פלסטית של חתכים, אנליזה פלסטית של קורות ומסגרות, גרעין החתך.',
                    n: 0.14,
                },
            },
        },
        {
            i: 15,
            $: {
                '0': { v: '014147', n: 1 },
                '1': { v: 'בניית המהנדס 1', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד בתכן מערכות מבניות למערכות תבניות פשוטות ומורכבות. תכונות אופיניות של חומרי בניין ושילובם במערכת המבנית, תכן תפיסתי וניתוח המערכות המבניות מנקודות מבט יציבות, פונקציונליות, עלות, אופן הביצוע, סימטריה ונאמנות לסכמה המבנית. ניתוח מקרי כשל מבנים ואחריות הנדסית. פיתוח חשיבה ויזואלית, שפת התרשימים והיכולת להציע, לתאר, להשוות ולשפוט באופן בקורתי מערכות מבניות ליישומים שונים, כגון: אולמות בעלי מפתחים גדולים, בניינים רבי קומות, ברכות ומגדלי מים, מבנים מתועשים, מבנים תלויים וכו\'. קביעת הציון עפ"י מעקב במשך הסמסטר, פרוייקטים שבועיים, פרוייקט ניסויי סמסטריאלי ובחינה סופית.',
                    n: 0.109,
                },
            },
        },
        {
            i: 16,
            $: {
                '0': { v: '014149', n: 1 },
                '1': { v: 'מבני בטון 2', n: 0.577 },
                '2': {
                    v: 'תכן אלמנטים לחוצים (תמירות), חישוב חתכים לכפיפה דו-צירית עם ובלי כח צירי, פיתול, חדירה, טבלות מצולבות: המשוואה הדיפרנציאלית של טבלות מצולבות, פתרונות המשוואה למקרים מיוחדים, עומס סכין. מומנט סכומי, טבלות מצולבות נמשכות (חישוב ותכן), חישוב פלסטי של טבלות מצולבות, טבלות שטוחות ללא קורות, תקרת צלעות, תקרת ערוגות.',
                    n: 0.146,
                },
            },
        },
        {
            i: 17,
            $: {
                '0': { v: '014151', n: 1 },
                '1': { v: 'נושא אישי בהנדסת מבנים למצטיינים', n: 0.447 },
                '2': {
                    v: 'דרישות קדם: ממוצע מצטבר של 88 ומעלה וצבירה של 120 נקודות לפחות. כל סטודנט הרשאי להירשם למקצוע זה יונחה באופן אישי על ידי אחד מחברי הסגל בנושא אשר חבר הסגל הביע נכונות להנחות. הסטודנט יהיה חייב בהגשת דו"ח מסכם בסיום עבודתו. הרישום של הסטודנט לקורס מותנה בהסכמת חבר סגל להנחותו.',
                    n: 0.141,
                },
            },
        },
        {
            i: 18,
            $: {
                '0': { v: '014153', n: 1 },
                '1': { v: 'מבני בטון 1', n: 0.577 },
                '2': {
                    v: 'קביעת הציון עפ"י ציון פרויקט ובחינה סופית. סקירה תמציתית של תכונות הבטון והפלדה והשתקפותן בתכן מבנים מבטון מזוין. שיטת המצבים הגבוליים בתכן ובחישוב רכיבים מבטון מזוין. מצב גבולי של שירות. חישוב חתכים לכפיפה במצב גבולי של הרס ללא/עם כוח צירי. תקרות מקשיות מתוחות בכוון אחד. תכן רכיבי מבנה קויים - קו כח המתיחה, עיגון. תכן לגזירה ברכיבים מבטון מזוין. רדיסטריבוציה של מומנטים. מבוא לחישוב ישיר של שקיעות: מומנט הסדיקה, מומנט אינרציה שקיל.',
                    n: 0.118,
                },
            },
        },
        {
            i: 19,
            $: {
                '0': { v: '014201', n: 1 },
                '1': { v: 'פרויקט בהנדסת מים 1', n: 0.5 },
                '2': {
                    v: 'תכנון פרויקט יישומי בהנדסת מים בהפעלת חשיבה הנדסית-תכנונית, כלכלית וניצול הידע בהידרוליקה. השלבים העיקריים במהלך הלימודים: בחירת הנושא. איסוף נתונים, עיבודם ניתוחם והצגתם. עיבוד וגיבוש חלופות תכנוניות עפ"י פרמטרים הנדסיים, אופרטיביים, כלכליים ואחרים, ניתוחן והשוואתן. כתיבת דו"ח על הבעיות במצב הקיים, ממצאי העבודה שנעשתה, הצגת היתרונות והחסרונות של הפתרון המוצע והמלצות להמשך הפעילות בעתיד. הפרויקט יוגש בצורת תזכיר מפורט, בהיר ומסודר.',
                    n: 0.128,
                },
            },
        },
        {
            i: 20,
            $: {
                '0': { v: '014205', n: 1 },
                '1': { v: 'הידרוליקה', n: 1 },
                '2': {
                    v: 'עקרונות זרימת נוזלים בלתי דחיסים במובילים סגורים וםתוחים. אנליזה ממדית ודמיות. שכבות גבול בזרימה טורבולנית. זרימה בצינורות: מפל לחץ והפסדים, מעברים, זרימה במערכת צינורות ומשאבות. זרימה בתעלות: זרימה קצובה, עקרונות תכן, אנרגיה סגולית ושימור תנע, עומק קריטי, מעברים, חתכי בקרה, זנק הידרולי, זרימה מודרגת וצירים הידרוליים.',
                    n: 0.147,
                },
            },
        },
        {
            i: 21,
            $: {
                '0': { v: '014211', n: 1 },
                '1': { v: 'מכניקת זורמים', n: 0.707 },
                '2': {
                    v: 'הידרוסטטיקה, גישת נפח בקרה וניסוח של משוואות שימור אינטגרליות עבור מסה, תנע ואנרגיה. משוואת ברנולי. ניסוח דיפרנציאלי של שימור מסה (משוואת הרציפות) ושימור תנע (משוואות נוויה סטוקס), תנאי שפה ופתרונות אנליטיים של משוואות הזרימה במקרים פרטיים. מבוא לזרימה פוטנציאלית.',
                    n: 0.16,
                },
            },
        },
        {
            i: 22,
            $: {
                '0': { v: '014212', n: 1 },
                '1': { v: 'מבוא להידרולוגיה הנדסית', n: 0.577 },
                '2': {
                    v: 'המחזור ההידרולוגי, משוואות מאזן, תחום ההתנקזות, שימושי סטטיסטיקה בהידרולוגיה, גשמים, ניתוח נתוני גשם, גשם תכן, חידור וחילחול. זרימות באפיקים, הידרוגרמות, הידרוגרמת יחידה, הילוך גיאות, מי תהום, אקוויפרים ומיונם, חוק דארסי, קרוב דפאווי, זרימה תמידית לבארות.',
                    n: 0.169,
                },
            },
        },
        {
            i: 23,
            $: {
                '0': { v: '014214', n: 1 },
                '1': { v: 'יסודות מכניקת הזורמים', n: 0.577 },
                '2': {
                    v: "הגדרה ותכונות של זורמים, הידרוסטטיקה, משפט ההובלה וקינמטיקה, ניסוח אינטגרלי של חוקי היסוד (שימור מסה, אנרגיה ותנע), ניסוח דיפרנציאלי של חוקי היסוד (מש' הרציפות ומש' נוויה סטוקס), תנאי שפה ופתרונות מדויקים, זרימה פוטנציאלית, זרימה טורבולנטית ושכבות גבול.",
                    n: 0.164,
                },
            },
        },
        {
            i: 24,
            $: {
                '0': { v: '014300', n: 1 },
                '1': { v: 'סמינריון בהנ. סביבתית ומשאבי מים', n: 0.447 },
                '2': {
                    v: 'הערה: מיועד בעיקר לסטודנטים שסיימו לפחות 6 סמסטרים. לימוד נושא בעל אופי טכנולוגי או כמותי בשטח הנ. הסביבה או משאבי מים ומדעי הסביבה. הנושא נבחר מתוך רשימה המוצעת ע"י המורה האחראי. או ע"י הסטודנט באישור המורה. הסטודנט לומד את הנושא באופן עצמאי, אוסף מידע ונתונים מספרות, שיחות עם אנשי מקצוע ומגיש את סיכומו בהרצאה ובדו"ח בכתב בהנחיית המורה. על הסטודנטים להיות נוכחים בכל הפגישות ולהשתתף בדיון אחרי כל הרצאה.',
                    n: 0.12,
                },
            },
        },
        {
            i: 25,
            $: {
                '0': { v: '014301', n: 1 },
                '1': { v: 'פרויקט בהנדסה סביבתית', n: 0.577 },
                '2': {
                    v: 'תכנון כללי של פרוייקט בשטח הנדסה סביבתית. לימוד עצמי של בעיה הנדסית. השוואת פתרונות שונים, הכנת תכניות לאחד הפתרונות ודיווח טכני.',
                    n: 0.218,
                },
            },
        },
        {
            i: 26,
            $: {
                '0': { v: '014305', n: 1 },
                '1': { v: 'מעבדה לטיפול במים ושפכים', n: 0.5 },
                '2': {
                    v: 'הערה: הציונים יינתנו עפ"י בחנים ודוחות מעבדה. מטרת הקורס הי ללמד טכניקות של בדיקות מעבדה הקשורות לטיפול במים ושפכים. הדמייה של תהליכי טיפול במים ובשפכים. תרגילי המעבדה כוללים בדיקות וניסויים נבחרים בשיטות כימיות וכימיות-פיסיקליות הקשורות בבקרת איכות מים, מקורות מים, תהליכי הטיפול במים, בשפכים ובבוצה.',
                    n: 0.149,
                },
            },
        },
        {
            i: 27,
            $: {
                '0': { v: '014309', n: 1 },
                '1': { v: 'טכנולוגיות מים ושפכים', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס היא להכיר לסטודנטים תהליכים מתקדמים ועתידיים לטיפול במים ושפכים. החלק הראשון של הקורס מוגדש לעיקרונות התכן של ריאקטורים מנתיים ורציפים לטיפול במים ושפכים. בחלק השני נלמד תהליכי ספיחה, תהליכי חמצון מתקדם, חילוף יונים , שיטות אלקטרוכימיות והידרותרמיות.',
                    n: 0.16,
                },
            },
        },
        {
            i: 28,
            $: {
                '0': { v: '014313', n: 1 },
                '1': { v: 'מיקרוביולוגיה סביבתית ואפידמיולוג', n: 0.577 },
                '2': {
                    v: 'סקירה כללית על סוגי מקרואורגניזמים בסביבה. שיטות גידול (מצעים סלקטיביים ודיפרנציאליים), כימות, זיהוי מורפולוגי של מיקרואורגניזמים בסביבה המימית, בקרקע ובאויר. מיקרוסקופיה, דרכי העברה של מחלה זיהומית, עמידות לאנטיביוטיקה, מחלות זואונוטיות, וירוס הקורונה, פטוגנים במים, חיידקים אינדיקטורים לפי תקנות מי שתייה, ביו-אירוסולים ותפוצה אוירית של פטוגנים ומנגנוני השרדות, תהליכים מיקרוביאליים בטיפול במי שפכים, תהליכים מיקרוביאלים להבראה של סביבה מזוהמת.',
                    n: 0.131,
                },
            },
        },
        {
            i: 29,
            $: {
                '0': { v: '014321', n: 1 },
                '1': { v: 'טוקסיקולוגיה סביבתית', n: 0.707 },
                '2': {
                    v: 'טוקסיקולוגיה סביבתית-מושגים והגדרות, מסלולים וקינטיקה של ספיגת חומרים רעילים, גישות שונות לקביעת השפעת האדם על הסביבה, גורמים המשפיעים על פוטנציאל הרעילות, רעילות של מתכות וכימיקלים אנאורגניים, ואורגנים, השפעות של קרינה מייננת, מקרים מורכבים (פרוייקט אמצע): כרייה והתכה של מתכות, מפעלי הכנת נייר, תחנות כוח לייצור חשמל, התחממות גלובלית, זיהום אויר, תעשיית החקלאות, הפקת שמן, שינוע ועיבוד, הערכת סיכונים אקולוגיים, התאוששות, שיקום וטיוב מערכות אקולוגיות.',
                    n: 0.125,
                },
            },
        },
        {
            i: 30,
            $: {
                '0': { v: '014322', n: 1 },
                '1': { v: 'יסודות הטיפול במים ושפכים', n: 0.5 },
                '2': {
                    v: 'פיתוח גישה תהליכית-הנדסית לטיפול במים ושפכים. איכות מים לפי שימושים. עקרונות תהליכי טיפול במים. הפרדת מוצקים בלתי מומסים: שיקוע, סינון הפתתה. פרדת מוצקים מומסים. מעבר גזים. חיטוי. מזהמים בשפכים ומשמעותם. טיפול בשפכים, הכולל טיפול פיזיקלי וביולוגי. טיפול בבוצה.',
                    n: 0.162,
                },
            },
        },
        {
            i: 31,
            $: {
                '0': { v: '014325', n: 1 },
                '1': { v: 'תכן מערכות אספקת מים ואיסוף שפכים', n: 0.408 },
                '2': {
                    v: 'עקרונות תכנון והפעלה של מערכות אספקת מים ואיסוף שפכים. חישוב רשתות אספקת מים ורשתות איסוף שפכים. המטרה, המבנה וההכנה של פרויקט הנדסי. מטרות בתכנון הכללי, איסוף נתונים לתכנון ועיבודם, ניתוח טכנו- כלכלי של חלופות והשוואתן. סוגיות בתכנון מערכות אספקת מים ושפכים. פרויקט בתכנון כללי של מערכת טיפול ואספקת מים.',
                    n: 0.143,
                },
            },
        },
        {
            i: 32,
            $: {
                '0': { v: '014330', n: 1 },
                '1': { v: 'תהליכים בים סוף ומפרץ אילת', n: 0.447 },
                '2': {
                    v: 'המאפיינים האוקיונוגרפים, אקולוגים וביולוגים של ים סוף ומפרץ אילת. התהליכים הגיאומורפולוגיים שעיצבו את המפרץ, זרימת המים והשפעתה על מאפיינים ביוטים וא-ביוטים. תהליכים פיסיקליים וביולוגיים והשפעתם על מאזן הנוטריינטים וחשיבותו. מחזורים עונתיים יצרנות ראשונית, והשפעתם על הביו-מסה. קבוצות פאונה ופלורה עיקריות בשונית האלמוגים והקשרים ביניהן.',
                    n: 0.151,
                },
            },
        },
        {
            i: 33,
            $: {
                '0': { v: '014409', n: 1 },
                '1': { v: 'גיאומכניקה', n: 1 },
                '2': {
                    v: 'יחסי משקל נפח, מיון, זרימת מים בקרקע, עקרון המאמצים האפקטיביים, השפעת זרימה על מאמצים אפקטיביים גרדינט קריטי, חתירה. פרוס מאמצים, קונסולידציה, דחיסות של חרסית רוויה, לחץ טרום, שקיעות סופיות, קונסולידציה בזמן, התפתחות שקיעות, חוזק קרקעות.,',
                    n: 0.169,
                },
            },
        },
        {
            i: 34,
            $: {
                '0': { v: '014411', n: 1 },
                '1': { v: 'הנדסת קרקע', n: 0.707 },
                '2': {
                    v: 'הקורס עוסק בעקרונות התכן והיציבות של מערכות גיאוטכניות שונות. קירות תומכים: שיטות רנקין וקולומב לחישוב לחץ עפר צידי, תכנון קירות כובד, קירות כלונסאות ושיגומים מעוגנים ולא מעוגנים. יציבות מדרונות: שיטת קולמן ועקומי היציבות של טיילור, שיטות הפלחים, תגובת מדרונות וסוללות עפר להורקה מהירה ורעידות אדמה, הקשר בין מקדם הבטחון וההסתברות לכשל בתכנון גיאוטכני. ביסוס: חקירות שדה, תסבולת ושקיעת יסודות רדודים, תסבולת ותגובת יסודות עמוקים (כלונסאות) להעמסה אופקית ואנכית. התנהגות קבוצת כלונסאות.',
                    n: 0.119,
                },
            },
        },
        {
            i: 35,
            $: {
                '0': { v: '014501', n: 1 },
                '1': { v: 'פרויקט בחומרים ותפקוד', n: 0.577 },
                '2': {
                    v: 'מקצועות קדם: עבור פרויקט בחומרים - 014505 ו- 014506 ועוד שניים לפחות מבין: 014513, 014515, 014605, 014508, 014512, 014516, 016504, 016505, 014520. תכנון כללי של נושא בשטח חומרי בנייה ותפקוד. לימוד עצמי של בעיה הנדסית, השוואת פתרונות שונים, הכנת תכניות לאחד הפתרונות ודיווח טכני.',
                    n: 0.151,
                },
            },
        },
        {
            i: 36,
            $: {
                '0': { v: '014503', n: 1 },
                '1': { v: 'פרויקט מעבדתי בחומרי בניה (1)', n: 0.447 },
                '2': {
                    v: 'פרוייקט מעבדתי לפי בחירת הסטודנט מרשימת נושאים שתינתן על ידי המורה האחראי. לימוד עצמי של בעיה הנדסית בשטח חומרי בנייה ובחינת הפתרונות האפשריים על ידי ניסויים מעבדתיים. ניתוח וסיכום תוצאות הבדיקות. הפרוייקט מבוצע בקבוצות בנות 2 סטודנטים ומסתיים בהגשת הרצאה בע"פ ודו"ח מקיף בכתב. הפרוייקט נמשך 2 סמסטרים וחלק זה מהווה קדם להמשך הפרוייקט 014504.',
                    n: 0.135,
                },
            },
        },
        {
            i: 37,
            $: {
                '0': { v: '014505', n: 1 },
                '1': { v: 'חומרי בנייה', n: 0.707 },
                '2': {
                    v: 'חומרי המליטה השונים. סיד אווירי ומוצרי חול סיד. גבס ומוצרי גבס, צמנט פורטלנד, הרכב כימי ומינרלי, סוגים. חומרים פוצולניים ותחליפי צמנט. התקשרות והתקשות, מבנה האבן הצמנטית, תכונות מכניות, שינויי נפח, קורוזיה. אגרגטים למלט ובטון - תכונות ודרישות איכות. מים. מוספים. תכונות הבטון הטרי והקשוי. יציקה ואשפרה, בקרת איכות, קיימות. בדיקת חומרים ומשמעותה. תכן תערובות בטון, הכנתן במעבדה ובדיקת תכונותיהן.\nהערה: תרגילי המעבדה ניתנים אחת לשבועיים.',
                    n: 0.125,
                },
            },
        },
        {
            i: 38,
            $: {
                '0': { v: '014506', n: 1 },
                '1': { v: 'טכנולוגיה מתקדמת של בטון', n: 0.5 },
                '2': {
                    v: 'התנהגות בטון במבנה - שינויי נפח וסדקים והאמצעים להקטנתם. בטונים מיוחדים ליציקות באתר ובתעשיה. פתרון בעיה ספציפית בטכנולוגיה של בטון במעבדה כולל: סקר ספרותי, ביקור באתרי בנייה ובתי חרושת במידת הצורך, עיבוד תוכנית ניסויים, בדיקות מוקדמות, תכן תערובת בטון, יציקת מדגמים, בדיקתם והערכת התוצאות. דווח בעל-פה ובכתב.',
                    n: 0.146,
                },
            },
        },
        {
            i: 39,
            $: {
                '0': { v: '014513', n: 1 },
                '1': { v: 'בניה במתכות-חומרים וטכנולוגיה', n: 0.577 },
                '2': {
                    v: 'סיווג המתכות בבניה. מבנה המתכות ותכונותיהן המכניות והפיסיקליות. שיטות ייצור ועיבוד. חיבורים בריתוך והברגה. פלדה: פלדות לזיון בטון, לדריכה, לכבלים, לפרופילים, למסמרים, לברגים. אלומיניום: ייצור, תכונות ומוצרים. אבץ, נחושת ועופרת: תכונות ושימושים בבניה. קורוזיה של מתכות ושיטות הגנה.',
                    n: 0.162,
                },
            },
        },
        {
            i: 40,
            $: {
                '0': { v: '014601', n: 1 },
                '1': { v: 'פרויקט בניהול הבנייה', n: 0.577 },
                '2': {
                    v: 'לימוד עצמי של פרויקט הנדסי ודרך פיתרונו בתנאי מציאות, כולל הגדרת פתרונות ביצוע ובחינת כדאיותם, בניית לוחות זמנים מפורטים, תכנון מערך הציוד, והגדרת תקציב הביצוע. הסטודנט יכול לבחור בין פרויקט בניית מבנים או פרויקט תשתיות.',
                    n: 0.169,
                },
            },
        },
        {
            i: 41,
            $: {
                '0': { v: '014603', n: 1 },
                '1': { v: 'כלכלה הנדסית', n: 0.707 },
                '2': {
                    v: 'מושגים כלכליים בסיסיים: היצע וביקוש, כלכלה התנהגותית, ערך נוכחי, ערך עתידי, ערך שנתי, ניתוח עלויות, השוואת חלופות הנדסיות, ניתוח כלכלי של שימוש בציוד, מיסים, אינפלציה, החלטות בחוסר ודאות, ניתוח החלפת ציוד.',
                    n: 0.18,
                },
            },
        },
        {
            i: 42,
            $: {
                '0': { v: '014609', n: 1 },
                '1': { v: 'מיכון בבנייה', n: 0.707 },
                '2': {
                    v: 'מבוא לציוד בנייה, סיווג ציוד בנייה, התכונות והשימושים של ציוד הבנייה העיקרי, עגורנים וציוד מרכזי אחר בבניית בניינים פרוסים וגבוהים, פרוייקטי הנדסה אזרחית, עלויות ציוד, שיקולים קשים ורכים בבחירת הציוד ובהפעלתו, תפוקות ציוד, בטיחות בשימוש בציוד ובסביבתו, מיקום הציוד באתר הבנייה, יחסי גומלין וארגון כולל של מערך הייצור, ארגון אתר הבנייה.',
                    n: 0.14,
                },
            },
        },
        {
            i: 43,
            $: {
                '0': { v: '014615', n: 1 },
                '1': { v: 'מבוא לניהול פיננסי בבנייה', n: 0.5 },
                '2': {
                    v: 'הערה: הציון ינתן עפ"י מעקב במשך הסמסטר ובחן תקף. מטלות ניהול פיננסי בחברות בניה, ניהול ספרי חשבונות בבניה, עריכת דוחות פיננסיים בחברת בניה, ניתוח דוחות פיננסיים, מקורות לגיוס ההון.',
                    n: 0.186,
                },
            },
        },
        {
            i: 44,
            $: {
                '0': { v: '014616', n: 1 },
                '1': { v: 'ביצוע פרויקטים, ניהול ומנהיגות', n: 0.5 },
                '2': {
                    v: 'קביעת הציון עפ"י נוכחות, הכנת והצגת מצגות במשך הסמסטר והגשת עבודת גמר. גורמי המפתח המובילים להצלחתו של מיזם (או ארגון) וזאת בהתייחסות ליכולות האסטרטגיות והשיווקיות והשפעתן על הביצועים העסקיים. פיתוח כלים מעשיים לניתוח הגורמים החיצוניים העיקריים לתחרות בענף, לניתוח המשאבים והיכולות הארגוניים אשר מקנים יתרון תחרותי בר-קיימא ולרכישת מיומנויות לזיהוי בעיות שיווקיות ואיתור דרכי פתרונן.',
                    n: 0.135,
                },
            },
        },
        {
            i: 45,
            $: {
                '0': { v: '014617', n: 1 },
                '1': { v: 'תכנון ובקרה של פרוייקטי בנייה', n: 0.447 },
                '2': {
                    v: 'תזמון, תקצוב ובקרה של פרוייקטי בניה בשילוב טכניקות עבודה ממוחשבות. הדגשת תהליכים של קבלת החלטות על בסיס בדיקת חלופות. נושאי הדיון כוללים: ניהול פרוייקטים מקוון, תזמון, כתבי כמויות, אומדני עלות, תחשיב עלויות, ניהול תקציב, ניהול הייצור בבנייה, תזרימי עלויות ותזרימי מזומנים, בקרת לו"ז ובקרה תקציבית.',
                    n: 0.149,
                },
            },
        },
        {
            i: 46,
            $: {
                '0': { v: '014618', n: 1 },
                '1': { v: 'מבוא לניהול ובטיחות בבנייה', n: 0.5 },
                '2': {
                    v: 'מגמות בענף הבנייה ומאפייניו, שיטות התקשרות מכרזים חוזים, עקרונות חישוב כמויות, תכנון לוח זמנים בשיטת רשת, בפרויקטים קויים ומחזוריים. תחשיבי עלויות בנייה, עקרונות בטיחות בבניה, התארגנות באתר, איכות וציוד בניה, מגמות חדשנות בבניה, BIM, תיעוש, הדפסה בתלת מימד, יחידות מודולריות.',
                    n: 0.158,
                },
            },
        },
        {
            i: 47,
            $: {
                '0': { v: '014620', n: 1 },
                '1': { v: 'עקרונות תכן מבנים בהנדסת ביצוע', n: 0.447 },
                '2': {
                    v: 'תהליך תכן מבנים ועקרונות התכן. עומסים, רכיבים קווים ומישוריים, הערכת מידות הרכיבים. שילוב רכיבים ליצירת מערכות מבנה יציבות. סכימות סטטיות למבנה וניתוח תהליך זרימת הכוחות במבנה תוך כדי ביצוע ובמצבו הסופי. איתור תקלות תכנון או ביצוע חמורות. בחינת אלטרנטיבות שונות והשפעת הביצוע על בחירת הפתרון. שיטות בניה. יציבות אופקית - מערכת הקשחה. הצגה ודיון במקרי כשל.',
                    n: 0.134,
                },
            },
        },
        {
            i: 48,
            $: {
                '0': { v: '014630', n: 1 },
                '1': { v: 'מבוא להיבטים משפטיים בבנייה', n: 0.5 },
                '2': {
                    v: 'הערה: קביעת הציון עפ"י מעקב במשך הסמסטר, השתתפות בהרצאות, הגשת תרגילים ועבודת גמר. עקרונות מערכת המשפט בישראל, מושגי יסוד: חוק, תקנה, תקן, הנחיות, חלוקת תחומי ענף הבנייה בין הרשויות השונות, חוק התכנון והבנייה, רישוי וייחוד פעולות, תקנות תכנון ובניה, תקנים ישראליים ומפרטי מכון התקנים, עקרונות מדרג תכניות ארציות/מחוזיות/מקומיות, תקנות רישוי בנייה, חוק מכר כללי וחוק מכר דירות.',
                    n: 0.132,
                },
            },
        },
        {
            i: 49,
            $: {
                '0': { v: '014631', n: 1 },
                '1': { v: 'אומדן עלויות של פרויקטי תשתית', n: 0.447 },
                '2': {
                    v: 'סעיפי תקציב הפרויקט על כל שלביו, אומדן וניתוח של עלויות הנדסה ובנייה, אומדן וניתוח של עלויות קידום זמינות והפקעות, אומדן וניתוח של עלויות תכנון (שכר מתכננים) וניהול (ופיקוח), שיטות מקובלות לבקרת אומדנים ובקרה תקציבית, שיטות לניהול תזרימי מזומנים בפרויקטי בניה ותשתיות.',
                    n: 0.156,
                },
            },
        },
        {
            i: 50,
            $: {
                '0': { v: '014702', n: 1 },
                '1': { v: 'תכנון תחבורה', n: 0.707 },
                '2': {
                    v: 'מושגים בתכנון תחבורה, נתונים לתכנון תחבורה, מודלים מצרפיים ולא מצרפיים להתנהגות נוסעים וחיזוי הביקוש לתחבורה, חישוב מסלולים מינימליים והצבת תנועה, ניתוח רשתות תחבורה, הערכת פרויקטים תחבורתיים וניתוח תחבורתי בראיה בת קיימא. במעבדה הסטודנטים יתנסו בכלים שונים כולל ניתוח נתונים, תכנות לייצור רשתות תחבורה ותכנון תחבורה ואמידת מודלי ביקוש דיסאגרגטיבי.',
                    n: 0.143,
                },
            },
        },
        {
            i: 51,
            $: {
                '0': { v: '014709', n: 1 },
                '1': { v: 'מעבדת דרכים', n: 0.707 },
                '2': {
                    v: 'קביעת הציון עפ"י מעקב, דו"ח ובחינה סופית. חקירת שתית ואיפיון הנדסי של חומרי המיסעה. בדיקות על חומרי סלילה: יחסי צפיפות רטיבות. מת"ק, גבולות אטרברג, משקל יחסי, פחיסות ואלונגציה, שחיקות לוס אנג\'לס ושווה ערך חול. הרכבת פרקציות לחומרים גרנולריים. תכנון תערובות אספלט בשיטת מרשל ובשיטת המהדק הסיבובי. סיווג ביטומנים לפי שיטת SHRP. בדיקות שדה מצומצמות: צפיפות שדה, דקר דרום אפריקאי. הערה: קביעת הציון עפ"י מעקב במשך הסמסטר, מבחן מסכם, מעקב על העבודה המעשית ודו"ח מעבדה.',
                    n: 0.116,
                },
            },
        },
        {
            i: 52,
            $: {
                '0': { v: '014710', n: 1 },
                '1': { v: 'מיסעות גמישות', n: 0.707 },
                '2': {
                    v: 'הערה: המעקב גם עפ"י תרגילים ובחינת סמסטר. קביעת הציון עפ"י מבחן מסכם ותרגילי בית. מודול השיבה של שתיות וחומרים גרנולריים. מודול סטטי ודינמי של תערובות אספלטיות, חלוקת מאמצים בעזרת מודלים חד ורב שכבתיים, מאפייני הרס במיסעות גמישות, תכנון רציונאלי של מיסעות גמישות, בעיות תפיחה בשתיות חרסיתיות.',
                    n: 0.147,
                },
            },
        },
        {
            i: 53,
            $: {
                '0': { v: '014714', n: 1 },
                '1': { v: 'תכן מתקני תעבורה', n: 0.577 },
                '2': {
                    v: 'עקרונות תפעול ותכן של מתקני דרכים: סימון ושילוט דרכים. הארת דרכים, מתקני בטיחות. מערכות חנייה. גישור ומינהור. מרכזי תחבורה. מרכזי בקרת תנועה עירוניים ומרכזי בקרת תנועה בדרכים מהירות.',
                    n: 0.189,
                },
            },
        },
        {
            i: 54,
            $: {
                '0': { v: '014717', n: 1 },
                '1': { v: 'תחבורה אוירית', n: 0.707 },
                '2': {
                    v: 'מאפייני מטוסים, והשפעתם על תכנון שדה התעופה. בקרת התחבורה האוירית. קבולת שדה התעופה. גורמים לבחירת אתר וגודל השדה. האלמנטים הפיסיים במערך שדה התעופה ותצורתם. תכן גיאומטרי של מסלולי ההמראה והנחיתה. מסלולי ההסעה והרחבות. תכנון המסוף ואזורו. תכנון מבנה מיסעה.',
                    n: 0.16,
                },
            },
        },
        {
            i: 55,
            $: {
                '0': { v: '014719', n: 1 },
                '1': { v: "פרויקט מורחב בתחבורה - חלק א'", n: 0.408 },
                '2': {
                    v: "תכנון ותכן של פרויקט בהנדסת תחבורה. הסטודנט בוחר נושא פרויקט מתוך רשימה שהוכנה על ידי המרצה. לימוד עצמי של הבעיה, הגדרת מטרות, יצירת חלופות, הערכה, בחירה של חלופה מועדפת, הכנת דו\"ח טכני מפורט. הפרויקט נמשך שני סמסטרים. ציון סופי יקבע בגמר חלק ב' של הפרויקט. אין אפשרות לקבל ניקוד של מקצוע זה ללא השלמת חלק ב'.",
                    n: 0.134,
                },
            },
        },
        {
            i: 56,
            $: {
                '0': { v: '014721', n: 1 },
                '1': { v: 'פרויקט בתכנון תחבורה', n: 0.577 },
                '2': {
                    v: 'תכנון ותכן של פרויקט בתחבורה. לימוד עצמי של הבעיה, הגדרת מטרות, יצירת חלופות, הערכה, בחירה של חלופה מועדפת, הכנת דו"ח טכני מפורט.',
                    n: 0.213,
                },
            },
        },
        {
            i: 57,
            $: {
                '0': { v: '014722', n: 1 },
                '1': { v: 'פרויקט בהנדסת תעבורה', n: 0.577 },
                '2': {
                    v: 'תכנון ותכן של פרויקט בהנדסת תעבורה. לימוד עצמי של הבעיה, הגדרת מטרות, יצירת חלופות, הערכה, בחירה של חלופה מועדפת, תכן פונקציונלי, הכנת דו"ח מפורט.',
                    n: 0.204,
                },
            },
        },
        {
            i: 58,
            $: {
                '0': { v: '014723', n: 1 },
                '1': { v: 'פרויקט בתכן גיאומטרי של דרכים', n: 0.447 },
                '2': {
                    v: 'תכנון ותכן של פרויקט בהיבטים הגיאומטריים והבטיחותיים של דרכים. לימוד עצמי של הבעיה, הגדרת מטרות, יצירת חלופות, הערכה, תכן פונקציונלי, בחירה של חלופה מועדפת, הכנת דו"ח מפורט.',
                    n: 0.192,
                },
            },
        },
        {
            i: 59,
            $: {
                '0': { v: '014726', n: 1 },
                '1': { v: 'בטיחות בדרכים-תסקרים והתקנים', n: 0.577 },
                '2': {
                    v: 'בטיחות בדרכים, ניתוח נתוני תאונות דרכים, תסקירי בטיחות, שיקולי בטיחות בתכן גיאומטרי של דרכים ובתכנון צמתים, משולשי ראות, תכנון בטיחותי של הסדרי תנועה, התקני בטיחות, נהלים והנחיות של משרד התחבורה.',
                    n: 0.183,
                },
            },
        },
        {
            i: 60,
            $: {
                '0': { v: '014728', n: 1 },
                '1': { v: 'תכנון תשתיות תחבורה', n: 0.577 },
                '2': {
                    v: 'מבוא ומטרות: רשת התחבורה הארצית, המטרופולינית והעירונית - דרכים ומסילות. היררכיית רשתות דרכים ומאפייניהם. דרכים מהירות ומחלפיהן. תשתית להולכי רגל ולרוכבי אופניים. תשתית לתחבורה ציבורית - נת"צ, מת"צ, מסילות ומרכזי תחבורה. מערכות להסעת המונים. מערכת החנייה. ניהול תנועה, תשתיות שונות ב"זכות הדרך". תהליך התכנון הסטטוטורי וההנדסי. יישום פרויקט תחבורה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 61,
            $: {
                '0': { v: '014730', n: 1 },
                '1': { v: 'מבוא להנדסת תחבורה', n: 0.577 },
                '2': {
                    v: 'מערכת התחבורה, מרכיביה ויחסי הגומלין ביניהם. השפעות על פיתוח כלכלי, תכנון עירוני ואיכות הסביבה. תהליך תכנון התחבורה, משיכת ויצירת נסיעות, פילוג נסיעות, עקרונות של הצבת נסיעות. מאפייני זרימת התנועה, קיבולת ורמת שירות, תכן גיאומטרי של דרכים, עקומים אנכיים, עקומים אופקיים.',
                    n: 0.158,
                },
            },
        },
        {
            i: 62,
            $: {
                '0': { v: '014733', n: 1 },
                '1': { v: 'הנדסה וניהול של תנועה', n: 0.5 },
                '2': {
                    v: 'האדם, הרכב והדרך כגורמים בתנועה. מאפייני זרם התנועה. אמצעי ושיטות מדידה של נתוני תנועה. מודלים של זרימת תנועה ותאורית גלי הלם. הערכה תפעולית, עיכוב וקיבולת של צמתים לא מרומזרים וצמתים מרומזרים. תכנון רמזורים מבודדים, רמזורים מתואמים וגל ירוק, העדפה לתחבורה ציבורית.',
                    n: 0.156,
                },
            },
        },
        {
            i: 63,
            $: {
                '0': { v: '014734', n: 1 },
                '1': { v: 'תחבורה ציבורית', n: 0.707 },
                '2': {
                    v: 'הקורס מיועד להקנות ידע בסיסי אודות תכנון ותפעול תחבורה ציבורית. בין הנושאים הנלמדים ניתן ללמוד מושגי יסוד בתכנון תחבורה ציבורית, טכנולוגיות ותפקידם ברשת, תהליך התכנון, תקני שירות לתכנון, הערכת תפקוד השירות ויעילות הקווים, העדפה לתחבורה ציבורית, הצבות תחבורה ציבורית (סימולציה־, מתקנים תפעוליים לתחבורה ציבורית, ובחינת אמינות השירות.',
                    n: 0.146,
                },
            },
        },
        {
            i: 64,
            $: {
                '0': { v: '014829', n: 1 },
                '1': { v: 'תחיקת המדידה', n: 0.707 },
                '2': {
                    v: 'חוק המקרקעין: הסוגים ושיטות של רישום מקרקעין. שיתוף במקרקעין. המרת סוגי מקרקעין. הסדר המקרקעין בישראל. פקודת הקרקעות. פקודת המדידות ותקנות המודדים. חוק התכנון והבניה. מוסדות התכנון ותכנון תוכניות מפורטות. רישום בתים משותפים. רישום פעולות תכנון. קדסטר תלת מימדי.',
                    n: 0.162,
                },
            },
        },
        {
            i: 65,
            $: {
                '0': { v: '014841', n: 1 },
                '1': { v: 'יסודות המיפוי והמדידה 1', n: 0.5 },
                '2': {
                    v: 'צורת הארץ. מערכות קואורדינטות גיאודטיות. גיאודזיה גבוהה ונמוכה. מקורות מידע גיאודטי: מדידות קרקעיות, צילומי אויר, לווינים ( GNSS ) וחישה מרחוק. נושאים בסיסים בתורת השגיאות. מדידת כיוונים וזוויות. מדידת מרחקים. מדידת הפרשי גובה. מפוי פלנימטרי וטופוגרפי ( GIS ). חישוב שטחים ונפחים. מבוא לאינטרפולציה.',
                    n: 0.151,
                },
            },
        },
        {
            i: 66,
            $: {
                '0': { v: '014842', n: 1 },
                '1': { v: 'יסודות המיפוי והמדידה 2', n: 0.5 },
                '2': {
                    v: 'חישובי קואורדינטות במישור: צלעונים, חיתוך לפנים ולאחור.נושאים מתקדמים בתורת השגיאות: משקלים של תצפיות, אליפסת השגיאות, התפשטות השגיאות בצלעונים. התוויה של מפעלים הנדסים: קו ישר, קשת מעגלית, עקומי מעבר ועקום אנכי.',
                    n: 0.183,
                },
            },
        },
        {
            i: 67,
            $: {
                '0': { v: '014843', n: 1 },
                '1': { v: 'פוטוגרמטריה 1', n: 0.707 },
                '2': {
                    v: 'ההיטל הפרספקטיבי כמודל מתמטי של תצלום. עקרונות הראיה הסטריאוסקופית. התמרת קואורדינטות במישור ובמרחב. מצלמות אוויריות. הכלל הקו-לינארי והכלל הקופלנרי. אורינטציה פנימית וחיצונית. מיפוי בעזרת תצלומים. אורינטציה הדדית ומוחלטת של מודל פוטוגרמטרי. שרשור מודלים. טריאנגולציה אווירית. תכנון טיסת צילום. מבוא למיפוי מבוסס סורקי לייזר.',
                    n: 0.152,
                },
            },
        },
        {
            i: 68,
            $: {
                '0': { v: '014846', n: 1 },
                '1': { v: 'מסדי נתונים גיאו-מרחביים', n: 0.577 },
                '2': {
                    v: 'נתונים, קבצים ובסיסי נתונים. בסיס נתונים היררכי, רשתי וטבלאי. בסיס נתונים מוכוון אובייקטים. נתונים פלנימטריים ואלטימטריים. ייצוגם וניהולם. מיון נתוני מיפוי - נקודות, קווים ושטחים - טכניקות שווי שטח ושווי נתונים. טריאנגולציות ופוליגוני וורוני. שימוש בבסיס נתונים בגיאודזיה. גישות שונות לאיתור נתונים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 69,
            $: {
                '0': { v: '014848', n: 1 },
                '1': { v: 'מבוא לגיאודזיה', n: 0.707 },
                '2': {
                    v: 'מערכות קואורדינטות ארציות ואסטרונומיות. החוקים על פיהם מתנהלים במרחב גורמי השמים והאדמה. תנועת האדמה והכוכבים בתלות בגורם הזמן. מערכות זמן. חוקי התנועה של לווין. הכוחות הפועלים על לווין של האדמה. וקטור מצב של לווין, מסלול רגעי משתנה. מערכת למיקום כלל עולמי ( GPS ), מיקום מוחלט ומיקום יחסי. יסודות בגיאודזיה פיסיקלית.',
                    n: 0.14,
                },
            },
        },
        {
            i: 70,
            $: {
                '0': { v: '014851', n: 1 },
                '1': { v: 'רשתות בקרה גיאודטיות', n: 0.577 },
                '2': {
                    v: 'שיטות בהקמה, מדידה, ניהול וארגון רשתות בקרה אופקיות, אנכיות ורשתות משולבות. טריאנגולציה, טרילטרציה, רשת צלעונים גיאודטית, איזון מדויק, איזון טריגונומטרי - מדידות, חישובים, תיאום וניתוח שגיאות. מדידות GPS ומשוואות התצפית, קביעת מיקום מתצפיות ללווייני GPS ושימוש במדידות סטטיות בהקמה ותחזוקה של רשתות בקרה אופקית ואנכית.',
                    n: 0.149,
                },
            },
        },
        {
            i: 71,
            $: {
                '0': { v: '014855', n: 1 },
                '1': { v: 'עבוד תמונה לצורכי מיפוי', n: 0.5 },
                '2': {
                    v: 'שיטות הרכשת תמונה דיגיטלית. מבנה תמונה דיגיטלית ומרחבי צבע. שיפור תמונה מבוסס היסטוגרמה. מסננים ליניאריים ושיטות החלקה והדגשת סיפים. מסננים לא ליניאריים. התמרות פורייה ומרחב התדר אל מול מרחב התמונה. התמרות גיאומטריות גלובליות ומקומיות ומוזאיקת תמונות. מבנים פירמידליים ושילוב תמונות. יסודות הראיה הממוחשבת. זיהוי סיפים, נקודות עניין וסגמנטציה. עיבוד תמונות בינאריות. יסודות זיהוי תבניות בתמונות.',
                    n: 0.135,
                },
            },
        },
        {
            i: 72,
            $: {
                '0': { v: '014866', n: 1 },
                '1': { v: 'סמינר במיפוי וגיאו-אינפורמציה', n: 0.577 },
                '2': {
                    v: 'הצגת נושא טכני באחד מתחומי המיפוי והגיאו-אינפורמציה. הסטודנט משתלם בנושא בחירתו באופן עצמאי, אוסף נתונים ומידע מתוך הספרות ומגיש את סיכומו בצורת הרצאה ובכתב.',
                    n: 0.204,
                },
            },
        },
        {
            i: 73,
            $: {
                '0': { v: '014867', n: 1 },
                '1': { v: 'פרויקט בגיאודזיה ומדידות 1', n: 0.5 },
                '2': {
                    v: 'הכנת פרויקט באמצעות המחשב באחד משטחי הגיאודזיה והמדידה: מדידות לוויניות, מדידות הנדסיות, מדידות קדסטרליות, גיאודזיה מתמטית וגיאודזיה פיסית. הדגש הוא על לימוד עצמי של בעיה גיאודטית, יישום הלימודים הקודמים, השוואת פתרונות, ביצוע אחד הפתרונות, דיווח טכני.',
                    n: 0.167,
                },
            },
        },
        {
            i: 74,
            $: {
                '0': { v: '014869', n: 1 },
                '1': { v: 'פרויקט במיפוי ספרתי 1', n: 0.5 },
                '2': {
                    v: 'פרויקט באחד משטחי המיפוי הספרתי: כרטוגרפיה ומיפוי ממוחשב, פוטוגרמטריה וחישה מרחוק, מערכות מידע גיאוגרפי. הפרויקט יכלול בחירת נושא והגדרת מטרה, לימוד חומר רקע, הכרת ציוד ותוכנה רלבנטיים, בחינת אלטרנטיבות למימוש, תכנון שלבי הביצוע, ביצוע העבודה המעשית. סיכום מהלך הפרויקט והסקת מסקנות יוגשו בדו"ח מסודר.',
                    n: 0.151,
                },
            },
        },
        {
            i: 75,
            $: {
                '0': { v: '014875', n: 1 },
                '1': { v: 'פרויקט בתעשיה בגיאודזיה ומדידות', n: 0.5 },
                '2': {
                    v: "פרויקט דו סמסטריאלי באחד משטחי הגיאודזיה והמדידות במפעל תעשייתי. סטודנט במצב תקין יכול לבצע את הפרויקט במקום לבצע פרויקט בגיאודזיה ומדידות 1 ו-2 (שווה ערך ל-5 נק'). המפעל התעשייתי והפרויקט חייבים לקבל את אישור היחידה לפני הרישום למקצוע. את הפרויקט ילווה מורה מטעם הפקולטה שישותף בהגדרות הפרויקט.",
                    n: 0.146,
                },
            },
        },
        {
            i: 76,
            $: {
                '0': { v: '014876', n: 1 },
                '1': { v: 'פרויקט בתעשיה במיפוי ספרתי', n: 0.5 },
                '2': {
                    v: "פרויקט דו סמסטריאלי באחד משטחי המיפוי הספרתי. סטודנט במצב תקין יכול לבצע את הפרויקט במקום לבצע פרויקט במיפוי ספרתי 1 (שווה ערך ל-5 נק'). הפרויקט ייצג הצגת פתרון טכנולוגי/ אלגוריתמי לבעיה יישומית חשובה. עדיפות תינתן לקשר עם גורם תעשייתי אשר נזקק לפתרון כזה. את הפרויקט יאשר וילווה מורה מטעם הפקולטה שישותף בהגדרות הפרויקט.",
                    n: 0.137,
                },
            },
        },
        {
            i: 77,
            $: {
                '0': { v: '014885', n: 1 },
                '1': { v: 'קדסטר 2', n: 0.707 },
                '2': {
                    v: 'הרחבת הידע והעמקתו בנושאי קדסטר: מפרטים טכניים ופורמטים להגשת תוכניות, שיחזור גבולות קדסטרליים למעשה במגוון מצבים ופתרון קונפליקטים בין תוכניות רקע. תיקון 101, 104, 116 לחוק התכנון והבניה, חלוקה מפורטת של חלקות מושע, תקנות האיחוד והחלוקה. בתים משותפים, הסכמי שיתוף, זיקות הנאה, קדסטר ביו"ש ובי"ם, ליווי פרויקטי תשתיות, הפקעות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 78,
            $: {
                '0': { v: '014890', n: 1 },
                '1': { v: 'מבוא לספקטרוסקופיה וחישה מרחוק', n: 0.5 },
                '2': {
                    v: 'מטרות הקורס הם לימוד העקרונות הפיזיקליים של החישה מרחוק ופיתוח מיומנויות ליצירת מפה מתמונה ספקטרלית. הנושאים שילמדו כוללים : אינטראקציה של קרינה עם חלקיקי חומר , העברה, בליעה, החזרה, השפעת אטמוספירה, חוק למברט, פיזור נפחי, ראדיאנס, החזרה ספקטרלית מעלים ומקרקע, אינדקסים ספקטרליים, עירובים ספקטרליים, סיווג ספקטרלי, מערכות חישה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 79,
            $: {
                '0': { v: '014940', n: 1 },
                '1': { v: 'תופעות מעבר במערכות טבעיות', n: 0.5 },
                '2': {
                    v: 'מכניקת זורמים ומעבר חום ומסה ידונו בהקשר לתהליכים מדעיים והנדסיים בסביבה ובחקלאות. נושאי הלימוד כוללים מבוא, פיתוח המשוואות השולטות וניסוח תנאי שפה, הולכת חום חד ורב ממדית במצב מתמיד ושאינו מתמיד, מעבר חום ומסה בהסעה, מעבר פאזה, מעבר חום בקרינה, מעבר מסה במערכות מרובות מרכיבים.',
                    n: 0.149,
                },
            },
        },
        {
            i: 80,
            $: {
                '0': { v: '014941', n: 1 },
                '1': { v: 'הנדסת ניקוז עילי ותת קרקעי', n: 0.447 },
                '2': {
                    v: 'טופוגרפיה - אגנים ונקודות ריכוז. חזרה על תכונות הקרקע, הידרולוגיה - עילית (עקיפה וישירה) ותת-קרקעית (הוכהוט וארנסט). הידראוליקה-בתעלות, במעבירי מים וצנרת ניקוז תת קרקעית. שרטוט טכני של מבנים ואדריכלות של מערכות ניקוז תת קרקעיות. לימוד התוכנות HEC-RAS-HY-8 סיור בשטח ובמפעל צנרת, פרויקט גמר- כולל כתב כמויות ועלויות. קרקעות ותכונותיהן. הידרולוגיה תת קרקעית-הוכהוט וארנסט. הידראוליקה בצנרת ניקוז תת קרקעית. אדריכלות מערכת ניקוז תת קרקעית. סיור במפעל לייצור צנרת תת קרקעית.',
                    n: 0.12,
                },
            },
        },
        {
            i: 81,
            $: {
                '0': { v: '014942', n: 1 },
                '1': { v: 'הנדסה הידרולית ומאגרים', n: 0.577 },
                '2': {
                    v: 'היבטים יישומיים של מאזני מים, סכמות זרימה ועקומי התנגדות, שיקולים כלכליים, עקרונות תכן מובלים פתוחים, תעלות, בריכות, מאגרים, קידוחים ותחנות שאיבה במפעלי מים, הטיית מים, סכרים, מגלשים ומשככי אנרגיה, ניתוח הילוך גאות, מיחתור, יציבות מדרונות, חלחול והפסדים ממאגרים, שיטות איטום, עבודות עפר, מתקנים במאגר.',
                    n: 0.151,
                },
            },
        },
        {
            i: 82,
            $: {
                '0': { v: '014952', n: 1 },
                '1': { v: 'סקר קרקעות - מערכות מידע', n: 0.447 },
                '2': {
                    v: 'קביעת הציון עפ"י ציוני תרגילים במשך הסמסטר, ועפ"י ציון פרויקט גמר שהוא בהיקף משמעותי הכולל מיפוי בעזרת כלי הממ"ג וניתוח שטח באמצעות תצלומי אוויר ומפות נושאיות. לא תתקיים בחינה. גם חובת הנוכחות בשעורים ובסיורים משוקללת. כלים לביצוע סקרי קרקע כמו יכולות לתיאור חתך הקרקע בשדה, פיענוח תצלומי אוויר, מפות גיאולוגיות ומפות טופוגרפיות. שימוש בממ"ג (מערכות מידע גיאוגרפיות) ככלי ליצירת שכבות מידע למפת קרקע, לשימושי קרקע ולתכנון שטחים. דרישות הקורס כוללות גם השתתפות חובה בשני סיורים שיתקיימו בימי שישי. משך כל סיור כ- 5 שעות. בשבוע של הסיור או אחריו לא יתקיים שעור.',
                    n: 0.104,
                },
            },
        },
        {
            i: 83,
            $: {
                '0': { v: '014966', n: 1 },
                '1': { v: 'פרויקט בהנדסה סביבתית 2', n: 0.5 },
                '2': {
                    v: 'פרויקט תכנוני או מחקרי בתחום הנדסת הסביבה, הכולל: לימוד עצמי של בעיה הנדסית/מדעית, השוואת פתרונות שונים או תכנון מערך ניסויים, הכנת תוכנית לאחד הפתרונות ודיווח טכני, או ביצוע ניסויים והסקת מסקנות.',
                    n: 0.18,
                },
            },
        },
        {
            i: 84,
            $: {
                '0': { v: '014968', n: 1 },
                '1': { v: 'אקולוגיה למהנדסים', n: 0.707 },
                '2': {
                    v: 'אקולוגיה של מערכות: האקוסיסטמה כמערכת תרמודינמית, מארג המזון, ייצור ראשוני, רמות טרופיות, יעילות הייצור ויעילות טרופית. אנרגטיקה של אקוסיסטמות, מחזורים ביוגיאוכימיים, שינויי אקלים גלובליים. דינמיקה של אוכלוסיות: קצב הגידול הרגעי, גידול לוגיסטי, מודלים דטרמיניסטיים וסטוכסטיים, אוכלוסיות-על, מודלים של טריפה, תחרות וטפילות. אקולוגיה מרחבית. משבר המגוון הביולוגי.',
                    n: 0.147,
                },
            },
        },
        {
            i: 85,
            $: {
                '0': { v: '014977', n: 1 },
                '1': { v: 'מבוא לתהליכי זרימה וזיהום בקרקע', n: 0.447 },
                '2': {
                    v: 'קורס מבוא בפיסיקה של הקרקע הכולל תיאור של מצב המים בקרקע, הגדרה של עיקרון הרצף והבנה של מנגנוני התנועה של מים, גזים ומומסים. הקורס כולל לימוד של תכונות המים בקרקע, קפילריות, תאחיזת מים, הידרוסטטיקה של מים בקרקע, חוק דרסי, מוליכות הידראולית, משוואות המאזן של זרימה רוויה ולא רוויה, חידור, תנועת מלחים ומזהמים, שיטות חישוב ומדידה.',
                    n: 0.135,
                },
            },
        },
        {
            i: 86,
            $: {
                '0': { v: '015017', n: 1 },
                '1': { v: 'ציוד מערכות ושיטות בעבודות עפר', n: 0.447 },
                '2': {
                    v: 'תחומים בעבודות עפר: הנדסה אזרחית, חקלאות ומכרות. ציוד לעבודות עפר-תאור, שמושים, בצועים והערכה לתפוקות: תוכנות הדמיה לאופטימיזציה של ציוד ומערכים. טיפול בסלע - קידוח, פיצוץ וריטוש. העמסה והובלת עפר ואבן. הדוק קרקעות. מבוא לפצוצים הנדסיים. התאמה של ציוד ומערכים למפרטי הבצוע וגורמי האתר. כלכלה של ציוד מכני בבעלות עצמית, בשכירות, או במיקור חוץ. עלויות קבועות, משתנות ותקורה. ערך שרידי, תחשיבים להחזר הון, נהול עבודות עפר, מערכים משולבים, לוגיסטיקה. חשובי התפוקה של צוות משולב. קביעת גודל הצוות. זמינות מכאנית. כוח אדם להפעלה וניהול פרוייקטים. חוקי תעבורה לשינוע ציוד בכבישים. לוגיסטיקה בהפעלת ציוד מכני תחזוקה וניהולה. חוקי המכרזים לפרויקטים של עבודות עפר. עקרונות הבטיחות בהפעלת ציוד מכאני הנדסי.',
                    n: 0.097,
                },
            },
        },
        {
            i: 87,
            $: {
                '0': { v: '016111', n: 1 },
                '1': { v: 'בטון דרוך', n: 0.707 },
                '2': {
                    v: 'חומרים ציוד ושיטות דריכה, עקרונות דריכה, אנליזה של דריכה (שירות), גיאומטריה של הכבל והעמסה אקויוולנטית, הפסדי דריכה, דפורמציות, חוזק לכפיפה וגזירה במצב גבולי של שבר. אזורי עיגון, חתכים מרוכבים (טרום + בטון באתר). פרוייקט של אלמנט דרוך.',
                    n: 0.164,
                },
            },
        },
        {
            i: 88,
            $: {
                '0': { v: '016122', n: 1 },
                '1': { v: 'תכן מבנים תחת עומסי הדף ואימפקט', n: 0.408 },
                '2': {
                    v: 'אפקטים של חומרי נפץ, בערה וניפוץ, עומסי הדף במתארים שונים, פיצוץ חופשי וכלוא, הערכת תגובת מבנים לעומסי הדף, אנליזה דינמית לא לינארית בדרגת חופש אחת, פתרונות אנליטיים ונומריים של משוואות התנועה, התנהגות חומרים תחת קצבי עיבור גבוהים, פילוסופיית וקריטריוני תכן, אופני כשל של מבנים מבטון ופלדה, דיאגרמות לחץ-אימפולס, התמוטטות בשרשרת.\nתוצאות למידה: בסיום הקורס, הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להכיר את פילוסופיית וקריטריוני התכן של מבנים הנתונים לעומסי הדף ואימפקט.\n2. להעריך אפקטים של חומרי נפץ ועומסים דינמיים על מבנים.\n3. לבצע אנליזות מבניות תוך התמודדות עם התופעות הקשורות לעומסים דינמיים מהירים._\n4. להעריך את אופי התגובה כתלות בפרמטרי העומס.',
                    n: 0.103,
                },
            },
        },
        {
            i: 89,
            $: {
                '0': { v: '016124', n: 1 },
                '1': { v: 'מבנים מרחביים', n: 0.707 },
                '2': {
                    v: 'מבוא לאנליזה ותכן של מבנים מרחביים מבטון מזויין והאלמנטים התומכים אותם, קמטים, קליפות היפר (הפירבולואיד פרבולי), מיכלים.',
                    n: 0.243,
                },
            },
        },
        {
            i: 90,
            $: {
                '0': { v: '016142', n: 1 },
                '1': { v: 'הנדסת רעידות אדמה', n: 0.577 },
                '2': {
                    v: 'מבוא לסיסמולוגיה הנדסית, שיקולים גיאוטכניים בתכן מבנים לרעידות אדמה, ספקטרום התגובה (לא ליניארי), פילוסופית התכן הסייסמי של מבנים, התנהגות, אנליזה ותכן של מבנים כניעים ברעידות אדמה, תכן עמידות מבני בטון מזוין ברעידות אדמה, תכן עמידות מבני פלדה ברעידות אדמה, עקרונות שימוש באלמנטים סופגי אנרגיה ובבידוד סייסמי של מבנים.',
                    n: 0.144,
                },
            },
        },
        {
            i: 91,
            $: {
                '0': { v: '016143', n: 1 },
                '1': { v: 'מבני בטון 3', n: 0.577 },
                '2': {
                    v: 'תכונות חומרים. תכונות מוט מפלדה מצולעת (מודגם בניסוי מעבדה). הידבקות בין מוט פלדה מצולע ובין הבטון (מודגם בניסוי מעבדה). חישובי חתכים בסטדיום I ו-II. חישובי שקיעות ברכיבים קוויים לפי פרמטר אקוויוולנטי, ולפי עקום מומנט-עקמומיות (חישובים לפי פירוס מאמצים מלבני). חישוב רוחב סדק. כפיפה של קורות עם מנת זיון תקנית וגבוהה (מודגם בניסויים במעבדה). עמודים - עקומי אינטראקציה (חישובים לפי פירוס מאמצים מלבני). התנהגות קורות בגזירה (מודגם בניסוי במעבדה). עקמומיות מסדר שני ברכיבי בטון מזוין הנתונים לפעולת מומנט וכוח צירי.',
                    n: 0.113,
                },
            },
        },
        {
            i: 92,
            $: {
                '0': { v: '016203', n: 1 },
                '1': { v: 'הנדסת מערכות משאבי מים 1', n: 0.447 },
                '2': {
                    v: 'בחירת מודלים מתאימים לשילוב במודלי אופטימיזציה וסימולציה. מערכי מודלים. פונקציות המטרה למערכות משאבי מים. ניסוח מודלי אופטימיזציה וסימולציה של מערכות משאבי מים מסוגים שונים, שיטות פתרון ושיטות לניתוח ויישום התוצאות. דוגמאות מנושאים שונים, ביניהם: פיתוח מים עיליים, פיתוח וניהול אקויפרים, תכנון ותפעול רשתות חלוקה.',
                    n: 0.151,
                },
            },
        },
        {
            i: 93,
            $: {
                '0': { v: '016210', n: 1 },
                '1': { v: 'גלי מים', n: 0.707 },
                '2': {
                    v: 'עקרונות פיסיקליים ומתמטיים של גלים. משוואות היסוד וקירובים. פתרונות עבור גלים קטנים, אנרגיה ותנע של גלי-ים, יחסי גלים-זרם, פעולת הגלים, רפרקציה ודיפרקציה, גלי מים רדודים וגלי חוף (החפה).',
                    n: 0.189,
                },
            },
        },
        {
            i: 94,
            $: {
                '0': { v: '016220', n: 1 },
                '1': { v: 'נושאים באוקינוגרפיה פיסיקלית', n: 0.577 },
                '2': {
                    v: 'נושאים: אוקינוגרפיה פיזיקאלית עוסקת בתיאור המים (טמפרטורה מליחות) , ודינמיקה שלהם (זרמים, גלים, גאות ושפל). הפיזיקה של האוקינוסים והשפעתה על תפקיד האוקינוסים במערכת האקלים, חיזוי הזרמים והגלים. הקורס יכלול חצי יום הפלגה להדגמת איסוף וכן ניסויי מעבדה במיכל מים מסתובב.',
                    n: 0.158,
                },
            },
        },
        {
            i: 95,
            $: {
                '0': { v: '016223', n: 1 },
                '1': { v: 'הידרולוגיה של מי תהום: זרימה, הסע', n: 0.408 },
                '2': {
                    v: 'עקרונות הידרולוגיה של תת הקרקע, פיתוח משוואות מאזן ופתרונן למצב תמידי ולא תמידי, מבחני שאיבה, הסעת מומסים, הסעה ודיפרסיה, משוואות מאזן למומסים פתרונות אנליטיים ונומריים, הסעה ריאקטיבית, שיקום אקוויפרים. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לנסח בעיות תנועת מים במי תהום ולפתור אנליטית בעיות פשוטות. 2. לנסח בעיות מורכבות בנושא תנועת מומסים במי תהום, ולפתור אנליטית בעיות פשוטות. 3. להכיר מספר טכניקות לשיקום אקויפרים וקרקע',
                    n: 0.122,
                },
            },
        },
        {
            i: 96,
            $: {
                '0': { v: '016302', n: 1 },
                '1': { v: 'זיהום אויר', n: 0.707 },
                '2': {
                    v: 'מזהמי אויר ראשוניים ושניוניים, מקורות ואפקטים, אירוסולים - תכונות פיסיקליות וכימיות. ריאקציות פוטוכימיות, מזהמי אוויר. זיהום אויר גלובלי, פיזור אטמוספרי של מזהמי אויר, מדידות וניטור איכות האויר, טיפול מנהלי ותחיקתי בזיהום אויר, איכות אויר פנים .',
                    n: 0.167,
                },
            },
        },
        {
            i: 97,
            $: {
                '0': { v: '016304', n: 1 },
                '1': { v: 'פיסיקה מתקדמת של האטמוספירה', n: 0.5 },
                '2': {
                    v: 'הקורס יעסוק לעומק בתופעות מטאורולוגיות ובקשר שלהן לאיכות האוויר. הנושאים שיילמדו בקורס כוללים: תופעות מטאורולוגיות בסקאלות מרחב וזמן שונות, מערכות מזג אוויר בישראל, שכבת הגבול הפלנטרית, טורבולנציה, חתך רוח לוגריתמי, שטפי חום וחומר באטמוספירה, זרימה בנוף, פיסיקה של עננים ויצירת משקעים תוצאות למידה: בסיום הקורס הסטודנט: 1. יכיר מגוון של תופעות מטאורולוגיות להן אופייני מרחב וזמן שונים. 2. יכיר את המודלים המרכזיים המתארים את התופעות הללו. 3. יהיה מסוגל לפתור בעיות כמותיות המשתמשות במודלים הנ"ל. 4. יוכל להתמודד עם טקסטים מדעיים העוסקים בתופעות הללו, לנתח אותם, ולהציגם בכיתה. 5. לדון בקשרים שבין תופעות מטאורולוגיות בסקאלות זמן ומרחב שונות לבין תופעות ואירועי זיהום אוויר.',
                    n: 0.099,
                },
            },
        },
        {
            i: 98,
            $: {
                '0': { v: '016329', n: 1 },
                '1': { v: 'הידרוביולוגיה', n: 1 },
                '2': {
                    v: 'מונחים בסיסיים בפיזיקה, כימיה וביולוגיה של מים. אספקטים כלליים של לימנולוגיה ואוקיאנוגרפיה. תהליכי ייצור ראשוני ושרשרות מזון בגופי מים. פיזיולוגיה כללית של יצורי מים שונים. אצות וחשיבותן לאדם. מעגלים כימיים בגופי מים שונים. תהליכי יוטרופיקציה באגמים ובמפרצים. זיהום מים והשפעתו על הסביבה. הבנת תהליכים ביולוגיים ופיזיקליים באוקיינוסים.',
                    n: 0.146,
                },
            },
        },
        {
            i: 99,
            $: {
                '0': { v: '016336', n: 1 },
                '1': { v: 'טכנולוגיות לניהול משאבי אויר', n: 0.5 },
                '2': {
                    v: 'טיפול מנהלי ותחיקתי בזיהום אויר. תקנים לאויר הפתוח ולמקורות הזיהום. מקורות זיהום עיקריים, עריכת אינבנטר של פליטות מזהמים. רכב מנועי בנזין ודיזל, שריפה של פחם, גז, ונפט גולמי, תעשיות מתכת ונייר, בתי זיקוק, שריפה של פסולת, שריפות פתוחות, ייצור מלט, מחצבות. עקרונות של בקרת גזים וחלקיקים. ציקלונים, משקעים אלקטרוסטטיים, בתי שקים, קולטנים, מערכות ספיחה ובליעה.',
                    n: 0.135,
                },
            },
        },
        {
            i: 100,
            $: {
                '0': { v: '016337', n: 1 },
                '1': { v: 'אלקטרוכימיה סביבתית', n: 0.707 },
                '2': {
                    v: 'יסודות של אלקטרוכימיה: תגובות חימצון-חיזור, פוטנציאלים אלקטרוכימיים, תגובות על אלקטרודות, תרמודינמיקה וקינטיקה של תהליכים אלקטרוכימיים. טיפול במים ושפכים: אלקטרודיאליזה, ספיחה אלקטרוכימית של יונים, חמצון אלקטרוכימי, הפקת מתכות, חיישנים. צבירה והמרה של אנרגיה: תאי דלק, תאי חמזור מוזרמים, קבלים אלקטרוכימיים. תוצאות למידה: עם סיום הקורס הסטודנט 1. ידע את העקרונות ואת החוקים הבסיסיים של האלקטרוכימיה. 2. יכיר את המגוון הרחב של התהליכים האלקטרוכימיים הקיימים והעתידיים שמטרתם בטיפול במים ושפכים, אגירת אנרגיה חשמלית והפקה של חומרי גלם שונים. 3. הסטודנט יהיה מסוגל לבצע את התכנון הבסיסי של ריאקטורים אלקטרוכימיים מסוגים שונים.',
                    n: 0.106,
                },
            },
        },
        {
            i: 101,
            $: {
                '0': { v: '016339', n: 1 },
                '1': { v: 'גורל מזהמים אנתרופוגנים בסביבה', n: 0.5 },
                '2': {
                    v: 'התנהגות כימית וביולוגית של מזהמים: היכרות עם מזהמים שונים ועם התכונות המשפיעות על גורלם בסביבה. יחסי הגומלין בין מזהמים למרכיבי הקרקע והמים (ספיחה, הסעה ופירוק) והתנאים הסביבתיים המשפיעים על התהליכים. פירוק מיקרוביאלי של מזהמים - מטבוליזם של תרכובות אורגניות, השפעת ההרכב הכימי על פירוק ביולוגי. חיזוי הפירוק הביולוגי של מזהמים סביבתיים תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל : 1. להכיר את קבוצות המזהמים העיקריות ותכונותיהם הפיזיקאליות והכימיות. 2. לדעת מהם התהליכים המרכזיים בהם משתתפים המזהמים השונים בסביבה (ספיחה,הסעה,המסה /שיקוע, קומפלקסציה, פירוק כימי וביולוגי), ומה הגורמים הסביבתיים המשפיעים עליהם. 3. לבנות איזותרמות ספיחה, הכרת המודלים הנפוצים לתיאור האיזותרמות והקבועים המשמעותיים של המודלים. 4. להבין את המשמעות של קינטיקה של תהליכי ספיחה, התאמה למודלים קינטיים וחילוץ הקבועים המשמעותיים. 5.להכיר את תהליכי החמצון חיזור בקרקע והשפעתם על המזהמים 6. להכיר את האנזימים השונים והמסלולים הביוכימיים העיקריים של פירוק תרכובות סינטטיות אליפטות, טבעתיות וארומטיות. 7. להעריך, בהינתן קרקע /מערכת מימית ומזהם, מה התהליכים העיקריים הצפויים להתרחש. 8. לחזות את הפירוק הביולוגי של מזהמים סביבתיים',
                    n: 0.079,
                },
            },
        },
        {
            i: 102,
            $: {
                '0': { v: '016504', n: 1 },
                '1': { v: 'אבטחת איכות ובקרת איכות בבנייה', n: 0.447 },
                '2': {
                    v: 'הקורס דן בהיבטים שונים של אבטחת איכות ובקרת איכות באתרי בנייה ומפעלים. במסגרת הקורס ילמדו עקרונות בקרת איכות ואבטחת איכות והכלים המתמטיים המתאימים, דרכים מעשיות ליישום בקרת האיכות ובעיות ספציפיות של אבטחת ובקרת איכות בתכנון, באתר הבנייה, בעבודות תשתית ועפר, במפעל הטרומי ובמפעל המייצר חומרים ורכיבים לתעשיות הבניה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 103,
            $: {
                '0': { v: '016505', n: 1 },
                '1': { v: 'בנייה בעץ - חומרים וטכנולוגיה', n: 0.447 },
                '2': {
                    v: 'מבנה עץ ותכונותיו המכניות והפיסיקליות (מראה, צפיפות, תכולת רטיבות ושינויי נפח, חוזק וצורות כשל, עיבורים). קשר בין מבנה ותכונות. מיון וסיווג של עצים לפי תכונות מכניות. ייצור עץ, לבידים ומוצרי עץ. חיבורים בעץ. רכיבים מרוכבים מעץ. בלייה, קיימות והגנת עץ ושימורו. עקרונות תכן מבני עץ. מבנים מעץ.',
                    n: 0.146,
                },
            },
        },
        {
            i: 104,
            $: {
                '0': { v: '016619', n: 1 },
                '1': { v: 'תכן טפסות לבטון', n: 0.577 },
                '2': {
                    v: 'מבוא לטפסות, סיווג טפסות, היבטי ביצוע והיבטים כלכליים, תפקידי מהנדס הביצוע, עקרונות תכן טפסות, שיטת המאמצים המותרים, תכן טפסות במצב גבולי, תקינה לטפסות, עומסים אנכיים ואופקיים, חישוב סטטי וחישוב כלכלי, תשומות עבודה, בטיחות בטפסות, תכן טפסה אופקית, תכן טפסה אנכית, תכן טפסה מבוססת מגדלי תמיכה גבוהים, טפסות מודולריות, טפסות מתועשות, טפסות מיוחדות, טפסות לגשרים,טפסות למנהרות.',
                    n: 0.135,
                },
            },
        },
        {
            i: 105,
            $: {
                '0': { v: '016709', n: 1 },
                '1': { v: 'התכנון העירוני, האזורי והארצי', n: 0.5 },
                '2': {
                    v: 'נושאים: מושגים בתכנון ערים וחקר מערכות התחבורה, כולל: ההירארכיה התכנונית בישראל, חוק התכנון והבניה, תכנית מתאר ארצית תמא-53. המערכת התחבורתית הארצית כפי שמוצגת בתמאות השונות (תמא 3-דרכים, תמא 23) מסילות ברזל, תכניות מקומיות ואזוריות ומערכות התחבורה המוצעות בהן. נספחי תנועה ותקני חניה, הפיתוח המרחבי ככלי לפיתוח מערכת נגישות, ההשפעות התחבורתיות על התכנון העירוני/איזורי ועל האוכלוסיה.',
                    n: 0.135,
                },
            },
        },
        {
            i: 106,
            $: {
                '0': { v: '016801', n: 1 },
                '1': { v: 'חשבון תאום 2', n: 0.577 },
                '2': {
                    v: 'השלמה לתאום מותנה עם וללא נעלמים, תאום עם אילוצים קשיחים וסטוכסטיים על הפרמטרים, תאום בגישה כוללנית, תאום פונקציות אמפיריות בעזרת פולינומים אורתוגונליים וטריגונומטריים, פרמטרי דאטום, מבחני השערה סטטיסטיים.',
                    n: 0.189,
                },
            },
        },
        {
            i: 107,
            $: {
                '0': { v: '016819', n: 1 },
                '1': { v: 'מיפוי ימי מתקדם', n: 0.577 },
                '2': {
                    v: 'תורת המדידה הימית, תקן המיפוי הבינלאומי, מערכת מיפוי רב-אלומה (מולטי-בים), הכרה ושימוש בתכנת עיבוד נתונים מסחרית.',
                    n: 0.25,
                },
            },
        },
        {
            i: 108,
            $: {
                '0': { v: '016828', n: 1 },
                '1': { v: 'עקרונות בהערכת שווי מקרקעין', n: 0.5 },
                '2': {
                    v: 'שיטות שונות בהערכת שווי מקרקעין. נושאים: יחידות מדידה בהערכת שווי מקרקעין, עקרונות שווי, ניתוח מרכיבי שווי, ניתוח סוגי שווי, כתיבת דו"ח שומה, הערכת מקרקעין ביעוד למגורים, הערכת מקרקעין מניבים, נכסים חקלאיים. מקומם של עקרונות שומה בשומת מקרקעין, חבילת הזכויות, סוגיות בהערכת שווים של נכסים לצרכי ציבור והגישות העקרוניות לפתרונן, נכסים מיוחדים -הגדרות, מאפיינים, גישות עקרוניות.',
                    n: 0.135,
                },
            },
        },
        {
            i: 109,
            $: {
                '0': { v: '016832', n: 1 },
                '1': { v: 'ניווט ומערכות אינרציאליות', n: 0.577 },
                '2': {
                    v: 'מערכות קואורדינאטות. טרנספורמציה בין מערכות קואורדינאטות. מערכות ניווט. גירוסקופים, מדי-תאוצה. מערכות ניווט אינרציאליות:גורמי שגיאה, אתחול וכיול. מערכות אינרציאליות משולבות GPS .',
                    n: 0.218,
                },
            },
        },
        {
            i: 110,
            $: {
                '0': { v: '017022', n: 1 },
                '1': { v: 'תהליכים ביולוגיים בהנדסת סביבתית', n: 0.5 },
                '2': {
                    v: 'אנרגטיקה וגידול מיקרוביאלי, ראקציות ביולוגיות המיושמות בטכנולוגיות להרחקת מזהמים: ניטריפיקציה, דניטריפיקציה, הרחקת זרחן, תהליכים אנאירובים, בריכות טיפול, "אגנים ירוקים".',
                    n: 0.229,
                },
            },
        },
        {
            i: 111,
            $: {
                '0': { v: '018002', n: 1 },
                '1': { v: 'אתיקה בהנדסה', n: 0.707 },
                '2': {
                    v: 'קורס זה מיועד לסטודנטים להנדסה ומטרתו הכרה והבנת המושגים הבסיסיים באתיקה,התיאוריה וההיבטים המעשיים, שהם מרכיב מובנה בעבודה ההנדסית. החומר הנלמד יאפשר להבין את הקשר החשוב בין אתיקה להנדסה, יאפשר את יישום תיאוריית המוסר הקלאסית וההתנהגות הראויה של המהנדס ושילובם בתהליך קבלת החלטות אתיות. הקניית הידע, המיומנות והכרת הגישות והשיטות, יסייעו למהנדס בעבודתו המקצועית ההנדסית, בפרויקטים יישומיים ובמחקר. החברה המודרנית מציבה מידה רבה של אחריות על אנשי המקצוע שלה, ובפרט על קהילת המהנדסים. היא מחייבת אותם להתנהל באופן ייחודי והולם כפי שהחברה והקהילה הסכימה וקבלה על עצמה. ללימוד ולהבנת האתיקה המקצועית יש חשיבות רבה בתהליך ההכשרה וההתפתחות של הסטודנט לעיצובו כמהנדס מצליח ומקצועי ברמה גבוהה. לימוד האתיקה מסייע לתלמידים לפתח מיומנויות רלוונטיות בתחום התקשורת עם בעלי העניין, הצבת שיקולים נכונים, התבוננות חדה וחשיבה נכונה ולבסוף קבלת החלטות ראויות. מיומנויות אלה משפרות את יכולות הסטודנטים, מספקות כלים יעילים ומסייעות להם להתמודד עם היבטים אחרים של העבודה ההנדסית, כאינדיבידואל וגם בעבודה בצוות. לימוד האתיקה ההנדסית בקורס זה חשוב ומסייע לסטודנטים להתכונן לקראת החיים האמיתיים כמהנדסים ולקראת פיתוח הקריירה המקצועית העתידית. תכני הקורס בנויים ממספר שלבים: הראשון, יסודות האתיקה המקצועית ההנדסית. השני,היבטים אתיים בדיסציפלינות משלימות ותומכות ועיקרן, תכן ותכנון, הנדסת בטיחות, ניהול פרוייקטים,ניהול סיכונים, הנדסת מערכות, סביבה וקיימות. השלישי, אתיקה בנושאים מתקדמים כגון:אתיקה בתוכנה ובמערכות מחשב, אינטליגנציה מלאכותית וביג-דאטה, בחדשנות ויצירתיות, ברובוטיקה, במערכות חכמות, ברכבים אוטונומיים ומערכות אוטונומיות, באתיקה ארגונית ובמחקר, ועוד. השלב האחרון הוא העבודות הסמינריוניות שיוצגו ע"י הסטודנטים בשיעורים האחרונים. תוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל: 1. להבין את התפקידים והחובות שלו כאיש מקצוע, תוך ראייה ערכית על כל בעלי העניין . 2. להגדיר ולנתח דילמות אתיות ולקבל החלטות המשולבות בעולם ההנדסה. 3. לשלב ערכים אנושיים, כגון: בטיחות וכבוד האדם ורווחתו, בחשיבה ובתהליכים ההנדסיים.',
                    n: 0.061,
                },
            },
        },
        {
            i: 112,
            $: {
                '0': { v: '018101', n: 1 },
                '1': { v: 'תכן בנינים רבי-קומות 1', n: 0.5 },
                '2': {
                    v: 'הגורמים המשפיעים על תכן בנינים גבוהים. אופי האלמנטים הנושאים וסכימות סטטיות. קשיחות ומרכז קשיחות - מגבלות שיטת מרכז הקשיחות. אנליזה מקורבת של מסגרות רבות קומות וקירות עם פתחים. התחלקות הכוחות האופקיים בין אלמנטי הקשחה בעלי אופי שונה: מסגרות, גרעינים וקירות מלאים ופתוחים. פתרון בעיות סטטיות באמצעות מחשב. שימוש בתכניות סטנדרטיות.',
                    n: 0.141,
                },
            },
        },
        {
            i: 113,
            $: {
                '0': { v: '018121', n: 1 },
                '1': { v: 'עקרונות היציבות של מבנים', n: 0.5 },
                '2': {
                    v: 'מבוא: תופעת הקריסה והסברה הפיסיקלי. התנהגות לא-לינארית, קריסת מבנה עמודים, קורות, מסגרות, פלטות, מודלים לייצוג תופעת קריסה. התנהגות לא לינארית. שיטות פתרון, גלרקין, ריץ. הפרשים ואלמנטים סופיים. קריסה צידית וקריסה בפיתול.',
                    n: 0.18,
                },
            },
        },
        {
            i: 114,
            $: {
                '0': { v: '018130', n: 1 },
                '1': { v: 'סמינר מתקדם בהנדסת מבנים', n: 0.5 },
                '2': {
                    v: 'חקירה הנדסית בנושא נבחר הקשור בהנדסת מבנים. החקירה תכלול: הגדרת הבעיה, ביצוע סקר ספרותי בקורתי ואיסוף נתונים קיימים. נתוח הנתונים והכנת תכנית לחקירה. חקירת הבעיה בעזרת מודלים תאורטיים ו/או בעזרת ניסויי מעבדה. סיכום החקירה וממצאים. הסקת מסקנות והמלצות להמשך מחקר. החקירה תוצג בדו"ח מפורט ובהרצאה בפני סטודנטים וחברי סגל.',
                    n: 0.143,
                },
            },
        },
        {
            i: 115,
            $: {
                '0': { v: '018139', n: 1 },
                '1': { v: 'נושאים באופטימיזציה טכנולוגית', n: 0.577 },
                '2': {
                    v: 'אופטימיזציה: אופטימיזציה כמטרת העל האוניברסלית, הגדרת אופטימיזציה, הפרמטרים הדומיננטיים של האופטימיזציה - פשטות, רובוסטיות וסטנדרטיציה, הפיתוח כתהליך איטרטיבי: מפרט הדרישות והקונספט - האסטרטגיה, התכן מפורט - הטקטיקה (דוגמאות: מערכת מדידה לתעשיית המוליכים למחצה, ריהוט גן מפלסטיק, מחלף עין-הקורא וכביש 6, נמל היובל באשדוד, בואינג 747 ו-737 לעומת 737MAX, מקרר ווסטינגהאוז). הגדרת דרישות: דרישות גנריות ממערכות ומוצרים - דרישות לקוח ודרישות שרשרת הערך, המכנה המשותף בין הדרישות ממוצרים ודיסציפלינות שונות, הקצאת משקלים מאוזנת לדרישות (דוגמאות: מוצרי צריכה, היי-טק, תשתיות ותחבורה). גיבוש הקונספט האופטימאלי: ארבע שיטות לגיבוש הקונספט האופטימאלי: מלמטה למעלה במקרה של "WIN-WIN", המצאה מזדמנת של אלטרנטיבות ובחינה משוקללת, טבלה מורפולוגית, אזכור המודל המתמטי המפושט (ליניארי) והמודל ה"שלם" (הלא ליניארי) כרגע להרצאות הבאות. המודל המתמטי המפושט: המודל המתמטי הליניארי לגיבוש הקונספט האופטימאלי: הבעת התצורה באמצעות אבני בניין + וקטור תצורה בינארי, בניית מטריצת האילוצים וניסוח האילוצים, מילוי הדרישות ווקטור משקל הדרישות ומציאת וקטור התצורה האופטימאלי למקסום המענה לדרישות בעזרת תכנת "SOLVER" (דוגמאות: רכב נוסעים-מסחרי, פלוטר לייזר), הרזולוציה הגסה של משקל הדרישות ושל מידת התרומה של אבני הבניין אשר המספיקה לגיבוש הקונספט האופטימלי. מודל המתמטי המלא: המודל המתמטי הלא ליניארי (ה"שלם") לגיבוש לגיבוש הקונספט האופטימאלי - תוספת השפעת קשרי הגומלין בין אבני הבניין לבין עצמן על מידת המענה לדרישות (דוגמאות: מנוף מתנייע לקיבוע גובה סיפונים באוניות, תחנת בדיקה למעגלים מודפסים, מבנה נתב"ג). שיקולים של שכל ישר: הימנעות מ"דרישות יתר", שכל ישר כמרכיב משמעותי בגיבוש קונספטים, בדגש על בטיחות (דוגמאות: הכור הגרעיני בפוקושימה, מודל לגיבוש הקונספט הרובוסטי: הרחבת המודל המתמטי לגיבוש הקונספט הרובוסטי (מעין סקר וירטואלי-מתמטי של בעלי עניין) והפקת וקטור התצורה של המוצר האופטימאלי. פוטנציאל הפישוט, הייעול וההוזלה של מוצרים: מידת יכולת המימוש של דרישות "שרשרת הערך" במוצרים מדיסציפלינות ותעשיות שונות (דוגמאות: סורק למעגלים מודפסים, מערכת לחניה אוטומטית, רובוט מטפס על מדפים במחסן אוטומטי). תהליכי פיתוח אופטימאליים ותרבות ארגונית: תהליך הפיתוח האופטימאלי ותכנון אבני הדרך כמענה לאי הוודאות בפיתוח, להשגת יעדי הביצועים, העלויות והזמן לשוק, תרבות ארגונית כמאיצה או כמעכבת (דוגמאות: התרסקות הצ\'לנג\'ר, משבר טויוטה ב-2010, בואינג 787 ו-737MAX, נתיב התחבורה הציבורית בז\'בוטינסקי פ"ת), סוגיית אי הוודאות במענה למכרזים. שיפור כושר התחרות של התעשייה הישראלית הודות לאופטימיזציה, בדגש על פישוט והורדת עלויות: יתרונות וחסרונות יחסיים של היצור בישראל ומידת הכדאיות בהעברת ייצור לחו"ל, פוטנציאל ההתייעלות וההוזלה של מוצרים. פרזנטציות של הסטודנטים ודיון מסכם: גיבוש קונספטים ותצורות אופטימאליות למוצרים ומערכות אשר יועלו ע"י הסטודנטים, סיכום הקורס._\nת צאות למידה: האקדמיה מכשירה את הסטודנטים להנדסה במקצועות בתחום מדעי ההנדסה ובתחומי ההנדסה הספציפיים למגמות הלימוד (מכניקה, אווירונאוטיקה, חשמל, כימיה, מדעי המחשב, תעשייה וניהול וכו ). האקדמיה אינה- מכשירה את הסטודנטים במתודולוגיה ליצירה הנדסית איכותית וכלכלית בדיסציפלינות השונות, שהינה הדרך לחיבור הידע ואבני הבניין הנ ל לכדי מוצרים, מערכות ופרויקטים העומדים ביעדי הביצועים, העלות ולוח הזמנים. הקורס המוצע אמור לענות על הפער ולהכשיר את הסטודנטים של אופטימיזציה טכנולוגית ופרויקטלית. שתאפשר כמהנדס לעמוד בדרישות הביצועים.התקציב ולו"ז במינימום סבבים של שינויים ועדכונים. נלמד כיצד להשיג ולמדוד אופטימיזציה ויציע מתודוליה ומודלים מתמטיים, ליניאריים ולא ליניאריים לגיבוש קונפסטים טכנולוגיים ופרויקטליים אופטימליים.',
                    n: 0.046,
                },
            },
        },
        {
            i: 116,
            $: {
                '0': { v: '018310', n: 1 },
                '1': { v: 'סמינר מתקדם בהנדסת סביבה ומים', n: 0.447 },
                '2': {
                    v: 'חקירה הנדסית בנושא נבחר בשטח הנדסת הסביבה ומשאבי מים. החקירה תכלול הגדרת הבעיה, סקר ספרותי ו/או איסוף נתונים, חקירת הנושא בעזרת מודלים מתמטיים ו/או ניסויי מעבדה או ניסויי שדה, ניתוח תוצאות, הסקת מסקנות והמלצות. העבודה תסוכם בדו"ח מקצועי והרצאה בפני סטודנטים וחברי סגל במסגרת הסמינריון בשטח.',
                    n: 0.147,
                },
            },
        },
        {
            i: 117,
            $: {
                '0': { v: '018423', n: 1 },
                '1': { v: 'סמינר מתקדם בגיאוטכניקה', n: 0.577 },
                '2': {
                    v: 'חקירה הנדסית בנושא נבחר בשטח גיאוטכניקה. החקירה תכלול: 1. הגדרת הבעיה. 2. ביצוע סקר ספרותי ביקורתי ואיסוף ניתונים קיימים. 3. נתוח הנתונים. 4. חקירת הבעיה בעזרת מודלים תאורטיים ו/או ניסויי מעבדה או נסויי שדה. 5. סיכום החקירה, הסקת מסקנות והמלצות להמשך מחקר, 6. החקירה תוצג בדו"ח מפורט ובהרצאה לפני סטודנטים וחברי סגל.',
                    n: 0.139,
                },
            },
        },
        {
            i: 118,
            $: {
                '0': { v: '018501', n: 1 },
                '1': { v: 'הערכת מחזור חיים במערכות הנדסה', n: 0.447 },
                '2': {
                    v: 'כלי ניתוח מערכות (למשל מחזור חיים, ניתוח זרימת חומרים, אינדיקטורים לקיימות, הערכה כלכלית) לצורך הערכת יחסי גומלין בהיבטים הסביבתיים והכלכליים של תכנון הנדסי וקבלת החלטות. יושם דגש על דיווחים של בניה ירוקה. תוצאות למידה: עם סיום הקורס הסטודנט יוכל: 1. להבין את המורכבות של נושאים סביבתיים וקיימות הקשורים לפעילויות הנדסיות בסביבה הבנויה. 2. מודעים לכלים האנליטיים ולמשאבים האנליטיים להערכת ההשלכות על הסביבה, תוך שימוש בפרספקטיבה של מערכות.\n3. ליישם שיטות וכלים הקשורים לתהליך-קלט פלט כלכלי - LCA.',
                    n: 0.115,
                },
            },
        },
        {
            i: 119,
            $: {
                '0': { v: '018601', n: 1 },
                '1': { v: 'ניהול חברת בנייה', n: 0.577 },
                '2': {
                    v: 'תשומות ותפוקות הבנייה במשק הישראלי, סוגי חברות בנייה, תפקידי ניהול בחברת בנייה, עקרונות הארגון של חברות בנייה, מערכות מידע ובקרה בחברות בנייה, תכנון איסטרטגי בחברות בניה, מדידת התפקוד בחברות בנייה.',
                    n: 0.183,
                },
            },
        },
        {
            i: 120,
            $: {
                '0': { v: '018616', n: 1 },
                '1': { v: 'אספקטים משפטיים בבניה', n: 0.577 },
                '2': {
                    v: "אחריותו המקצועית והחוקית של המהנדס, עקרונות משפטיים בענין חוזים בהדגשה על חוזי שרותים מקצועיים ובנייה. הוצאת מכרזים וקבלתם, התקשרות בחוזה בנייה ובעיות הנובעות בגין הספקת מידע הלקוי בחסר. שינויים בתנאים ובהיקף העבודה, פיקוח הנדסי ואדריכלי. ביטוח מקצועי בעבודה באתר. עיכובים, כח עליון. ערבות ביצוע העבודה ואיכותה. פיצויים ותרופות משפטיות אחרות, תהליך משפטי ומנהלי לאישור תכניות לפי חוקי התכנון, היתרי בנייה. אחריות לנזיקין באתר כלפי עובדים וצד ג'. יישוב סכסוכים מקצועיים על ידי בית המשפט ובוררות.",
                    n: 0.115,
                },
            },
        },
        {
            i: 121,
            $: {
                '0': { v: '018623', n: 1 },
                '1': { v: 'סמינר מתקדם בניהול הבנייה', n: 0.5 },
                '2': {
                    v: "עבודה סמינריונית מורחבת בהיקף של 5 נק', בעלת אופי עיוני, אנליטי או ניסויי, הקשורה לניהול הבנייה. העבודה תכלול הגדרת בעיה, פירוט שיטת הפתרון ופתרון הבעיה. היא יכולה לכלול סקר ספרות, פיתוח מודל, איסוף נתוני שדה וכד', הצגת ממצאים וניתוחם, והסקת מסקנות והמלצות. התוצאות תוצגנה בדו\"ח מפורט ובמתן הרצאה בנושא בפני סטודנטים וחברי סגל.",
                    n: 0.137,
                },
            },
        },
        {
            i: 122,
            $: {
                '0': { v: '018703', n: 1 },
                '1': { v: 'סמינר מתקדם בהנדסת תחבורה ודרכים', n: 0.447 },
                '2': {
                    v: 'חקירה הנדסית בנושא נבחר הקשור בהנדסת תחבורה ודרכים החקירה תכלול הגדרת הבעיה והכנת התכנית לחקירה, בצוע סקר ספרותי בקורתי מקדים. אסוף נתונים קיימים נתוח הנתונים תוך העזרות במודלים קיימים במחשב. סכום החקירה וממצאיה, הסקת מסקנות והמלצות וכווני מחקר עתידיים. החקירה תוצג בדוח הנדסי מפורט ובמתן הרצאה בנושא בפני סטודנטים וחברי סגל. המקצוע מיועד למסלול "מגיסטר בהנדסה" (מגיסטר ללא תיזה) בלבד.',
                    n: 0.129,
                },
            },
        },
        {
            i: 123,
            $: {
                '0': { v: '018708', n: 1 },
                '1': { v: 'מודלים מתקדמים לניתוח ביקושים', n: 0.5 },
                '2': {
                    v: 'מודלים סטטיסטיים שימושיים בתכנון תחבורה: CLUSTER ANALYSIS, FACTOR ANALYSIS ומשוואות סימולטניות. מודלים אקונומטרים מתקדמים של ביקוש בדיד: פרוביט ולוגיט קרנל. אמידת מודלים בעזרת סימולציה, מקסימיזציה נומרית ושיטת הנראות המקסימלית בסימולציה.',
                    n: 0.183,
                },
            },
        },
        {
            i: 124,
            $: {
                '0': { v: '018709', n: 1 },
                '1': { v: 'מודלים בסימולצית תעבורה', n: 0.577 },
                '2': {
                    v: 'הדמיה כטכניקה לפתרון בעיות דינמיות מורכבות, סיווג טכניקות הדמיה, סיווג ומאפיינים של מודלים של הדמיה בתעבורה, מקרוסקופי, מזוסקופי ומיקרוסקופי. שלבים בבנית מודל ההדמיה: בחירת מודל, תכנון הניסוי, כיול, אימות, ביצוע הניסוי וניתוח התוצאות, דוגמאות ליישומים.',
                    n: 0.169,
                },
            },
        },
        {
            i: 125,
            $: {
                '0': { v: '018812', n: 1 },
                '1': { v: 'חשבון תאום 3', n: 0.577 },
                '2': {
                    v: 'תאום רשתות חופשיות בשיטת היפוך מוכלל של מטריצות סינגולאריות. תאום תצפיות מסוגים שונים. מודל קולוקציה לחיזוי. תאום בשלבים מודלים דינאמיים ו- KALMAN FILTER.',
                    n: 0.209,
                },
            },
        },
        {
            i: 126,
            $: {
                '0': { v: '018817', n: 1 },
                '1': { v: 'עיבוד מידע גיאו-מרחבי', n: 0.577 },
                '2': {
                    v: 'שיטות מתקדמות לקליטה והסבת נתונים, המרת נתונים: RASTER TO VECTOR, התמרות והטיפול בהיטלים,עקרונות הטופולוגיה ויישומה בניתוח מרחבי מתקדם. מסדי נתונים מתקדמים: GEODATABASE, מבנה הנתונים GEO-RELATIONAL מול מבנה הנתונים OBJECT-COMPONENT, שימוש מתקדם במודל גובה ספרתי, יישומים במודל הנתונים הרסטרי, יישומים בתלת-מימד, ניתוח רשתות, CONFLATION, LINEAR REFERENCING, סטטיסטיקה מרחבית, עיגון מרחבי GEOCODIND, שילוב תיב"מ עם ממ"ג, חידושים בממ"ג באינטרנט.',
                    n: 0.132,
                },
            },
        },
        {
            i: 127,
            $: {
                '0': { v: '018825', n: 1 },
                '1': { v: 'ניתוח ספקטראלי בגיאודזיה', n: 0.577 },
                '2': {
                    v: 'קורלציות בין נעלמים, משמעותן והטיפול בהן. רמת פתירות הנעלמים. בעיות בלתי פתירות ורגולריזציה של טיכונוב.',
                    n: 0.258,
                },
            },
        },
        {
            i: 128,
            $: {
                '0': { v: '018826', n: 1 },
                '1': { v: 'סמינר מתקדם בלימודי מקרקעין', n: 0.5 },
                '2': {
                    v: 'טיפול וניתוח בעיות כלליות בשומת מקרקעין. הכנת שומה מלאה (איסוף מידע תכנוני, משפטי, פיסי ונתוני שוק, גיבוש עקרונות, גורמים ושיקולים, עריכת תחשיבים וקביעת השווי, הכנת דו"ח שומה מלא והצגת השומה). נושאי העבודה יכללו את התחום התיאורטי של שמאות המקרקעין וכן את התחום המעשי והמחקרי של עבודת שדה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 129,
            $: {
                '0': { v: '019001', n: 1 },
                '1': { v: 'יסודות מתמטיים למהנדסים', n: 0.577 },
                '2': {
                    v: 'חזרה על אלגברה לינארית, מטריצות חיוביות, משוואות שווי משקל: בדידות ורציפות. ערכים עצמיים ופונקציות עצמיות. משוואת לפלאס. שיטות אנליטיות: סדרות פורייה, קונבולוציות, התמרות פורייה, משתנים מורכבים והעתקות קונפורמיות.',
                    n: 0.189,
                },
            },
        },
        {
            i: 130,
            $: {
                '0': { v: '019003', n: 1 },
                '1': { v: 'שיטות נומריות למהנדסים', n: 0.577 },
                '2': {
                    v: 'פתרון בעיות הנדסיות בשיטות נומריות: מערכת משוואות ליניאריות עם דגש על מטריצות דלילות, פתרון משוואות דיפרנציאליות רגילות עם תנאי התחלה ותנאי גבול, פתרון משוואות דיפרנציאליות חלקיות אליפטיות ופרבוליות בשימוש בשיטת הפרשים סופיים, מציאת מינימום ומקסימום לפונקציות בשיטות דטרמיניסטיות וסטוכסטיות. אינטרפולציה ואינטגרציה נומרית. הקורס ילווה במספר תרגילי בית גדולים אשר יתנו לסטודנט התנסות והבנה עמוקה יותר ע"י פתרון בעיות אמיתיות.',
                    n: 0.13,
                },
            },
        },
        {
            i: 131,
            $: {
                '0': { v: '019006', n: 1 },
                '1': { v: 'שיטות כמותיות במערכות הנד. וניהול', n: 0.447 },
                '2': {
                    v: 'תכנות לינארי מתקדם (סימפלקס משופר). תורת הרשתות (בעית מקסימום זרימה, עץ פורס מינימלי, חתך מינימלי לרשת, סינתזה של רשת, בעיות המסלול הקצר, מחיר מינימלי לרשת זרימה, מוקדים אופטימליים). חזרה על תכנות בשלמים (תכונות ומאפיינים, שיטת "חלוקה וחסימה", תכנון מעורב בשלמים, שיטת חתוך משטחים). תכנון דינמי (הקצאת מקורות, כופלי לגרנז\', דינמיקה ליניארית וקריטריון ריבועי). בעיות של לוחות זמנים ותהליכי זימון ( SCHEDULING ).',
                    n: 0.127,
                },
            },
        },
        {
            i: 132,
            $: {
                '0': { v: '019054', n: 1 },
                '1': { v: 'סמינר בבעיות מתקדמות בהנ.חקלאית', n: 0.5 },
                '2': { v: 'לפי נושא נבחר.', n: 0.577 },
            },
        },
        {
            i: 133,
            $: {
                '0': { v: '019057', n: 1 },
                '1': { v: 'סמינר בהנדסת סביבה ומים', n: 0.5 },
                '2': {
                    v: 'הקגורס יכלול היכרות עם נושאים מתקדמים בתחומי ההנדסה ומדעי הסביבה והמים כאשר החשיפה לתחומים אלו תתבצע על ידי נוכחות בהרצאות סמינריוניות שינתנו בנושאים אלו.',
                    n: 0.204,
                },
            },
        },
        {
            i: 134,
            $: {
                '0': { v: '019058', n: 1 },
                '1': { v: 'נושאים מתקדמים במים קרקע וסביבה', n: 0.447 },
                '2': {
                    v: 'קורס מתקדם הנועד ללימוד מעמיק של נושאים מדעיים והנדסיים במים, קרקע וסביבה. סילבוס מפורט יקבע ע"י המורה והוועדה ללימודי מוסמכים לפני הסמסטר בו יינתן הקורס. סמסטר ב\' תשע"ז: ניהול בר-קיימא של פסולת מוצקה. סמסטר א\' תשע"ט: מודלים מתמטיים של זרימה ותופעות מעבר. סמסטר ב\' תשע"ט: תנועת סדימנטים. סמסטר ב\' תשפ"א: מבוא לטכנולוגיות ייצור אנרגיה נקייה ומתחדשת.',
                    n: 0.134,
                },
            },
        },
        {
            i: 135,
            $: {
                '0': { v: '019145', n: 1 },
                '1': { v: 'נושאים נבחרים בבטון מזויין', n: 0.5 },
                '2': {
                    v: 'ההנחות התיאורטיות בתפיסת התכנון לפי מצבים גבוליים: קשרים קונסטיטוטיביים של הבטון ושל הפלדה, השלבים בהתנהגות בכפיפה של קורות מבטון מזוין, חיזוי תיאורטי של יחסי מומנט-עקמומיות בכפיפה חד-צירית, כפיפה דו-צירית, משיכות ודפורמציות במצב גבולי של הרס, עקומי אינטראקציה כוח-מומנט בעמודים, הידבקות, גזירה.',
                    n: 0.156,
                },
            },
        },
        {
            i: 136,
            $: {
                '0': { v: '019149', n: 1 },
                '1': { v: 'מכניקה של חומרים רכים', n: 0.5 },
                '2': {
                    v: 'טנזורים, קינמטיקה, חוקי מאזן, אלסטיות לא לינארית איזוטרופית, אלסטיות לא לינארית אנאיזוטרופית, תרמואלסטיות לא לינארית כימואלסטיות לא לינארית, אלקטרואלסטיות לא לינארית.\nתוצאות למידה: בסיום הקורס הסטודנטים/הסטודנטיות ידעו לחשב מבנים העשויים מחומרים רכים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 137,
            $: {
                '0': { v: '019310', n: 1 },
                '1': { v: 'טיפול מתקדם בשפכים', n: 0.577 },
                '2': {
                    v: 'איכות שפכים, הקשר בין מדדי איכות שונים. שיטות סילוק ואיכות קולחים נדרשת. סקירה כללית על תהליכי טיפול בשפכים. נושאים נבחרים בטיפול קדם וטיפול ראשוני. עקרונות הטיפול הביולוגי - שיקולים תרמודינמיים וקינטיקה. תהליכי הטיפול במצע מרחף: בוצה משופעלת לצורותיה. בריכות מאוורות, אגני חימצון. הרחקת חנקן בשיטות ביולוגיות. תהליכי הטיפול במצע קבוע: מרבגים ביולוגיים - וביו-דיסק. טיפול בבוצה: הוצאת מים, ייבוש וסילוק סופי. טיפול פיסיקוכימי. השבת שפכים.',
                    n: 0.124,
                },
            },
        },
        {
            i: 138,
            $: {
                '0': { v: '019315', n: 1 },
                '1': { v: 'סמינר בהנדסת הסביבה', n: 0.577 },
                '2': {
                    v: 'לימוד וחיוש מידע רלוונטי על נוא הקשור לאיכות הסביבה, סיכום מדעי/הנדסי ממצה של הנושא והצגתו בכיתה. כמו כן נוכחות ב-03 סמינרים מחלקתיים במהלך של עד שלושה סמסטרים רצופים ממועד הרישום לקורס וכתיבת סיכום ממצה בן עמוד אחד לכל היותר על 6 מהסימנרים הנ"ל , כפי שילמד בכיתה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 139,
            $: {
                '0': { v: '019318', n: 1 },
                '1': { v: 'כימיה של הסביבה', n: 0.577 },
                '2': {
                    v: 'שיווי משקל כימי, שיטות מתמטיות בשווי-משקל, המערכת הקרבונטית, קינטיקה, מסיסות וקומפלקסציה, תהליכי חמצון-חיזור במים ובשפכים, נושאים בכימיה אורגנית סביבתית, פוטוכימיה, מבנה האטמוספירה, כימיה טרופוספרית וסטרטוספרית ("החור באוזון"), עקרונות ושימושים בשיטות אנליטיות אינסטרומנטליות בכימיה סביבתית.',
                    n: 0.171,
                },
            },
        },
        {
            i: 140,
            $: {
                '0': { v: '019340', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת הסביבה', n: 0.5 },
                '2': {
                    v: 'הסילבוס ייקבע ע"י המורה באישור הוועדה לפני תחילת הסמסטר בו ינתן המקצוע. סמסטר א\' תשע"ט: מבוא לתוכנת פריקיוסי. סמסטר א\' תש"פ: מבוא לתוכנת פריקיוסי.',
                    n: 0.204,
                },
            },
        },
        {
            i: 141,
            $: {
                '0': { v: '019424', n: 1 },
                '1': { v: 'אספקטים גיאוטכניים של רעידות אדמה', n: 0.447 },
                '2': {
                    v: 'רקע, סייסמולוגיה, מכשירי מדידה, מאפיינים של רעידות אדמה, התנהגות של קרקע תחת העמסה מחזורית, מעבר גלי גזירה דרך חתך קרקע, תגובת אתר התנהגות של יסודות רדודים, יסודות עמוקים וקירות תומכים, יציבות מדרונות.',
                    n: 0.177,
                },
            },
        },
        {
            i: 142,
            $: {
                '0': { v: '019427', n: 1 },
                '1': { v: 'חוקים קונסטיטוטיביים בגיאומכניקה', n: 0.577 },
                '2': {
                    v: 'מאמצים ועיבורים, אלסטיות והיפראלסטיות, כניעה וז רימה פלסטית, ניסוח חוק קונסטיטוטיבי אלסטו-פלסטי מושלם, הקשיית מעוותים איזוטרופית, עקרונות האינטגרציה הנומרית, מודל קם -קליי ומכניקת קרקע במצב הוכחת ,BOUNDING SURFACE PLASTICITY - הקשיית מעוותים קינמטית ו ,)CRITICAL STATE SOIL MECHANICS( גבולי הגבול העליון והתחתון לעומסי כשל באנליזה גבולית, מכניזם כשל והודוגרף מהירויות, שדות מאמצים ומשטחי אי-רציפות, שיטת המאפיינים ( SLIP-LINE METHOD ) , שיטות נומריות לתרון גבול עליון ותחתון, שיטת החוזק המגויס.',
                    n: 0.12,
                },
            },
        },
        {
            i: 143,
            $: {
                '0': { v: '019520', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי הבנייה', n: 0.5 },
                '2': {
                    v: 'הסילבוס ייקבע ע"י המורה באישור הוועדה לפני תחילת הסמסטר בו ניתן המקצוע. סמסטר א\' תשע"ז: הערכת מחזור חיים סביבתית. סמסטר א\' תשע"ח: בטיחות קרינה בבנייה.',
                    n: 0.2,
                },
            },
        },
        {
            i: 144,
            $: {
                '0': { v: '019625', n: 1 },
                '1': { v: 'ניהול פרוייקטים בסביבה דינמית', n: 0.5 },
                '2': {
                    v: 'השתנות הנחות היסוד בניהול פרוייקטים, תכנון ובקרה בתנאי אי ודאות, יצירת מיקוד מוטה-תוצאות, קריאת תיגר על המוסכמות, עבודת צוות המבוססת על אמון ותלות הדדית, תקשורת אינטנסיבית, התאמת עקרונות הניהול לפרוייקט, תפקידי מנהל הפרוייקט בשלבי הפרויקט, ניהול שינוי ארגוני.',
                    n: 0.162,
                },
            },
        },
        {
            i: 145,
            $: {
                '0': { v: '019627', n: 1 },
                '1': { v: 'מדול מידע בניין מתקדם בתכן בביצוע', n: 0.408 },
                '2': {
                    v: 'עקרונות מידול מידע בנין: מידול פרמטרי ומונחה עצמים, מידול כוונת המתכנן, ויזואליזציה, אנליזות הנדסיות, פירוט לייצור וייצור ממוכן, שיתוף מודלים ושרתי מודלים, התקשרות פרויקט משולב ( IPD . סטודנטים ישתתפו בצוותים רב-מקצועיים להכנת פרויקט לאורך מחזור החיים של הבנייה, מתכן קונספטואלי עד ייצור ב- CNC.',
                    n: 0.149,
                },
            },
        },
        {
            i: 146,
            $: {
                '0': { v: '019704', n: 1 },
                '1': { v: 'מעבדה לחמרי מבנה דרכים 1', n: 0.447 },
                '2': {
                    v: 'חקירה הנדסית מעבדתית בנושא נבחר הקשור בהערכת תכונותיהם של חומרי מבנה, מיסעות בלתי מיוצבות (תשתית, מצעים ותשתיות) החקירה תכלול: ביצוע סקר ספרותי מקדים. הכנת תכנית לחקירה מעבדתית, ביצוע מערכת ניסויי המעבדה והכנת דו"ח הנדסי מסכם.',
                    n: 0.169,
                },
            },
        },
        {
            i: 147,
            $: {
                '0': { v: '019707', n: 1 },
                '1': { v: 'טכנולוגיות מתקדמות בסלילת מיסעות', n: 0.5 },
                '2': {
                    v: 'הידוק ויברציוני של שכבות מיסעה. מחזור חומרי מיסעה. שימוש בתערובות אספלטיות קרות ויישומים קרים. שימוש ביריעות גיאוטקטיליות בסלילת מיסעות. מיסעות בטון מתקדמות - מיסעות דרוכות. מיסעות בזיון נמשך. מיסעות מבטון סיבי. ייצוב חומרי מיסעה. שיטות להערכת מיסעות. שימור אנרגיה וסביבה בסלילה. מערכת ניהול מיסעות.',
                    n: 0.151,
                },
            },
        },
        {
            i: 148,
            $: {
                '0': { v: '019710', n: 1 },
                '1': { v: 'מודלים לניתוח ביקושים', n: 0.577 },
                '2': {
                    v: 'תיאורית הביקוש וחיזוי הביקוש בתכנון מערכות תחבורה. התיאוריה של בחירה בדידה ותיאורית התועלת האקראית. מודל הלוגיט והלוגיט המקוון, שיטות הנראות המקסימלית לאמידת מודלים של בחירה בדידה. מבחני השערות והערכת מודלים של בחירה בדידה ויישומיהם בניתוח הביקוש לתחבורה.',
                    n: 0.164,
                },
            },
        },
        {
            i: 149,
            $: {
                '0': { v: '019714', n: 1 },
                '1': { v: 'הנדסת תעבורה מתקדמת', n: 0.577 },
                '2': {
                    v: 'התחבורה ותכנון העיר, מאפיני זרימת תנועת עירונית, כבישים מהירים, כבישי אגרה, מאפיני תנועה בצמתים לא מרומזרים, קבלת פערים, צמתים מיוחדים (צומת מדורג, צומת סיבובי), קטעי השתזרות, השפעת משאיות על התנועה העירונית, תנועת הולכי רגל בשטח עירוני, הסדרים להגברת יעילות תפעול התנועה העירונית.',
                    n: 0.154,
                },
            },
        },
        {
            i: 150,
            $: {
                '0': { v: '019725', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת תחבורה', n: 0.5 },
                '2': {
                    v: 'הסילבוס ייקבע ע"י המורה באישור הוועדה לפני תחילת הסמסטר בו ינתן המקצוע.\nסמסטר ב\' תשע"ח: מודלים להערכת ביצועי מיסעות גמישות וקשיחות.\nסמסטר א\' תש"ף: אתיקה למהנדסים.\nסמסטר ב\' תש"ף: גישות בתכנון ובפיתוח מערכות חכמות.',
                    n: 0.18,
                },
            },
        },
        {
            i: 151,
            $: {
                '0': { v: '034010', n: 1 },
                '1': { v: 'דינמיקה', n: 1 },
                '2': {
                    v: "קינמטיקה: קינמטיקה של חלקיק, תאור תנועה בקואורדינטות שונות, מהירות זויתית, מערכת קוארדינטות נעה, מהירויות ותאוצות יחסיות, קינמטיקה של גוף קשיח. דינמיקה של חלקיק: פתרון משוואת תנועה במקרים שונים, שיטות אנרגיה, תנע ותקיפה. מערכת חלקיקים: משוואת התנועה, מרכז מסה, מאזני תנע קווי וזוויתי, כוח ומומנט שקול, אנרגיה קינטית ופוטנציאלית, מאזן אנרגיה ומערכות משמרות, התנגשויות. דינמיקה של גוף קשיח: טנזור אינרציה, תנע זויתי, אנרגיה קינטית, משוואת תנועה. מתקף, תנועה מישורית טהורה, תנועה מרחבית, איזון דינמי, משוואות טוילר, תופעות ג'ירוסקופיות.",
                    n: 0.114,
                },
            },
        },
        {
            i: 152,
            $: {
                '0': { v: '034013', n: 1 },
                '1': { v: 'תורת הזרימה 1', n: 0.577 },
                '2': {
                    v: 'מושג הרצף, תכונות זורמים. הידרוסטטיקה.משוואות שימור אינטגרליות: רציפות, משוואות תנע קווי. משוואת ברנולי. קינמטיקה: קווי מסלול, קווי זרם וקווי חלקיק. תאור דיפרנציאלי: משוואת הרציפות, משוואות התנע, משוואת האנרגיה. זורמים ניוטוניים: משוואות נוויה-סטוקס, תנאי שפה. פתרונות מדויקים. זרימה למינרית וטרבולנטית בצינור. משוואת אוילר, זרימה פוטנציאלית. אנליזה ממדית וחוקי דמויות. משוואות שכבת הגבול, פתרון לזרימה למינרית, כוחות גזירה וגרר.',
                    n: 0.132,
                },
            },
        },
        {
            i: 153,
            $: {
                '0': { v: '034015', n: 1 },
                '1': { v: 'תכן מכני 1', n: 0.577 },
                '2': {
                    v: "מבוא: שלבים עיקריים בתהליך תכן והדרישות מחלקי מכונות. סקר הרכיבים. קריטריוני כשל בסיסיים בעומס סטטי ובעומסי התעייפות. מחברים: ברגים, אטמים, סימרור, פינים, וכו'. מחברים קבועים: ריתוך.\nקפיצים.\nאמצעי הנעה: ברגי הנעה, גלים.",
                    n: 0.183,
                },
            },
        },
        {
            i: 154,
            $: {
                '0': { v: '034016', n: 1 },
                '1': { v: 'תכן מכני 2', n: 0.577 },
                '2': {
                    v: 'המשך תכן מכני 1, תוך התמקדות באלמנטים מורכבים יותר הדורשים תהליך תיכון איטרטיבי וביצוע אופטימיזציה. פתרון בעיות פתוחות וניתוח כשלונות של רכיבים כגון: תמסורות גלגלי שיניים ישרות, משופעות, חלזוניות וקוניות, מיסבים בעלי אלמנטים מתגלגלים. מיסבים הידרודינמיים. מצמדים ובלמים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 155,
            $: {
                '0': { v: '034022', n: 1 },
                '1': { v: 'מבוא למכטרוניקה', n: 0.707 },
                '2': {
                    v: 'הצגת עקרונות ניתוח ותכנון של מעגלים אלקטרוניים, עם דגש ודוגמאות ממכטרוניקה. רכיבים בסיסיים ורכיבי מוליכים למחצה. עקרונות ניתוח מעגלים חשמליים. תגובת מעגלים חשמליים לערור אנלוגי וספרתי. מערכות אנלוגיות ומעגלים המבוססים על מגברי פעולה. אלקטרוניקה ספרתית, שערים, ומעגלים מבוססי שערים. רכיבי זכרון ומעגלים מבוססי רכיבי זכרון.',
                    n: 0.149,
                },
            },
        },
        {
            i: 156,
            $: {
                '0': { v: '034028', n: 1 },
                '1': { v: 'מכניקת מוצקים 1', n: 0.577 },
                '2': {
                    v: 'וקטורים, כוחות ומומנטים, שווי משקל של מערכות (דיאגרמות גוף חופשי). שיווי משקל של מבנים, מסבכים, מסגרות ומכונות, עבודה וירטואלית, עומסים מפורסים ומרכזי כובד, כוחות ומומנטים פנימיים בקורות, מאמץ ועיבור, חוק הוק, כשל, בעיות בלתי מסוימות סטטית, עיבורים תרמיים (חד-ציר), תזוזות ועיבורים במסבכים פשוטים, מטריצת הקשיחות, פיתול ומאמץ גזירה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 157,
            $: {
                '0': { v: '034029', n: 1 },
                '1': { v: 'מכניקת מוצקים 2', n: 0.577 },
                '2': {
                    v: 'טנזור המאמץ, טנזור העיבור, קשר מאמץ עיבור (חוק הוק), קרטריוני כשל וכניעה, מאמצים נורמליים ומאמצי גזירה בכפיפה, דפורמציות אלסטיות בכפיפה, חישוב דפורמציות בשיטת אנרגיה, קורות ומסגרות לא מסוימות, קריסת עמודים.',
                    n: 0.183,
                },
            },
        },
        {
            i: 158,
            $: {
                '0': { v: '034030', n: 1 },
                '1': { v: 'תהליכי יצור', n: 0.707 },
                '2': {
                    v: 'מושגי יסוד בתהליכי ייצור, תכנון פעולות בסיסיות לקראת ייצור תעשייתי, הכרת תהליכי עיבוד שבבי (חריטה, כרסום וכיוצ"ב) עיבוד פלסטי (חישול, שיחול, משיכה עמוקה) והרכבה. כלים ומכונות לתהליכי ייצור אלו. אפיונים תרמיים, מכניים ודינמיים של תהליך/מכונה. יסודות בקרת איכות, ועלויות ייצור. תפקיד התכן והקשר למערכת ולתהליך היצור. הקורס כולל שימוש במכונות כלים במסגרת שיעורי מעבדה (תהליכים עיבוד שבבי). שימוש במכשירי מדידה, והכרת תהליכי תכנון וייצור בעזרת מחשב.',
                    n: 0.123,
                },
            },
        },
        {
            i: 159,
            $: {
                '0': { v: '034032', n: 1 },
                '1': { v: "מערכות ליניאריות מ'", n: 0.577 },
                '2': {
                    v: 'מבוא-אותות ומערכות, אלגברה לינארית - רענון, מידול מערכות. מרחב המצב - מערכות רציפות ובדידות, מימושים קנוניים, ליניאריזציה, פונקציות של מטריצות, פתרון משואות מצב בציר הזמן, אופני תנועה, תגובת הלם, שחזור תנאי התחלה, מערכות דגימה. פתרון משוואות המצב באמצעות התמרות - התמרת לפלס, התמרת Z, התמרת פוריה. אינטגרל וסכום הקונבולציה, מטריצות תמסורת, נורמים של אותות ומערכות, חיבורים של מערכות, יציבות מערכות, תגובת התדר של מערכות ליניאריות,תאורים גרפיים, אנליזה מודאלית של מערכות מכניות תונדות.',
                    n: 0.118,
                },
            },
        },
        {
            i: 160,
            $: {
                '0': { v: '034033', n: 1 },
                '1': { v: "אנליזה נומרית מ'", n: 0.577 },
                '2': {
                    v: "1. מערכות של משוואות אלגבריות לינאריות: א. שיטות ישירות - פירוק LU, שיטת תומס, אי-יציבות הפתרון. ב. שיטות איטרטיביות, שיטת האצה. 2. מערכות של משוואות אלגבריות לא לינאריות. 3. אינטרפולציית לגרנג'. 4. שיטות אינטגרציה: חלוקה אחידה ובלתי אחידה. 5. פתרון משוואות דיפרנציאליות רגילות - בעיית תנאיי התחלה. 6. גזירה נומרית. פתרון משוואות דיפרנציאליות רגילות-בעיית תנאיי שפה.",
                    n: 0.134,
                },
            },
        },
        {
            i: 161,
            $: {
                '0': { v: '034034', n: 1 },
                '1': { v: 'הנע חשמלי', n: 0.707 },
                '2': {
                    v: 'מעגלים מגנטיים. שנאים. התקנים אלקטרומגנטיים. מנועי זרם ישר: עקרון פעולה, מעגל תמורה, התנהגות דינמית, אלקטרוניקת דרייברים. מנועי צעד: עקרון פעולה, התנהגות דינמית, אלקטרוניקת דרייברים. מנועי זרם-ישר ללא מברשות. שקולים בבחירת מנועים קטנים. מנועי זרם חילופין: יצירת שדה מסתובב, מנועים סנכרוניים, מנועי השראה תלת-פאזיים, מעגל תמורה, אפין מכני, עקרונות בבחירת מנוע. בקרת מיקום ומהירות של מנועי זרם ישר וזרם חילופין.',
                    n: 0.13,
                },
            },
        },
        {
            i: 162,
            $: {
                '0': { v: '034035', n: 1 },
                '1': { v: 'תרמודינמיקה 1', n: 0.707 },
                '2': {
                    v: 'מושגי יסוד, מערכת, תכונות, מצב, תהליך, חוק האפס והחוק הראשון. אנרגיה. אנתלפיה. שימושים בחוק הראשון למערכות סגורות ופתוחות. נפח בקרה. חומר טהור: נוזל-אד ומערכות חד-פזיות. גז אידאלי. החוק השני: עקרון קרנו, טמפרטורה תרמודינמית. אנטרופיה. החוק השני לנפח בקרה. מחזורי עבודה: מחזורי אדים וגז. מחזורי קרור. תערובות גזים.',
                    n: 0.146,
                },
            },
        },
        {
            i: 163,
            $: {
                '0': { v: '034039', n: 1 },
                '1': { v: 'מעבדה בשיטות ניסוי', n: 0.577 },
                '2': {
                    v: 'מדידת טמפרטורה, עיבורים, תנודות, מדידת כוח ופיתול, מדי לחץ, מדידת מהירות וספיקה, מדידת תזוזה, גודל, כוח, הספק מכני.',
                    n: 0.236,
                },
            },
        },
        {
            i: 164,
            $: {
                '0': { v: '034040', n: 1 },
                '1': { v: 'מבוא לבקרה', n: 0.707 },
                '2': {
                    v: 'מבוא. פישוט דיאגרמת בלוקים. מידול ומנוע DC. בקרה בחוג פתוח. משוב ובקרה בחוג סגור. יציבות פנימית. ביצועים במצב מתמיד. ביצועים דינאמיים. מג"ש - מיקום גיאומטרי של שורשים. אותות ומערכות בתחום התדר. דרישות בתחום התדר. קריטריון ניקוויסט ליציבות. עודפי יציבות. זמן מת. תכן בקרי קידום-פיגור. מימוש וכיוונון בקרי PID.',
                    n: 0.144,
                },
            },
        },
        {
            i: 165,
            $: {
                '0': { v: '034041', n: 1 },
                '1': { v: 'מעבר חום', n: 0.707 },
                '2': {
                    v: 'חוק פורייה. מוליכות תרמית. הולכת חום במוצקים במצב מתמיד ובלתי מתמיד בגיאומטריות שונות. צלעות. הסעת חום למינרית וטורבולנטית בזרימות חיצוניות ופנימיות. משוואת אנרגיה. פתרונות אנליטיים. שכבות גבול דינמית ותרמית. הסעה חופשית. רתיחה. עיבוי. תהליכי קרינה ותכונית. גוף שחור. מעבר חום בקרינה בין גופים אפורים. מחליפי חום.',
                    n: 0.147,
                },
            },
        },
        {
            i: 166,
            $: {
                '0': { v: '034042', n: 1 },
                '1': { v: 'מבוא לשרטוט הנדסי', n: 0.577 },
                '2': {
                    v: 'עקרונות הגאומטריה התיאורית: שיטות הטלה, ישרים ומישורים, אקסונומטריה, גופים מישורניים, גופים סיבוביים, פרישות, כיפוף פחים. עקרונות שרטוט מכני: גיליונות, ק.מ., מבטים, חתכים, שרטוטי הרכבה, תקנים. מתן מידות וסיבולות: תקנים, אופן מתן מידות, סיבולות מידה, סיבולות גיאומטריות, חישובי סיבולות.',
                    n: 0.162,
                },
            },
        },
        {
            i: 167,
            $: {
                '0': { v: '034043', n: 1 },
                '1': { v: 'שרטוט הנדסי ממוחשב', n: 0.577 },
                '2': {
                    v: 'מושגים בסיסיים בתיב"ם פרמטרי אסוציאטיבי. מבוא לכוונת תכן. עקרונות מידול חלקים תלת-ממדיים בתיב"ם. נושאים בשרטוט חלקים במחשב. עקרונות בסיסיים בשרטוט הרכבות תלת ממדיים במחשב. מתן מידות ואילוצים במחשב.',
                    n: 0.189,
                },
            },
        },
        {
            i: 168,
            $: {
                '0': { v: '034044', n: 1 },
                '1': { v: 'מבוא לשיטות ניסוי', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד: דיוק, הדירות, רגישות, שגיאות מדידה, היסטרזיס. חזרה על מערכת מסדר ראשון ושני ופונקצית תגובה. מדידות סטטיות ודינמיות. דגימה, איסוף ועיבוד נתונים. תכנון מערכת ניסוי. שיטות סטטיסטיות בעיבוד וניתוח תוצאות. שיטות מדידת טמפרטורה, מדי עיבור. מדידת כוח ופיתול, מדי לחץ, מדידת מהירות וספיקה, מדידת תזוזה, גודל, כוח, הספק מכני. כתיבה טכנית.',
                    n: 0.139,
                },
            },
        },
        {
            i: 169,
            $: {
                '0': { v: '034051', n: 1 },
                '1': { v: 'דינמיקה ומכניקה של תנודות', n: 0.5 },
                '2': {
                    v: "משוואות התנועה למתנד, תדר טבעי, אינרציה, קשיחות שקולה, מאזן אנרגיה והספק, מתנד לא ליניארי, מישור הפאזה, יציבות סטטית. תגובה להלם. עירור בסיס ועירור עקב סיבוב אקסצנטרי. שיכוך תנודות. מערכות מרובות דרגות חופש, עבודה ווירטואלית. משוואות לגרנז'. אופני תנודה, ליכסון משוואות התנועה. ,תנודות בייצוג מרוכב, שיטות קירוב. ערור בתדר משתנה, מערכות רציפות, שיטות קירוב. תרגיל מעבדה ופרויקט.",
                    n: 0.134,
                },
            },
        },
        {
            i: 170,
            $: {
                '0': { v: '034052', n: 1 },
                '1': { v: 'פרויקט דגל - רכב מרוץ פורמולה', n: 0.408 },
                '2': {
                    v: 'פיתוח וייצור של מכונית מרוץ פורמולה קטנה, הכולל את כל התהליכים של תכן, בנייה, אינטגרציה, ייצור, הרכבה, שיווק, ניתוח כלכלי, חקר ניסויי והשימוש הסופי. מחקר ניסויי ו/או תיאורטי מבוצע בתחום ספציפי שהסטודנט מבקש להעמיק בו ידע. בהמשך למחקר, הסטודנט מיישם את הפתרון שנבחר ברכב הנבנה.',
                    n: 0.149,
                },
            },
        },
        {
            i: 171,
            $: {
                '0': { v: '034053', n: 1 },
                '1': { v: 'מכניקת מוצקים 2מ', n: 0.577 },
                '2': {
                    v: 'מאמצים, עיבורים, קשרי מאמץ -עיבור (חוק הוק), קריטריוני כניעה וכשל, מבוא לאלסטיות ליניארית (משוואות שיווי משקל, משוואות ההתאמה, פתרונות קלאסיים) , מומנטי אינרציה, מאמצים נורמליים ומאמצי גזירה בכפיפה, דפורמציות אלסטיות בכפיפה, שיטות אנרגיה לחישוב הזזות, קריסת עמודים.',
                    n: 0.164,
                },
            },
        },
        {
            i: 172,
            $: {
                '0': { v: '034055', n: 1 },
                '1': { v: "תורת הזרימה 1מ'", n: 0.577 },
                '2': {
                    v: 'מבוא: רצף, מאמץ, זורם, צמיגות. נפח בקרה ותאור אינטגרלי: משוואות שימור מסה, תנע קווי, תנע זוויתי ואנרגיה האינטגרליות ויישומים. משוואת ברנולי. אנליזה ממדית וחוקי דמויות. קינמטיקה: קווי מסלול, קווי זרם וקווי חלקיק. פונקציית זרם ונגזרת מלווה. תיאור דיפרנציאלי: משוואת הרציפות ומשוואות התנע. הידרוסטטיקה. זורמים ניוטוניים ,משוואות נוויה-סטוקס ותנאי שפה. נרמול של משוואות ,מספרי חסרי ממד ואנליזת סדרי גודל. פתרונות מדויקים. מתח פנים: זווית מגע, משוואת יאנג-לפלס ועלייה קפילרית. משואות סטוקס. משוואות אוילר וזרימה פוטנציאלית. שכבות גבול: משוואות שכבת הגבול דיפרנציאליות ואינטגרליות, פתרונות מוקרבים, כוחות גזירה וגרר. זרימה למינארית וטורבולנטית בצינור: ניסוי ריינולדס, טורבולנציה, דיאגרמת מודי, הפסדים ומשוואת ברנולי הנדסית. התנסות במכניקת זורמים במסגרת פרויקט אישי או קבוצתי.',
                    n: 0.097,
                },
            },
        },
        {
            i: 173,
            $: {
                '0': { v: '034056', n: 1 },
                '1': { v: 'מבוא לחישוב מדעי והנדסי', n: 0.5 },
                '2': {
                    v: '1. הקדמה לחישוב מדעי 2. שיטות פתרון למשוואות לינאריות. A. שיטת גאוס B. פירוק LU C. נורמות של מטריצה, מספר התנאי D. שיטות איטרטיביות 3. פתרון משוואות לא לינאריות 4. מבוא לאופטימיזציה 5. פירוק QR ושימושיו, מציאת ערכים עצמיים, ערכים סינגולריים. 6. אינטרפולציה 7. גזירה ואינטגרציה נומרית 8. פתרון של משוואות דיפרנציאליות רגילות : בעיית תנאי התחלה ותנאי שפה.',
                    n: 0.13,
                },
            },
        },
        {
            i: 174,
            $: {
                '0': { v: '034210', n: 1 },
                '1': { v: 'תכן טורבו-מכונות ומנועי סילון 1', n: 0.447 },
                '2': {
                    v: 'עקרונות הפעולה של טורבו-מכונות (טורבינות, מנועי-סילון, טורבו-מדחסים, טורבו-משאבות). מבנה טורבו-מכונות. עקרונות התכן של טורבו-מכונות. הפסדים ונצילויות. מבנה האופיין. תכן מערכות הכוללות טורבו-מכונות. חוקי הדמיות. תכן ממוחשב של טורבו-מכונות. דוגמה מפורטת של חישוב טורבו-משאבה. (הקורס עוסק רק בהנדסת זרימה של טורבו-מכונות ואינו נוגע בהיבטים של התכן המכני שלהן).',
                    n: 0.146,
                },
            },
        },
        {
            i: 175,
            $: {
                '0': { v: '034339', n: 1 },
                '1': { v: 'פרויקט ברובוטיקה 1', n: 0.577 },
                '2': {
                    v: 'פרוייקטים שונים במערכות בקרה, קינמטיקה, דינמיקה, חיישנים ושימושים של רובוטים.',
                    n: 0.316,
                },
            },
        },
        {
            i: 176,
            $: {
                '0': { v: '034353', n: 1 },
                '1': { v: 'פרויקט תכן מוצר חדש 1', n: 0.447 },
                '2': {
                    v: 'ביצוע פרויקט הנדסי מקיף, החל מהגדרת הצורך ומפרט הדרישות, דרך תכן קונספטואלי ומפורט, ועד לבנית אב טפוס, בחינתו במעבדה ומסירתו ללקוח. בפרויקט יועסק צוות של 2-3 סטודנטים במשך 2 סמסטרים רצופים. הצוות יונחה ע"י מנלה מקצועי ומנוסה. הצוות יעמוד בקשר עם הלקוח, יציג סקרי תיכון ויסכם את עבודתו בדו"ח כולל. יושם דגש על מחזור תכן ובניה שלם תוך שמוש במדעי ההנדסה ובשיטות תכן עדכניות.',
                    n: 0.125,
                },
            },
        },
        {
            i: 177,
            $: {
                '0': { v: '034355', n: 1 },
                '1': { v: 'פרויקט מחקרי בהנדסת מכונות 1', n: 0.447 },
                '2': {
                    v: 'החלק השני של הפרויקט המחקרי בהנדסת מכונות בהנחיית חבר סגל פקולטה בלבד, ויכלול לימוד עצמי של רקע נושא המחקר, ניסוח הבעיה המחקרית, סקר ספרות, בחירת דרך לפתרון הבעיה, בדיקה (ניסויית או תיאורטית) של התוצאות, כתיבת חיבור מסכם.',
                    n: 0.164,
                },
            },
        },
        {
            i: 178,
            $: {
                '0': { v: '034371', n: 1 },
                '1': { v: 'פרויקט תכן לייצור', n: 0.577 },
                '2': {
                    v: 'תכן פרויקט הנדסי, המורכב מאלמנטים הנלמדים ב"תכן 1". הוראה והנחיה מפורטת תינתן בנושאים הבאים: אפיציות, קביעת חומרים, תהליכים ומתקני ייצור והרכבה. הפרוייקט יכלול: מציאת פתרון עקרוני לבעיה, ותכן מפורט המבוטא בשרטוט הרכבה ממוחשב, אנליזה ואופטימיזציה של המבנה. תכן החלקים לייצור יכלול את הוראות הייצור, ההרכבה והבקורת.',
                    n: 0.147,
                },
            },
        },
        {
            i: 179,
            $: {
                '0': { v: '034379', n: 1 },
                '1': { v: 'פרויקט הנדסי 1', n: 0.577 },
                '2': {
                    v: 'פרויקט הנדסי הינו פרויקט גמר בפקולטה להנדסת מכונות בתחומים שונים כדלקמן: אנרגיה, רובוטיקה, תיב"ם, מכניקת חומרים ומיקרומערכות, (ביו-)מכניקה, אדריכלות ימית, מערכות אופטיות, מכטרוניקה, בקרה או שילוב ביניהם. פרויקט הגמר מהווה סינתזה של כל החומר הנלמד בשלושת השנים הראשונות של הלימודים. בנוסף ישנם קדמים רלוונטים לפי קבוצות הפרויקטים השונות אשר יפורסמו מראש במודל.',
                    n: 0.139,
                },
            },
        },
        {
            i: 180,
            $: {
                '0': { v: '034381', n: 1 },
                '1': { v: 'פרויקט מחקרי בהנ. מכונות 2', n: 0.447 },
                '2': {
                    v: 'החלק השני של הפרויקט המחקרי בהנדסת מכונות בהנחיית חבר סגל פקולטה בלבד, ויכלול לימוד עצמי של רקע נושא המחקר, ניסוח הבעיה המחקרית, סקר ספרות, בחירת דרך לפתרון הבעיה, בדיקה (ניסויית או תיאורטית) של התוצאות, כתיבת חיבור מסכם, והצגת התוצאות באירוע הצגת פרויקטים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 181,
            $: {
                '0': { v: '034382', n: 1 },
                '1': { v: 'מתודולוגית פיתוח הנדסי 2', n: 0.5 },
                '2': {
                    v: 'המשתתפים ילמדו מתודולוגיות פיתוח מוצר מכני שתיושם הלכה למעשה בתהליך פיתוח פרויקט. ילמדו בקורס אבני הדרך העיקריות במהלך פרויקט, מהגדרת דרישות וממשקים דרך סקרי תיכון ועד מימוש התכן באמצעות כתיבת סדרת דוחות פיתוח המלווים בניית מודל (או סימולציה) או אבטיפוס.',
                    n: 0.158,
                },
            },
        },
        {
            i: 182,
            $: {
                '0': { v: '034383', n: 1 },
                '1': { v: 'מתודולוגית פיתוח הנדסי 1', n: 0.5 },
                '2': {
                    v: 'המשתתפים ילמדו מתודולוגיות פיתוח מוצר מכני שתיושם הלכה למעשה בתהליך פיתוח פרויקט. ילמדו בקורס אבני הדרך העיקריות במהלך פרויקט, מהגדרת דרישות וממשקים דרך סקרי תיכון ועד מימוש התכן באמצעות כתיבת סדרת דוחות פיתוח המלווים בניית מודל (או סימולציה) או אבטיפוס.',
                    n: 0.158,
                },
            },
        },
        {
            i: 183,
            $: {
                '0': { v: '034401', n: 1 },
                '1': { v: 'מעבדה מתקדמת לרובוטים', n: 0.577 },
                '2': {
                    v: 'ניסויים בקינמטיקה, בקרה ותכנון של רובוטים. סימולציה של רובוטים. ציוד: רובוט תעשייתי PUMA ורובוט לימודי RHINO, מערכת ראיה.',
                    n: 0.236,
                },
            },
        },
        {
            i: 184,
            $: {
                '0': { v: '034404', n: 1 },
                '1': { v: 'מעבדה מתקדמת בתיב"ם', n: 0.577 },
                '2': {
                    v: 'שמוש במודל דימוי גיאומטרי מוצק ( מערכת מסחרית ). הכרת התכנה, מבנה, ושמוש. תיכון מערכת מיכנית בתרגיל סיכום. רובוט.',
                    n: 0.229,
                },
            },
        },
        {
            i: 185,
            $: {
                '0': { v: '034406', n: 1 },
                '1': { v: 'מעבדה מתקדמת לבקרה ואוטומציה', n: 0.5 },
                '2': {
                    v: 'המחשת העקרונות שנלמדו במקצועות תורת הבקרה ואוטומציה תעשייתית.',
                    n: 0.354,
                },
            },
        },
        {
            i: 186,
            $: {
                '0': { v: '034410', n: 1 },
                '1': { v: 'מעבדה מתקדמת לאנרגיה', n: 0.577 },
                '2': {
                    v: 'תכנון פרוייקט בשטח האנרגיה על סמך הגדרת משימה ורשימת ספרות רקע (תדריכים לא ניתנים). ביצוע הפרוייקט - כתלות בהתקדמות התכנון. בסוף הסמסטר, יוגש דו"ח המסכם את התכנון (והביצוע, אם היה) במהלך הסמסטר.',
                    n: 0.177,
                },
            },
        },
        {
            i: 187,
            $: {
                '0': { v: '034411', n: 1 },
                '1': { v: 'מעבדה מתקדמת למנועים והנדסת שריפה', n: 0.447 },
                '2': {
                    v: 'חקר ביצועי מנוע דיזל ומנוע הצתה חשמלית , מאזן תרמי, נצילות נפחית, הפסדים מכאניים ושיטות המדידה, פליטות מזהמים ממנוע דיזל ומנוע הצתה חשמלית, בקרת פליטות מזהמים. עיקרון הפעולה וביצועי מנוע סטירלינג. מבנה וביצועי מדחסי בוכנה. במהלך הסמסטר יבוצע סיור מקצועי.',
                    n: 0.158,
                },
            },
        },
        {
            i: 188,
            $: {
                '0': { v: '034413', n: 1 },
                '1': { v: 'מעבדה לתכן וייצור', n: 0.577 },
                '2': {
                    v: 'תכן של מוצר מכני עם הנעה חשמלית. שימוש בגלים, מיסבים, ממסרות ומנועים וחישוביהם לצורך התאמה לדרישות. העמקה בנושאי מתן טולרנסים, בחירת חומרים, ציפויים וטיפולים תרמיים. הכנת תיק ייצור, לווי הייצור, הכללה ובדיקות של המוצר במעבדה.',
                    n: 0.169,
                },
            },
        },
        {
            i: 189,
            $: {
                '0': { v: '035001', n: 1 },
                '1': { v: 'מבוא לרובוטיקה', n: 0.707 },
                '2': {
                    v: 'טרנספורמציות גוף-קשיח וטרנספורמציות רוטציה. קינמטיקה ישירה והפוכה. יעקוביאן של הקינמטיקה הישירה. שימוש ביעקוביאן לחישוב כוחות סטטיים ברובוט. תכנון מסלול במרחב המפרקים והקרטזי. שיקולים קינמטיים בתכן מכני של רובוטים. עיון ראשוני בדינמיקה של רובוטים. חיישנים לרובוטים.',
                    n: 0.169,
                },
            },
        },
        {
            i: 190,
            $: {
                '0': { v: '035003', n: 1 },
                '1': { v: 'מערכות תיב"מ 1', n: 0.577 },
                '2': {
                    v: 'עקרונות הגרפיקה האינטרקטיבית (ג"א): מבנה מערכת ג"א, ומערכות תיב"ם, שימושים. התקני קלט ופלט של מערכות ג"א. טרנספורמציות פשוטות, מורכבות וטרנספורמציות של היטלים. (איזומטריה פרספקטיבה ). ייצוג הטרנספורמציות באמצעות מטריצות וקואורדינטות הומוגניות. פיתוח הטרנספורמציות באמצעות אלגברה וקטורית והקשר בין שני הייצוגים. ייצור וצבע. מבוא למודלי דימוי גיאומטריים. שיחזור הנדסי. שיטות הדמיה למציאות מדומה. מעבדה: כתיבת תוכניות גרפיות אינטראקטיביות.',
                    n: 0.132,
                },
            },
        },
        {
            i: 191,
            $: {
                '0': { v: '035008', n: 1 },
                '1': { v: 'אוטומציה תעשייתית', n: 0.707 },
                '2': {
                    v: 'פישוט פונקציות בינריות ומימושן. חיישנים חשמליים ופנאומטיים.סוגים שונים של אלמנטים בינריים והשוואתם. תכן מערכות עקיבה בעלות אותות כניסה ע"י משוב. שיטת HUFFMAN. תכן מערכות עקיבה בעלות אותות כניסה אקראיים. תכן מערכות עקיבה בעזרת מערכות קל-שינוי ( PROGRAMMERS ). בקרים מתוכנתים (.P.L.C ).מערכות פנאומטיות: מעגלי קסקדה, שיטת טבלת הזרימה. קודים. אנקודרים. איטרטיביות. רובוטים. שינוע חלקים.',
                    n: 0.136,
                },
            },
        },
        {
            i: 192,
            $: {
                '0': { v: '035010', n: 1 },
                '1': { v: 'קינמטיקה של מכניזמים', n: 0.577 },
                '2': {
                    v: 'הגדרות יסוד במכניזימים. דרגות חופש במכנזימים מורכבים. העברת תנועה ומכניזמים אקויולנטיים. שיטות אנליטיות וגרפיות לחישוב מהירויות ותאוצות במכניזמים. מכניזמים מרחביים. סינתזה קינמטית בעזרת מחשב. קינמיטיקה של גלגלי שיניים. ממסרות גלגלי שיניים. קינמטיקה ודינמיקה של פיקות.',
                    n: 0.169,
                },
            },
        },
        {
            i: 193,
            $: {
                '0': { v: '035013', n: 1 },
                '1': { v: 'שיטות מספריות בהנדסת מכונות 1', n: 0.447 },
                '2': {
                    v: 'סכימות הפרשים סופיים (מפורשות וסתומות) לפתרון משוואות פרבוליות ואליפטיות: קונסיסטיות, יציבות והתכנסות, פתרון בעיות בתחומים מורכבים באמצעות מיפוי אנליטי ונומרי. פתרון משוואות היפרבוליות בשיטת האופיינים ובסכימות הפרשים סופיים (מפורשות וסתומות). יישום לפתרון נומרי של בעיות בתחומי הנדסת מכונות: תורת הזרימה, מעבר חום ומסה, תורת האלסטיות.',
                    n: 0.149,
                },
            },
        },
        {
            i: 194,
            $: {
                '0': { v: '035023', n: 1 },
                '1': { v: 'קרור ונהול תרמי של רכיבים אלקטרו.', n: 0.408 },
                '2': {
                    v: 'רכיבים אלקטרוניים ומעגלים מודפסים (ראמ"מ) - התפתחויות באריזה, כשל תרמי בראמ"מ, תכן אריזה תרמית, מעבר חום מגופים בעלי מקורות חום - חזרה על עקרונות, הולכה בראמ"מ, הסעה חופשית במערכי ראמ"מ, הסעה מאולצת בראמ"מ, אופטימיזצית צלעות ופיני קרור, אופטימיזצית שכבות מודבקות, שיטות מספריות, תכניות מסחריות.',
                    n: 0.151,
                },
            },
        },
        {
            i: 195,
            $: {
                '0': { v: '035024', n: 1 },
                '1': { v: 'טריבולוגיה שימושית', n: 0.707 },
                '2': {
                    v: 'משטחים: חספוס, מאמצים שיוריים, אנרגיית פני שטח. מגע: סוגים, מגע אמיתי, מכאניקת מגע, אדהזיה. חיכוך: חוקים, סוגים ורכיבים דיסיפציית אנרגיה, השפעת גורמים שונים. סיכה: סוגים, תפקידים ומשטרים. בלאי: חמצוני, אברזיבי, אדהזיבי, התעייפות פני שטח, פרטינג, ארוזיה. שיטות: אבחון בעיות, אמצעי ניסוי, הפחתת חיכוך ובלאי כאמצעי חסכון באנרגיה והגדלת אורך חיים של רכיבים מכאניים.',
                    n: 0.137,
                },
            },
        },
        {
            i: 196,
            $: {
                '0': { v: '035026', n: 1 },
                '1': { v: 'מבוא יצירתי להנדסת מכונות', n: 0.5 },
                '2': {
                    v: 'הצגה כללית של התחומים השונים הכלולים בהנדסת מכונות והצגה כללית של מודלים פיסיקלים וכלים מתמטים הרלונטים לתחומים אלו. טכניקות של הצעת רעיונות לפתרון בעיות. כתיבת דו"ח טכני. הכרת מערכת מכנית קיימת על ידי פרוק ןהרכבה וניתוח מנגנונים.',
                    n: 0.164,
                },
            },
        },
        {
            i: 197,
            $: {
                '0': { v: '035034', n: 1 },
                '1': { v: 'כשל חמרים', n: 0.707 },
                '2': {
                    v: 'הגדרת הכשל, כשל בעומס יתר, שבר לינארי אלסטי, נוקשות לשבר, הדגמת הקריטריון לדליפה לפני פצוץ, התעייפות (גבוהה ונמוכת מחזורים), חוק PARIS, מעבר משיך-פריך, השפעות סביבתיות, מיקרו-מבנה ונוקשות לשבר, מנגנוני כשל וניתוח פרקטוגרפי, ניתוח מקרי כשל. מעבדות: קביעת נוקשות לשבר. ניתוח פרקטוגרפי של מנגנוני כשל.',
                    n: 0.151,
                },
            },
        },
        {
            i: 198,
            $: {
                '0': { v: '035035', n: 1 },
                '1': { v: 'תורת הזרימה 2', n: 0.577 },
                '2': {
                    v: 'אנליזת סדרי גודל של משוואות נבייר-סטוקס ומספרים חסרי מימד במכניקת זורמים. תורת הכנף הדקה. סיכה הידרודינמית ומשוואת ריינולדס לזרימה זוחלת. מתח פנים גז-נוזל. יציבות שכבות גבול ותיאור אינטגרלי של שכבות גבול. מאמצי ריינולדס בזרימה טורבולנטית. זרימה טורבולנטית בצינור ושכבת גבול טורבולנטית. זרימה דחיסה חד מימדית. קונוס מך וגלי הלם ניצבים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 199,
            $: {
                '0': { v: '035039', n: 1 },
                '1': { v: 'עבוד אותות לדיאגנוסטיקה ותנודות', n: 0.5 },
                '2': {
                    v: 'סוגי אותות. אנליזה בשדה הזמן. שיטות פוריה, סינון. אנליזה ספקטרלית. זיהוי מערכות לינאריות. עבוד אותות מבוססי מודל. דיאגנוסטיקה של מערכות. אנליזה ספקטרלית של תנודות. זיהוי מקורות, מדידות וסינונים. זיהוי פרמטרים מכניים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 200,
            $: {
                '0': { v: '035041', n: 1 },
                '1': { v: 'מכניקת מיקרומערכות', n: 0.707 },
                '2': {
                    v: 'מבוא למערכות מיקרו-אלקטרו-מכניות ( MEMS ). אלקטרוסטטיקה: משואות שדה. חומרים דיאלקטרים. אנרגיה אלקטרוסטטית. סטטיקה של מיקרומערכות: קורות ופלטות אלקטרו-מכניות. מאמצים שיוריים. חומרים פיזואלקטריים. תורת האלסטיות התרמואלקטרית: ניסוח בעיות. פתרונות מדויקים ונומרים. תופעות תרמיות במיקרומערכות: התפשטות תרמית. אי-התאמה תרמית במבנים שכבתיים. פתרון בעיות אלקטרו-תרמומכניות. דינמיקה ורטט של מערכות אלקטרומכניות: עמיסה חשמלית. מנגנוני ומדדי ריסון במיקרומערכות. אי-לינאריות, יציבות ולינאריזציה.',
                    n: 0.132,
                },
            },
        },
        {
            i: 201,
            $: {
                '0': { v: '035043', n: 1 },
                '1': { v: 'מבוא לתורת האלסטיות', n: 0.577 },
                '2': {
                    v: 'וקטור הזזה. טנזור גרדיאנט ההזזה. טרנספורמציה של טנזורים. טנזורי עיבורים ומאמצים. משואות שיווי משקל דיפרנציאליות. הטרחות ותנאי שפה. אנרגיית עיבורים ועבודת כוחות חיצוניים. משוואות קונסטיטוטיביות. משוואות ההתאמה. פתרונות אנליטיים ונומריים של בעיות נבחרות בתורת האלסטיות.',
                    n: 0.169,
                },
            },
        },
        {
            i: 202,
            $: {
                '0': { v: '035044', n: 1 },
                '1': { v: 'הידרוסטטיקה של אוניות', n: 0.577 },
                '2': {
                    v: 'שרטוט קווי האוניה. מידות ראשיות. מקדמי צורה. משפט ארכימדס. התנאים לשיווי משקל יציב. יציבות תחילית. משפט EULER על ציר הטיה בזוויות קטנות. נוסחת רדיוס מטצנטרי. מטצנטרים. שיטות לאינטגרציה נומרית בהנדסת אניות. עקומות הידרוסטטיות. דיאגרמות ליציבות סטטית ודינמית. השפעת נוזלים ומטענים חופשיים. קריטריונים ליציבות: קריטריון חיל-הים האמריקאי. תופעות התהודה הפרמטרית ( תופעת MATHIEU ). קריטריון חיל-הים הגרמני. קריטריון משרד התחבורה. הצפה ומצב ניזוק. כפיפה אורכית.',
                    n: 0.125,
                },
            },
        },
        {
            i: 203,
            $: {
                '0': { v: '035048', n: 1 },
                '1': { v: 'תכן משולב באנליזה', n: 0.577 },
                '2': {
                    v: "עקרונות התכן המכני בשילוב אנליזות מתחומי הדינמיקה, החוזק, הקינמיטיקה והרטט. הדגש על הצד הפיזיקלי של התכן המכני. יכללו נושאי תכן של: חלקי מכונות, מכניזמים, וסתים צנטריפוגליים, מע' ריסון למכונות, העמסות באימפקט והלמים.",
                    n: 0.177,
                },
            },
        },
        {
            i: 204,
            $: {
                '0': { v: '035049', n: 1 },
                '1': { v: 'עקרונות מערכות הנעת כלי שייט', n: 0.447 },
                '2': {
                    v: 'עקרונות מערכות הנעת כלי שייט: בקיטור, טורבינות גז ומנועי דיזל, כולל מחזורי עבודה ומאפייני פעולה. התאמה בין מנוע למדחף ומערכות העברת כוח כולל מערכות הנעה משולבות. בחירת מערכות הנעה. עקרונות הנעה חשמלית/היברידיות ומאפייני פעולה. עקרונות תחזוקת מערכות מכאניות. עקרונות מערכות זורמים ומשאבות.',
                    n: 0.154,
                },
            },
        },
        {
            i: 205,
            $: {
                '0': { v: '035050', n: 1 },
                '1': { v: 'תכנון מערכות אופטיות', n: 0.577 },
                '2': {
                    v: 'מבוא לתכנון אופטי, אופטיקה גיאומטרית, שיטות נומריות לתיאור התקדמות קרניים פראקסיאליות, תכונות עדשה יחידה, דימות, אברציות מונוכרומטיות, אברציות כרומטיות, תכונות מערכת אופטית, חומרים אופטיים, מקורות אור, גלאים, שיטות מדידה לאפיון מערכות אופטיות, דוגמאות למערכות אופטיות בסיסיות.',
                    n: 0.167,
                },
            },
        },
        {
            i: 206,
            $: {
                '0': { v: '035053', n: 1 },
                '1': { v: 'אנרגיה מתחדשת ובת קיימא', n: 0.5 },
                '2': {
                    v: 'מקורות אנרגיה מתחדשים, זמינותם וניצולם. ניצול חום ישיר והמרת אנרגיה לחשמל, הפיכת אנרגית רוח לאנרגיה מכנית וחשמלית והמרת חום ע"י מעגלים תרמודינמיים לאנרגיה מכנית וחשמלית. ניצול חום במחזורים תרמודינמיים. אגירת אנרגיה לאור אי ההתאמה בין זמינות מקורות האנרגיה ורשת החשמל. מקורות אנרגיה בישראל, טכנולוגיות מתאימות, מדיניות ותעריפים.',
                    n: 0.146,
                },
            },
        },
        {
            i: 207,
            $: {
                '0': { v: '035146', n: 1 },
                '1': { v: 'מנועי שריפה פנימית', n: 0.577 },
                '2': {
                    v: 'מחזורים תרמודינמיים אידיאליים ומעשיים. נצילויות. קריטריונים לתיכון זרימת אויר. טעינת יתר. אספקת דלק. הצתה. שריפה וזימון. מעבר חום בחלקי המנוע. סיכה וקרור המנוע. מערכות שימון. מערכות קרור. מערכות בקרה. מנועים בעלי תנועה סובבת ( וונקל ).',
                    n: 0.167,
                },
            },
        },
        {
            i: 208,
            $: {
                '0': { v: '035147', n: 1 },
                '1': { v: 'סמינר מיוחד בהנדסת מכונות 1', n: 0.447 },
                '2': {
                    v: 'מטרת המקצוע לחנך את הסטודנט בלימוד עצמי של נושא, תמצותו, ניתוח ודווח עליו בכתב. באישור מרכז לימודי הסמכה.',
                    n: 0.236,
                },
            },
        },
        {
            i: 209,
            $: {
                '0': { v: '035188', n: 1 },
                '1': { v: 'תורת הבקרה', n: 0.707 },
                '2': {
                    v: 'מערכות - תכונות מערכות רציפות (ר) ובדידות (ב): מודלים מתמטיים של מערכות ותהליכים, הצגת מערכות על ידי מטריצות פולינומיאליות, ניתנות לבקרה / השגה וניתנות לשיחזור (ר/ב), מימושים מינימליים, יציבות, קריטריונים ליציבות (ר/ב).\nמשוב - מערכות SISO : דיאגרמות משבצות, זרימת סיגנלים, יציבות וסיבתיות החוג הסגור, תגובת תדר של החוג הסגור, מעלי M ו- N, דיאגרמת ניקולס, רגישות, רובסטיות של יציבות. תכן בקרים: דרישות ושיקולי תכן, בקרי תקון, שיטות ואלגוריתמי תכן. בקרים תעשיתיים: PID, מז"ם, בקרת קסקדה, בקרת היזון קדימה, בקרת מערכות לא-מינימום פאזה, בקרת מודל פנימי. משוב - מערכות MIMO (מרחב המצב): משוב מצב, משערכים מסדר מלא, משוב מצב + משערך, תכן משערכים במשור התדר, בקר ממקם קטבים, בקר ליניארי אופטימלי.\nיציבות מערכות לא ליניאריות (ל"ל): מאפייני מערכות ל"ל, אלמנטים ל"ל, הצגת מערכות ל"ל, הפונקציה מתארת, קריטריון פופוב, קריטריון המעגל, שיטות ליאפונוב.',
                    n: 0.088,
                },
            },
        },
        {
            i: 210,
            $: {
                '0': { v: '036001', n: 1 },
                '1': { v: 'שיטות אנליטיות בהנדסת מכונות 1', n: 0.447 },
                '2': {
                    v: 'פונקציות אנליטיות של משתנה מרוכב. התמרות קונפורמיות ופתרון של משוואת לפלס. משפט שאריות, עקרון ארגומנט. משפט רושה, חישוב של אינטגרלים מסוימים. פתרון של מד"ח בשיטת הפרדת משתנים, בעיית שטורם-ליוביל. פתרון של מד"ר בשיטת טורים. פולינומי לז\'נדר. פונקציות בסל. תוצאות למידה: בתום הקורס הסטודנט ידע: 1. לחקור תכונות עיקריות של פונקציות אנליטיות ולפתחן לטורי חזקות. 2. לפתור משוואת לפלס בדו-מימד בעזרת פונקציות אנליטיות והעתקות קונפורמיות. 3. לחשב אינטגרלים מסוימים בעזרת שאריות של פונקציות אנליטיות. 4. לנתח מד"ר ליניאריות. 4. להשתמש בפונקציות בסל ופולינומי לז\'נדר לפתרונות של בעיות פיזיקליות.',
                    n: 0.107,
                },
            },
        },
        {
            i: 211,
            $: {
                '0': { v: '036002', n: 1 },
                '1': { v: 'שיטות אנליטיות בהנדסת מכונות 2', n: 0.447 },
                '2': {
                    v: "פונקציות מיוחדות ופתרון של משוואת מעבר חום ומשוואת גלים. התמרות אינטגרליות, התמרת לפלס, התמרת פוריה. שיטות ווריאציוניות, כופלי לגרנג'. בעיות עם תנאי שפה משתנים ותנאי שפה טבעיים. שיטת ריילי - ריץ. תוצאות למידה: בתום הקורס הסטודנט ידע: 1. לנסח ולפתור בעיות ווריאציוניות פשוטות. 2. לפתח טורי פוריה מוכללים עבור משוואות גלים וחום 3. לפתור משוואות חום, גלים ולפלס בעזרת התמרות אינטגרליות.",
                    n: 0.128,
                },
            },
        },
        {
            i: 212,
            $: {
                '0': { v: '036003', n: 1 },
                '1': { v: 'מבוא למכניקת הרצף', n: 0.577 },
                '2': {
                    v: 'קינמטיקה של הרצף. מושג המאמץ. שימור מסה. חוקי מאזן לתנע קווי, לתנע זוויתי ולאנרגיה. אינווריאנטיות בהוספת תנועת גוף קשיח. משוואות קונסטיטוטיביות של מוצקים אלסטיים, נוזלים צמיגים, מוצקים אלסטו-פלסטיים, לינאריזציה.',
                    n: 0.186,
                },
            },
        },
        {
            i: 213,
            $: {
                '0': { v: '036005', n: 1 },
                '1': { v: 'דינמיקה אנליטית 1', n: 0.577 },
                '2': {
                    v: "עקרונות יסודיים, עבודה וירטואלית, עקרון ד'אלמבר, משוואות לגרנז'. חוקי שימור, שיטת ראוט, עקרון המילטון, מערכות בלתי משמרות ובלתי הולונומיות, תנועה במערכות מואצות, דינמיקה של גוף קשיח, משוואות לגרנז' עבור קוואזי-קואורדינטות ויישומים.",
                    n: 0.18,
                },
            },
        },
        {
            i: 214,
            $: {
                '0': { v: '036015', n: 1 },
                '1': { v: 'שיטות אלמנטים סופיים בהנדסה 1', n: 0.447 },
                '2': {
                    v: 'ניסוחים וריאציוניים, שיטות שקלול, עקרונות וריאציוניים ופתרונות מקורבים לבעיות תנאי שפה. אלמנטים חד מימדיים(C1-C0)שיטות לפתרון משוואות אלגבריות. אלמנטים איזופרמטריים רב מימדיים. מבנה אופיני של תוכניות מחשב ועיבוד ממוחשב של נתונים ותוצאות. הערכות שגיאה. שיטות אלמנטים גבוליים, רצועות סופיות ואלמנטים ספקטרליים.',
                    n: 0.158,
                },
            },
        },
        {
            i: 215,
            $: {
                '0': { v: '036020', n: 1 },
                '1': { v: 'גאומטריה חישובית ומודלים לתיב"ם 1', n: 0.447 },
                '2': {
                    v: 'משוואת מפורשות סתומות ופרמטריות של קווים, עקומות ומשטחים. משוואות חבויות. מעטפת לעקומות ועקומות היסט ( OFFSET ). ניתוח, יצוג ותכנון (שיטת LIMING ) של חתכים קוניים. אינטרפולציה ותכנון באמצעות חתכים. יסודות גיאומטריה דיפרנציאליות, משוואות FRENET-SERRET. המטריצות היסודיות: הראשונה והשניה. תכנון של עקומות ( 3-D ) פרמטריות מרוכבות ומשטחים. (ייצוגי: BEZIER, FERGUSON, SPLINES וטלאי COON ). חתכים קוניים כמשוואות פרמטריות ראציונליות.',
                    n: 0.129,
                },
            },
        },
        {
            i: 216,
            $: {
                '0': { v: '036045', n: 1 },
                '1': { v: 'גיאומטריה חישובית ומודלים בתיבם 2', n: 0.447 },
                '2': {
                    v: 'תיכנון לייצור של עקומות ומשטחים המבוססים על ייצוג פולינומיאלי ופרמטרי: B- SPLINES, NURBS. שיטות אינטרפולציה לעקומות ומשטחים. התאמת משטחים מרוכבים. שיטות להעלאת והורדת דרגה של משטח. בניית משטחים ע"י פעולות משיכה ועירבול. אלגוריתמי חיתוך בין משטחים פרמטריים. משטחים מהוקצעים. פעולות בוליאניות על משטחים פרמטריים.',
                    n: 0.151,
                },
            },
        },
        {
            i: 217,
            $: {
                '0': { v: '036055', n: 1 },
                '1': { v: 'אופטיקה לינארית ויישומים  2', n: 0.5 },
                '2': {
                    v: 'מיקרו-אופטיקה, אופטיקה בינארית, טרנספורמציות אופטיות גאומטריות, עיצוב חזיתות גלים, קישורים אופטיים, אלמנטים אופטיים המבוססים על מבנים תת-אורכי-גל, אלמנטים מקטבים תת-אורכי-גל לא תלויים במרחב ותלויים במרחב, זכרונות אופטיים ומערכות רישום, מהודי לייזר עם אלמנטים אופטיים לא-קונבנציונליים, סינון מודים, הדמאה תרמית, מדעי הצבע.',
                    n: 0.156,
                },
            },
        },
        {
            i: 218,
            $: {
                '0': { v: '036058', n: 1 },
                '1': { v: 'מיקרומכניקה של מוצקים 1', n: 0.5 },
                '2': {
                    v: 'יחסי מיקרו-מאקרו, הסתברות, מורפולוגיה, תכונות אפקטיביות. מיקרוקורות הטרוגניות, שקיעות ופיזור סטטיסטי, סקלת אורך מיקרונית, קורלציה דו נקודתית, חסמים. וריאציות, אי לינאריות, קרובים, ריאקציות הסתברותיות. תת מבנה בחתך: חומרים מרוכבים, אפקטים לא-איזוטרופיים, תכונות וסקלות, השפעת המורפולוגיה על שקיעות וריאקציות. מיקרומכניקה וחוזק.',
                    n: 0.158,
                },
            },
        },
        {
            i: 219,
            $: {
                '0': { v: '036067', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת מכונות 6', n: 0.447 },
                '2': {
                    v: 'נושאי מחקר מתקדמים במדעי ההנדסה מתחום מחקרו ומומחיותו של המרצה. הסילבוס יקבע ע"י המרצה באישור הועדה ללימודי מוסמכים לפני תחילת הסמסטר בו ניתן המקצוע.',
                    n: 0.204,
                },
            },
        },
        {
            i: 220,
            $: {
                '0': { v: '036070', n: 1 },
                '1': { v: "ננואופטיקה ומבני' אופט' מחזוריים", n: 0.5 },
                '2': {
                    v: "אופטיקה שדה קרוב, מגבלת הרזולוציה וגלים דועכים, מבנים תת-אורך גל, מטה-חומרים אופטיים מבוססים על ננומבנים, גלי שטח, פלזמונים, פונון-פולריטון, מבנים מחזוריים ומבנים תלויים במרחב, פליטה תרמית בשדה הקרוב, אופטיקה וקטורית (פרמטרי סטוק, מטריצות מולר וגו'נס, כדור פואנקרה), מבנים ננומטריים תלויי קיטוב, אופטיקה של שכבות מתכת דקות, פאזות גאומטריות במבנים ננומטריים, שימושים לננופוטוניקה.",
                    n: 0.139,
                },
            },
        },
        {
            i: 221,
            $: {
                '0': { v: '036073', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת מכונות 8', n: 0.447 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המרצה באישור הועדה לתארים מתקדמים לפני תחילת הסמסטר בו ינתן המקצוע.\nאביב תשע"ו: בקרת תנועה ביולוגית חורף תשע"ח: תרמו מכניקה של חומרים סמסטר א\' תש"פ: דינמיקה וניסוי בגלים ותנודות.',
                    n: 0.177,
                },
            },
        },
        {
            i: 222,
            $: {
                '0': { v: '036081', n: 1 },
                '1': { v: 'עקרונות תכן ויצור מיקרו-מערכות', n: 0.5 },
                '2': {
                    v: 'מיקרו מערכות: הגדרות, מטרות וחשיבות. המזעור והשלכותיו על ההתנהגות המכנית של התקנים. מבנים מיקרו מכניים ושיטות ייצורם. סקירת תהליכי מיקרו עיבוד והשפעתם על התכן. מבוא לתכן מיקרו מכני. מערכות חישה ועירור משולבות אופטיקה, אלקטרוניקה וחומרים מגיבים. התאמת התכן בעזרת מחשב לתכן תהליכי מיקרו עיבוד. מידול מערכות מיקרו-מכניות ועקרונות זיווד.',
                    n: 0.143,
                },
            },
        },
        {
            i: 223,
            $: {
                '0': { v: '036086', n: 1 },
                '1': { v: 'זרימה ותופעות מעבר בהתקנים מיקרונ', n: 0.447 },
                '2': {
                    v: 'זרימה, מעבר מסה ותופעות פיסיקליות-כימיות במיקרוזרימה ושימושם בהתקני מעבדה-על-שבב. תנועה בראונית, הסעה סקאלרית, דיפוזיית טיילור אריס, מערכות הסעה-דיפוזיה-ריאקציה, תמיסות טעונות ומערכות בופרים, שיטות ריכוז והפרדה על גבי שבב, זרימה קפילרית וזרימה בתווך פורוזיבי.\nתוצאות למידה: בסיום הקורס הסטודנט ידע: 1. לנסח משוואות זרימה עם כוחות חשמליים. 2. לבצע אנליזת סדרי גודל למשוואות זרימה. 3. לבצע אנליזת טיילור-אריס לזרימות דיספרסיביות. 4. ליישם סימולציות מונטה קרלו לחלקיקים בזרימות דיספרסיביות. 5. לתכנן תנאים אופטימליים לריאקציות על גבי משטחים במיקרו תעלות. 6. לנסח ולפתור משוואות לתמיסות טעונות. 7. לפתח את תנאי הנייטרליות וליישמו לבעיות אלקטרוקינטיות. 8. לתכנן ולנתח מערכות אלקטרופורזה ואיזוטכופורזה.',
                    n: 0.102,
                },
            },
        },
        {
            i: 224,
            $: {
                '0': { v: '036090', n: 1 },
                '1': { v: 'חישה מכנית ע"י תאים ביולוגיים', n: 0.447 },
                '2': {
                    v: 'מבוא לביומכניקה של תאים ביולוגיים בדגש על הבסיס הפיסיקלי של חישה מכנית ע"י תאים: היכולת של תאים לחוש ולהגיב לגירויים מכניים ולתכונות מכניות של הסביבה. כלי מדידה ניסיוניים ומידול תיאורטי (המבוסס על מכניקה סטטיסטית ותהליכים סטוכסטיים) של מכניקה ברמה הננומטרית. מעברי פזה בממברנות ביולוגיות ובשלד התאי המושרים על ידי כוחות, צימוד מכני-כימי המאפשר שינוי קונפורמציה במולקולות בודדות ושבירת קשרים על ידי הפעלת כוחות, שיטות ניסוי למדידת כוחות ודפורמציות ברמה הננומטרית כולל: סקפטרוסקופית כוח של מולקולות בודדות, מיקרוסקופית כוח ( TFM ) וחיישנים מבוססי מעבר אנרגיה על ידי תהודה פלורסנטית. ( FRET ) תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין את ההבדל בין התנהגות מכנית של מערכות מכניות קלאסיות ומערכות של ארגון עצמי כמו ממברנות ביולוגיות והשלד התאי. 2. להבין את החשיבות של כוחות סטוכסטיים ברמת המולקולה הבודדת (עבור חיישנים מכניים של תאים ומנועים מולקולריים). 3. לגזור תכונות מאקרוסקופיות מהתנהגות של מולקולה בודדת. 4. לעקוב אחרי מודלים בסיסיים במכניקה סטטיסטית בתחום. 5. לקרוא באופן ביקורתי את הספרות המחקרית.',
                    n: 0.079,
                },
            },
        },
        {
            i: 225,
            $: {
                '0': { v: '036098', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת מכונות 01', n: 0.447 },
                '2': {
                    v: 'נושאי מחקר מתקדמים מתחום מחקרו ומומחיותו של המרצה. סילבוס מפורט ותוצרי למידה יפורסמו לפני תחילת כל סמסטר בו יינתן הקורס.',
                    n: 0.224,
                },
            },
        },
        {
            i: 226,
            $: {
                '0': { v: '036100', n: 1 },
                '1': { v: 'הגישה הגיאומטרית לתנועת רובוטים', n: 0.5 },
                '2': {
                    v: 'בקורס יידונו מספר מאמרים הנוגעים לתנועת רובוטים. מאמרים אלו משלבים רעיונות ממכניקה, גיאומטריה דיפרנציאלית, בקרה לא ליניארית ומכניקה גיאומטרית. זה ישמש כהקדמה למתמטיקה של מה זה אומר לנוע בעולם, וכמה מהכלים המתמטיים הדרושים לביטוי ולתכנון תנועה. הדיון יתמקד בעיקר במכניקה גיאומטרית והפוטנציאל שלה לאחד אופני תנועה שונים. מבוא: רקע מתמטי קצר: קבוצות ומנות, LIE GROUPS SE(2) AND SE(3), MANIFOLDS AND DIFFEOMORPHISMS, מבוא למכניקה גיאומטרית: סימטריה, שימור והפחתת סימטריה. קריאות עיקריות: המכניקה הגיאומטרית של שחייה והחלקה, מודלים של תנועת רגליים, נושאים מתקדמים נוספים מהספרות בעקבות תחומי העניין של המשתתפים. תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להסביר את הקונספט הגאומטרי בתיאור תנועה, עבור מערכות בעלות וללא סימטריה.\n2. לנתח את החסרונות והיתרונות של שימוש בקונספט זה בתיאור תנועת רובוטים ובקרתם.\n3. לפתור בעיות על ידי שימוש ברקע המתמטי שנלמד בקורס: קבוצות ומנות, LIE GROUPS SE(2) AND SE(3), MANIFOLDS AND DIFFEOMORPHISMS_\n4. לבנות מודלים גאומטריים עבור תנועת רובוטים ובקרתם.\n5. לנתח מאמרים בצורה ביקורתית ולהציג את עיקרם ומגבלותיהם.',
                    n: 0.081,
                },
            },
        },
        {
            i: 227,
            $: {
                '0': { v: '038715', n: 1 },
                '1': { v: 'תרמודינמיקה מתקדמת 1', n: 0.577 },
                '2': {
                    v: 'פיתוח אכסיומטי מדויק של התרמודינמיקה הקלסית תוך הדגשת המבנה ההגיוני של המקצוע. חוקי התרמודינמיקה: חוק ראשון, חוק שני, חוק האפס ועקרון המצב. עבודה וחום, אנרגיה, טמפרטורה, אנטרופיה וזמינות. יחסי מכסוול, משוואות מצב. שימושים למערכות סגורות ופתוחות, חד-רכיביות ורב-רכיביות. קריטריונים לשווי-משקל ויציבות. שווי-משקל של מערכות הטרוגניות. תערובות ותמיסות. ריאקציות כימיות ושווי-משקל כימי.',
                    n: 0.14,
                },
            },
        },
        {
            i: 228,
            $: {
                '0': { v: '038717', n: 1 },
                '1': { v: 'מעבר חום - הסעה', n: 0.5 },
                '2': {
                    v: 'משוואת האנרגיה. שכבות גבול למינריות. בעית בלסיוס-פולהאוזן. שכבות גבול דחיסות. מעבר חום בסילונים. מעבר חום באיזור של נקודת סטגנציה. מודלים של טורבולנציה אמפיריים למחצה. מודל K-EPSILON. שכבת עירוב. הסעה טבעית לאורך לוח ובסילונים. אידוי - נוסחת קנודסן. רתיחה - בועות ופילמים. עיבוי על לוח.',
                    n: 0.151,
                },
            },
        },
        {
            i: 229,
            $: {
                '0': { v: '038746', n: 1 },
                '1': { v: 'תכונות מכניות של חומרים הנדסיים', n: 0.447 },
                '2': {
                    v: 'בסיס פיסיקלי וניסוח אנליטי לתכונות מכניות של מתכות וחומרים פלסטיים. תכונות: אלסטיות, פלסטיות, כולל השפעת קצב העבור. ויסקואלסטיות. זחילה. התעייפות. שבר פריך ומשיך. ריסון פנימי. טיפול במשוואות המתארות תכונות מכניות על בסיס תכונות פיסיקליות מיקרוסקופיות של החומר. שיטות ניסיוניות למדידת וניתוח תכונות.',
                    n: 0.154,
                },
            },
        },
        {
            i: 230,
            $: {
                '0': { v: '038789', n: 1 },
                '1': { v: 'סמינריון/פרויקט מתקדם בהנ. מכונות', n: 0.5 },
                '2': {
                    v: 'עבודה סמינריונית או פרויקט בהיקף של 5 נקודות בעלת אופי עיוני, אנליטי, או ניסויי, הקשורה בכוון ההתמחות שנבחר בלימודי .M.E. התוצאות יוצגו בדו"ח שהיקפו לא יעלה על 30 עמודים ובסיום העבודה יבחן הסטודנט ע"י מנחהו. על כל סטודנט שירשם למקצוע למצוא מנחה ולקבוע בתאום עימו נושא לעבודה. הנושא יאושר ע"י מרכז הועדה ללימודי מוסמכים על טופס הצעת נושא לפרויקט/סמינריון בתוכנית .M.E.',
                    n: 0.128,
                },
            },
        },
        {
            i: 231,
            $: {
                '0': { v: '038797', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת מכונות 2', n: 0.447 },
                '2': {
                    v: 'קורס מתקדם במדעי ההנדסה העוסק בנושאי המחקר מתחום מחקרו ומומחיותו של המרצה. סמסטר א\' תשע"ח: מכניקת זורמים מתקדמת סמסטר ב\' תשע"ט: גלים לא ליניאריים.',
                    n: 0.204,
                },
            },
        },
        {
            i: 232,
            $: {
                '0': { v: '038807', n: 1 },
                '1': { v: 'טורבולנציה, תאוריה ומעשה', n: 0.577 },
                '2': {
                    v: 'התחלה של טורבולנציה, תאור סטטיסטי, משוואת REYNOLDS AVERAGED NAVIER- STOKES ( RANS ), בעיית סגירה, היפותזת צמיגות טורבולנטית, אשדת אנרגיה, ההיפוטזות של KOLMOGOROV, ספקטרום, זרימה ליד קיר וגזירה חופשית, חוק הקיר, מבנים קוהרנטים, מודלים לסגירה, LES ומודלים SUBGRID-SCALE, שימוש בפונקציות קיר, טכניקות מדידה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין את האופי של זרימות טורבולנטיות 2. להשתמש בכלים סטטיסטים באנליזה של זרימה טורבולנטית. 3. להבין את המשוואות השולטות ובעית סגירה. 4. להמשיך מחקר עצמאי בזרימה טורבולנטית. 5. להשתמש במידול נומרי ואו ניסויים לחקר טורבולנציה.',
                    n: 0.108,
                },
            },
        },
        {
            i: 233,
            $: {
                '0': { v: '038808', n: 1 },
                '1': { v: 'תכן מערכתי הנדסי מתקדם 1', n: 0.447 },
                '2': {
                    v: 'קורס תכן מערכתי הנדסי מתקדם 1 הינו סדרה של מתודולוגיות התומכות בשלבי התכן הבאים: זיהוי דרישות והגדרתן, ניתוח של צורכי לקוחות ובעלי עניין, תרגום צורכי הלקוחות להגדרת מפרט דרישות, מדידת איכות התכן. התכן הקונספטואלי: הפשטה וניתוח פונקציונאלי, יצירתיות פונקציונאלית ויצירת עקרונות פתרון, מיזוג חלופות קונספטואליות, קביעת אמות מידה להערכה, הערכה ובחירה של חלופות התכן. התכן הראשוני: ארכיטקטורה, תכן על, הגדרת ממשקים, מידול, SIZING, שילוב היבטי תכן ל-X, שימוש ותפעול, ייצור והרכבה, ניסויים ובחינה ותמיכה בתכן העל, הצגת פרויקטי תכן והגשתם.\nתוצאות למידה: בסיום הקורס הסטודנטים יהיו מסוגלים: 1. להגדיר מפרט ביצועים למערכת חדשה 2. ליצור ולמזג מגוון חלופות קונספטואליות מערכתיות 3. להעריך ולבחור בין חלופות תכן 4. לבצע תכן ראשוני של מערכות',
                    n: 0.095,
                },
            },
        },
        {
            i: 234,
            $: {
                '0': { v: '038809', n: 1 },
                '1': { v: 'תכן מערכתי הנדסי מתקדם 2', n: 0.447 },
                '2': {
                    v: 'קורס תכן מערכתי הנדסי מתקדם 2 הינו סדרה של מתודולוגיות, הממשיכות את אלו שנלמדו בקורס תכן מערכתי הנדסי מתקדם 1 והתומכות בשלבי התכן הראשוני הבאים: זיהוי אופני כשל ומניעתם, תכן חסין(רובוסטי), תכנון ניסויים, תכן קונספטואלי לעלות, ניתוח סיכונים וזמן לשוק, בחירה סופית של חלופות תכן, הצגת פרויקטי תכן והגשתם.\nתוצאות למידה: בסיום הקורס הסטודנטים יהיו מסוגלים: 1. לזהות, לנתח ולמנוע אופני כשל קונספטואליים 2. לבצע תכן חסין ולתכנן ניסויים 3. להעריך עלויות של קונספטים ולתכן לעלות 4. לנתח סיכונים וזמן לשוק של חלופות תכן מערכתי',
                    n: 0.109,
                },
            },
        },
        {
            i: 235,
            $: {
                '0': { v: '038811', n: 1 },
                '1': { v: 'גלים לא לינאריים במערכות מכניות ד', n: 0.408 },
                '2': {
                    v: 'מבוא לשיטות אסימפטוטיות, גלים היפרבוליים, גלי הלם, משוואות KDV ,BURGER S דינמיקה של סריגים לינאריים (MONO-ATOMIC CHAINS, POLY-ATOMIC CHAINS ), חקירה של גלים סוליטאריים במערכות בדידות עם אי-לינאריות חלשה, משוואת KDV, פתרונות סוליטוניים של משוואת KDV, השפעת האי-לינאריות על היציבות של גלים ( MODULATION INSTABILITY ), משוואת שרדינגר לא לינארית ( NLS ) ותכונותיה, תנאים ללוקליזציה, חקירת פתרונות גליים מיוחדים מסוג ( DARK AND BRIGHT BREATHERS ). חקירה של מעבר גלים סוליטאריים בשרשראות עם אי-לינאריות אלימה במצב של ואקום קולי ( ACOUSTIC VACUUM ). בקורס זה יינתן דגש על חקירת תופעות לוקליזציה ויציבות של גלים במערכות מכניות אמיתיות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לזהות ולתאר תופעות גליות לא לינאריות במערכות מכניות בדידות המניחות אי-לינאריות חלשה 2. לבצע חקירת היציבות של הפתרונות הגליים במערכות מכניות בדידות 3. לנתח באופן נומרי ואנליטי מקורב את תופעות הגליות הלא לינאריות בסריגים חד-מימדים עם אי-לינאריות אלימה',
                    n: 0.083,
                },
            },
        },
        {
            i: 236,
            $: {
                '0': { v: '038812', n: 1 },
                '1': { v: 'סמינר בהנדסת מכונות', n: 0.577 },
                '2': {
                    v: 'השתתפות בסמינרים שבועיים בהם ניתנות הרצאות של חוקרים בתחומים השונים של הנדסת מכונות.\nתוצאות למידה: בסיום הקורס הסטודנטים: 1. ירחיבו את אופקיהם בזכות החשיפה לנושאים רבים ומגוונים בהנדסת מכונות המוצגים ע"י אנשי תעשייה ואקדמיה בארץ ובעולם. 2. יכירו את נושאי המחקר העכשוויים בדיסציפלינות השונות של הנדסת מכונות. 3. ידעו מהן הבעיות הפתוחות שעומדות כיום בפני חוקרים ומהנדסים בהנדסת מכונות. 4. יכירו בחשיבות של הצגה נכונה של תוצאות מחקר, ויקבלו מושג על האופן שבו יש לתת הרצאה אפקטיבית. 5. ירכשו רעיונות חדשים שיעזרו להם במחקר לקראת תואר גבוה. 6. ידעו כיצד להפיק תועלת ועניין מהרצאה גם בנושאים שאינם קרובים לתחומי מחקרם.',
                    n: 0.101,
                },
            },
        },
        {
            i: 237,
            $: {
                '0': { v: '044000', n: 1 },
                '1': { v: 'פרויקט מחקרי למצטיינים 1', n: 0.5 },
                '2': {
                    v: 'מיועד לסטודנטים בתכנית למצטיינים בדגש מחקרי. התמודדות עם בעייה מחקרית על ידי הסטודנט בהנחייה של חבר סגל אשר הביע נכונות להנחות אותו בנושא. הפרויקט יכלול לימוד עצמי של רקע נושא המחקר, ניסוח הבעייה המחקרית, חיפוש וסקירה של עבודות רלוונטיות קודמות, בחירת דרך טיפול בבעיה, בדיקה (ניסויית, חישובית או תיאורטית של הרעיונות) וכתיבת דו"ח מסכם. עם צבירת 100 נקודות, הסטודנטים מתבקשים להידבר עם חברי סגל בנוגע לבחירת נושא ותחילת הכנות לקראת הפרויקט. הרשמה פורמלית תתבצע בסמסטר שבו יוגש הפרויקט.',
                    n: 0.113,
                },
            },
        },
        {
            i: 238,
            $: {
                '0': { v: '044101', n: 1 },
                '1': { v: 'מבוא למערכות תכנה', n: 0.577 },
                '2': {
                    v: 'השלמת נושאים בתכנות C: רשומות, ניהול זיכרון, פוינטרים לפונקציות, מודולים, מימוש מבני נתונים (רשימות מקושרות, מחסנית, עצי חיפוש), תכנות מונחה עצמים (מחלקות, תבניות, הורשה, פולימורפיזם) STL ולימוד שפת ++C. סביבת UNIX, כלים ומנגנונים, מערכת הקבצים, תהליכים, תכנות בשפת BASH. מתודולוגיה של פיתוח ותחזוקת תוכנה.',
                    n: 0.151,
                },
            },
        },
        {
            i: 239,
            $: {
                '0': { v: '044102', n: 1 },
                '1': { v: 'בטיחות במעבדות חשמל', n: 0.577 },
                '2': {
                    v: 'במסגרת מקצוע זה הסטודנט חייב להשתתף בהרצאה בנושא "בטיחות עבודה במערכות חשמל" (4 שעות) ובמבחן מסכם. הציון במקצוע הוא "עובר/נכשל", כאשר סף המעבר הוא ציון 80 במבחן. קבלת ציון "עובר" במקצוע זה הוא תנאי קדם לביצוע ניסויים ופרוייקטים בכל מעבדות הפקולטה להנדסת חשמל, למעבדות הפקולטה לפיסיקה (לסטודנטים של הנדסת חשמל), ולמעבדות הפקולטה להנדסה ביורפואית.',
                    n: 0.136,
                },
            },
        },
        {
            i: 240,
            $: {
                '0': { v: '044105', n: 1 },
                '1': { v: 'תורת המעגלים החשמליים', n: 0.577 },
                '2': {
                    v: 'קירוב המעגל החשמלי המקובץ, חוקי יסוד, מעגלי התנגדות, שיטת מתחי צמתים ומשפטי רשת. מעגל לא לינארי, ליניאריזציה לאות קטן ויישומי אי-ליניאריות באות גדול עבור מעגלים בוליאניים. סלילים וקבלים. תופעות מעבר זמניות במעגלים חשמליים, מסדר ראשון ושני וניתוח הספקים. רשת ליניארית במצב מתמיד סינוסי: פאזורים, מסנני תדר ומעגלי תהודה, כולל שיקולי הספק. תופעות צימוד קיבולי וצימוד השראותי. מעגלי מגבר שרת.',
                    n: 0.13,
                },
            },
        },
        {
            i: 241,
            $: {
                '0': { v: '044114', n: 1 },
                '1': { v: "מתמטיקה דיסקרטית ח'", n: 0.577 },
                '2': {
                    v: 'הגדרה, הצגה ופעולות על קבוצות. יחסים בינריים, הרכבת יחסים, יחסי שקילות. קבוצת החזקה, קבוצות אינסופיות ומשפט קנטור. תחשיב הפסוקים, אקסיומה והוכחה, תחשיב היחסים. עקרון האינדוקציה. הגדרה באינדוקציה וברקורסיה. נוסחאות נסיגה. עקרונות ספירה בסיסיים. צירופים ותמורות. המקדמים הבינומיים. פתרונות ע"י נוסחאות נסיגה. עקרון שובך היונים ועקרון ההכלה וההדחה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 242,
            $: {
                '0': { v: '044124', n: 1 },
                '1': { v: 'אלקטרוניקה פיסיקלית', n: 0.707 },
                '2': {
                    v: 'תכונות נדרשות של התקנים מודרניים, יסודות של פיסיקה סטטיסטית: מצבי מיקרו ומאקרו, שווי משקל תרמי, הגדרת טמפרטורה, העברת חום וחלקיקים בין מערכות, סוגי חלקיקים והתפלגותם. מבנה גבישים. חומרים אלקטרוניים אמורפיים וגבישים (תלת-, דו- וחד ממדיים). תנע גבישי. תנודות סריג ופונונים. תהליכי פיזור, התקנים חדשים והפרמטרים האופייניים שלהם.',
                    n: 0.146,
                },
            },
        },
        {
            i: 243,
            $: {
                '0': { v: '044127', n: 1 },
                '1': { v: 'יסודות התקני מוליכים למחצה', n: 0.5 },
                '2': {
                    v: 'מושגי יסוד בפיזיקה קוונטית: גביש, פסי אנרגיה, אלקטרונים וחורים. סיגים, חמרים סוג N+P. ניידות ומוליכות חשמלית, דיפוזיה, ניסוי HALL. משואת הרציפות, דוגמאות. צפיפות מצבים ורמת פרמי. צומת P-N. אופין זרם של דיודה ונקודת עבודה, התנגדות וקיבול דיפרנציאלי. דיודה ראלית, פריצה. טרנזיסטור ביפולרי, עקרון פעולה, הגבר. משואת אברמס-מול. סכימת תמורה פיסיקלית לאות קטן. מרכיבי אלפא, תלות אלפא וביתא בתדר. קבל MOS. טרנזיסטור MOS: משואת זרם. טרנזיסטור MOS - אות קטן. טרנזיסטור JEFT וסכמת תמורה לאות קטן.',
                    n: 0.115,
                },
            },
        },
        {
            i: 244,
            $: {
                '0': { v: '044131', n: 1 },
                '1': { v: 'אותות ומערכות', n: 0.707 },
                '2': {
                    v: '1. אותות רציפים ובדידים - מושגים בסיסיים. 2. מערכות רציפות בזמן ובדידות בזמן - מושגים בסיסיים. 3. אנליזה של מערכת לינארית במישור הזמן. 4. התמרת לפלס. 5. התמרת פוריה ותגובת תדר. אפנון וריבוב. 6. התמרת Z ותפקידה במערכות בדידות. משוואות הפרש. 7. התמרת פוריה (רציפה) של אות בדיד ותגובת תדר של מערכת בדידה. 8. תאור מערכות במרחב המצב.מידול מערכות פיסיקליות, לינאריזציה. 9. יציבות של מערכות לינאריות וקבועות בזמן. 10. מערכות משוב: תכונות בסיסיות, יציבות, בקרי PID.',
                    n: 0.115,
                },
            },
        },
        {
            i: 245,
            $: {
                '0': { v: '044137', n: 1 },
                '1': { v: 'מעגלים אלקטרוניים', n: 0.707 },
                '2': {
                    v: 'מעגלים לוגיים, שולי רעש, זמני מיתוג והשהיות, שערים אידיאליים, שערי תמסורת, לוגיקה דינמית, הספק סטטי ודינמי, אופטימיזצית מהירות ומאמץ לוגי, תנאי תזמון, רגנרציה, סינכרון, מעגלי רגיסטרים, מעגלים סדרתיים, מטה-סטביליות, מעגלי זיכרון. עיבוד אנלוגי של אותות, דרגות הגבר, אות גדול ואות קטן, לינאריזציה ומעגלי תמורה, תגובת תדר, מגבר הפרש, מגברי שרת, משוב ויציבות, ניתוח רעש במעגלים, המרת אות אנלוגי לדיגיטלי.',
                    n: 0.13,
                },
            },
        },
        {
            i: 246,
            $: {
                '0': { v: '044139', n: 1 },
                '1': { v: 'ממירי מתח ממותגים', n: 0.577 },
                '2': {
                    v: 'ממירים עם ובלי בידוד גלווני להעלאת המתח ולהורדת המתח, אופני עבודה, ניתוח ממירים במצב מתמיד. שיטות סימולציה של מערכות מיתוג. רכיבים מגנטיים. הפסדים במערכות מיתוג, נצילות. יציבות דינאמית של הממירים, חישוב ותכנון רשתות פיצוי. מבוא לאנרגיה "ירוקה", עקרונות מערכות סולאריות.',
                    n: 0.158,
                },
            },
        },
        {
            i: 247,
            $: {
                '0': { v: '044140', n: 1 },
                '1': { v: 'שדות אלקטרומגנטיים', n: 0.707 },
                '2': {
                    v: 'משוואות מקסוול דיפרנציאליות ואינטגרליות. תנאי שפה, חוקי שימור. פוטנציאלים אלקטרומגנטיים. שימור אנרגיה ומשפט פוינטינג. פאזורים ומשפט פוינטינג הקומפלקסי. משוואת גלים והגל האלקטרו-מגנטי. מגלים לקווזיסטטיקה. אלקטרוקווזיסטטיקה. מגנטוקווזיסטטיקה. זרימה סטטציונרית. מוליכים וחומרים דיאלקטריים. חומרים מגנטיים.',
                    n: 0.174,
                },
            },
        },
        {
            i: 248,
            $: {
                '0': { v: '044148', n: 1 },
                '1': { v: 'גלים ומערכות מפולגות', n: 0.577 },
                '2': {
                    v: 'הקדמה, ממשוואות מקסוול למשוואת הגלים. גלים מישוריים - תכונות. גלים מישוריים - התקדמות בחומר ודיספרסיה. פגיעה ומעבר דרך משטחים מקדמי פרנל). פגיעה ומעבר דרך משטחים (זוויות מיוחדות). מעבר דרך משטחים כפולים (מהודים). מוליכי גלים - מוליך הגל החשמלי ( PARALLEL PLATE ). מוליכי גלים - הפרוסה הדיאלקטרית. קווי תמסורת: הקדמה, משוואות הטלגרפיה. קווי תמסורת כרכיב במעגל. קווי תמסורת: תאום עכבות והעברת הספק. תופעות זמניות בקווי תמסורת.',
                    n: 0.123,
                },
            },
        },
        {
            i: 249,
            $: {
                '0': { v: '044157', n: 1 },
                '1': { v: 'מעבדה בהנדסת חשמל 1א', n: 0.5 },
                '2': {
                    v: 'המעבדה כוללת 9 מפגשים בני 4 שעות כ"א (וכן הכנות לניסוי בהתאם לנדרש). מערך הניסויים כולל: ניסויים בתחום האנלוגי: הכרת מכשור מדידה, בניה של מעגלים אלקטרונים ומעגלי מיתוג בסיסיים. בכל הניסויים ייערכו תכן, סימולציה והשוואה למדידות. ניסויים בתחום הספרתי: תכן חומרה ספרתית בכלים גרפיים ובשפה עילית, HDL, סימולציה וניפוי שגיאות. כ"כ ניסוי מסכם במתכונת מיני פרוייקט: תכנון בנייה והפעלה של מערכת הירארכי. בניסויים מושם דגש על גישה מערכתית והכרת תהליך הפיתוח של מערכת אלקטרונית שלמה.',
                    n: 0.115,
                },
            },
        },
        {
            i: 250,
            $: {
                '0': { v: '044158', n: 1 },
                '1': { v: 'מעבדה בהנדסת חשמל 1ב', n: 0.5 },
                '2': {
                    v: 'המעבדה כוללת 6 מפגשים בני 4 שעות כ"א (וכן הכנות לניסוי בהתאם לנדרש). מערך הניסויים כולל: ניסויים בתחום הפיזיקלי: ניתוח מעגלי מוליכים למחצה, דיודות וטרנזיסטורים. ניסויים בתחום האנלוגי: מגבר שרת ושימושיו. ניסויים בתורת הדגימה: מעגלי המרה A/D ו- D/A. בכל הניסויים יערכו תכן, סימולציה והשוואה למדידות וכן מפגש לניסוי מסכם במתכונת מיני פרוייקט: תכנון בנייה והפעלה של מערכת אנלוגית. בניסויים מושם דגש על גישה מערכתית והכרת תהליך הפיתוח של מערכת אלקטרונית שלמה.',
                    n: 0.118,
                },
            },
        },
        {
            i: 251,
            $: {
                '0': { v: '044159', n: 1 },
                '1': { v: 'מעבדה בהנדסת חשמל 2', n: 0.5 },
                '2': {
                    v: 'על הסטודנט להשלים במעבדה זו ארבעה ניסויי בחירה מרשימת הניסויים המתפרסמת בתחילת כל סמסטר. הניסויים מתבצעים במעבדות ההתמחות בפקולטה. כל ניסוי מורכב משתי פגישות של 4 שעות כל אחת. כמו כן יש לבצע מטלות הכנה וסיכום בהתאם לנדרש. במסגרת מעבדות 2 ו-3 (יחד), ניתן לקחת עד שני ניסויים המשתייכים לאותה מעבדת הוראה.',
                    n: 0.139,
                },
            },
        },
        {
            i: 252,
            $: {
                '0': { v: '044166', n: 1 },
                '1': { v: 'מעבדה בהנדסת חשמל 3', n: 0.5 },
                '2': {
                    v: 'על הסטודנט להשלים במעבדה זו שלושה ניסויי בחירה מרשימת הניסויים המתפרסמת בתחילת כל סמסטר. הניסויים מתבצעים במעבדות ההתמחות בפקולטה. כל ניסוי מורכב משתי פגישות של 4 שעות כל אחת. כמו כן יש לבצע מטלות הכנה וסיכום בהתאם לנדרש. במסגרת מעבדות 2 ו-3 (יחד), ניתן לקחת עד שני ניסויים המשתייכים לאותה מעבדת הוראה.',
                    n: 0.139,
                },
            },
        },
        {
            i: 253,
            $: {
                '0': { v: '044167', n: 1 },
                '1': { v: "פרוייקט א'", n: 0.707 },
                '2': {
                    v: "יש לקחת את קורס הבטיחות לפני הרישום לפרויקט. מטרת המקצוע היא הכשרת הסטודנט להתמודדות עצמאית עם אתגר הנדסי או מחקרי חדשני בהדרכת מנחה. במסגרת זו יתנסה הסטודנט בביצוע כל המרכיבים המאפיינים פרויקט הנדסי: הגדרה, אפיון, סקר ספרות, בחינת פתרונות חלופיים, תכן, מימוש, בדיקה, הצגה ודווח. בחירת נושא הפרויקט וביצועו יעשה ע\"י זוג סטודנטים מתוך רשימת נושאים המתפרסמת ע\"י כל אחת ממעבדות ההתמחות בפקולטה. רשימת המעבדות והסדרי הרישום מופיעים באתר המעבדות הפקולטי. כדי להתעמק בתחום הנבחר ניתן לבצע פרויקט המשך או שני פרויקטים שונים באותה מעבדה (במסגרת המקצועות: פרויקט א', פרויקט ב', או פרויקט מיוחד). אין לבצע שני פרויקטים באותה מעבדה באותו הסמסטר ואין לבצע שלושה פרויקטים באותה מעבדה. במסגרת המקצוע יינתנו הדרכות כלליות ומעבדתיות בנושאים הקשורים לביצוע פרויקטים, כגון: כלי תכנה וחמרה, אפיון פרויקט, הכנת מצגות ודווח. ההדרכות יינתנו בשעתיים שבועיות שיוקצו בלוח השעות של הסמסטר השישי. מכיל את המתודולוגיה של פרויקט ב'.",
                    n: 0.084,
                },
            },
        },
        {
            i: 254,
            $: {
                '0': { v: '044169', n: 1 },
                '1': { v: 'פרויקט  ב', n: 0.707 },
                '2': {
                    v: 'יש לקחת את קורס הבטיחות לפני הרישום לפרויקט. מטרת המקצוע היא הכשרת הסטודנט להתמודדות עצמאית עם אתגר הנדסי או מחקרי חדשני בהדרכת מנחה. במסגרת זו יתנסה הסטודנט בביצוע כל המרכיבים המאפיינים פרויקט הנדסי: הגדרה, אפיון, סקר ספרות, בחינת פתרונות חלופיים, תכן, מימוש, בדיקה, הצגה ודווח. בחירת נושא הפרויקט וביצועו יעשה ע"י זוג סטודנטים מתוך רשימת נושאים המתפרסמת ע"י כל אחת ממעבדות ההתמחות בפקולטה. רשימת המעבדות והסדרי הרישום מופיעים באתר המעבדות הפקולטי. כדי להתעמק בתחום הנבחר ניתן לבצע פרויקט המשך או שני פרויקטים שונים באותה מעבדה (במסגרת המקצועות: פרויקט א\', פרויקט ב\', או פרויקט מיוחד). אין לבצע שני פרויקטים באותה מעבדה באותו הסמסטר ואין לבצע שלושה פרויקטים באותה מעבדה. עפ"י הצורך, ניתן להשתתף בהדרכות הכלליות והמעבדתיות המפורטות בפרויקט א\' (044167).',
                    n: 0.092,
                },
            },
        },
        {
            i: 255,
            $: {
                '0': { v: '044170', n: 1 },
                '1': { v: 'פרויקט  מיוחד', n: 0.707 },
                '2': {
                    v: 'יש לקחת את קורס הבטיחות לפני הרישום לפרויקט. מטרת המקצוע היא הכשרת הסטודנט להתמודדות עצמאית עם אתגר הנדסי או מחקרי חדשני בהדרכת מנחה. במסגרת זו יתנסה הסטודנט בביצוע כל המרכיבים המאפיינים פרויקט הנדסי: הגדרה, אפיון, סקר ספרות, בחינת פתרונות חלופיים, תכן, מימוש, בדיקה, הצגה ודווח. בחירת נושא הפרויקט וביצועו יעשה ע"י זוג סטודנטים מתוך רשימת נושאים המתפרסמת ע"י כל אחת ממעבדות ההתמחות בפקולטה. רשימת המעבדות והסדרי הרישום מופיעים באתר המעבדות הפקולטי. כדי להתעמק בתחום הנבחר ניתן לבצע פרויקט המשך או שני פרויקטים שונים באותה מעבדה (במסגרת המקצועות: פרויקט א\', פרויקט ב\', או פרויקט מיוחד). אין לבצע שני פרויקטים באותה מעבדה באותו הסמסטר ואין לבצע שלושה פרויקטים באותה מעבדה. עפ"י הצורך, ניתן להשתתף בהדרכות הכלליות והמעבדתיות המפורטות בפרויקט א\' (044167).',
                    n: 0.092,
                },
            },
        },
        {
            i: 256,
            $: {
                '0': { v: '044173', n: 1 },
                '1': { v: 'פרויקט בתעשיה', n: 0.707 },
                '2': {
                    v: 'סטודנט במצב תקין שהשלים "מעבדה בהנדסת חשמל 1" יכול לבצע, באישור הפקולטה, פרויקט במפעל תעשייתי, במקום לבצע פרויקטים ב\' ומיוחד (שווה ערך ל-8.0 נק\'). המפעל התעשייתי והפרויקט חייבים לקבל את אישור הפקולטה לפני הרישום למקצוע. את הפרויקט ילווה מורה מטעם הפקולטה שישותף בהגדרת הפרויקט. בדרך כלל יאושרו רק פרויקטים שלא ניתן לבצעם באחת ממעבדות הפקולטה. הרישום למקצוע ייעשה בעת הרשום המוקדם, לאחר קבלת האישור הפקולטי.',
                    n: 0.124,
                },
            },
        },
        {
            i: 257,
            $: {
                '0': { v: '044174', n: 1 },
                '1': { v: 'מעבדה בהנדסת חשמל 4', n: 0.5 },
                '2': {
                    v: 'על הסטודנט להשלים במקצוע זה שני ניסויי בחירה מרשימת הניסויים המתפרסמת בכל סמסטר, ובתנאי שלא ביצע אותם במסגרת מקצוע אחר. הניסויים מתבצעים (בזוגות) במעבדות ההתמחות בפקולטה. כל ניסוי מורכב משתי פגישות בנות 4 שעות כל אחת . כמו כן יש לבצע מטלות הכנה וסיכום בהתאם לנדרש. ציון הקורס יהיה עובר/נכשל. ציון עובר דורש ציון של 85 לפחות בכל אחד מהניסויים.',
                    n: 0.129,
                },
            },
        },
        {
            i: 258,
            $: {
                '0': { v: '044175', n: 1 },
                '1': { v: 'פרסום מאמר מדעי', n: 0.577 },
                '2': {
                    v: 'על הסטודנט לפרסם מאמר מדעי בו הנו אחד הכותבים הראשיים. מאמר זה ייכתב בעקבות פרויקט סטודנטים באחד ממקצועות הפרויקטים שאינם מחייבים כתיבת מאמר. זכאי להירשם לקורס סטודנט שהיה שותף לכתיבת מאמר שהתקבל לכנס או עיתון מדעי מוכר, ובאישור חבר סגל רלוונטי לתחום בו עוסק המאמר. ציון הסטודנט במקצוע ייקבע ע"י מנחה הפרויקט וחבר הסגל שאישר את הגשת המאמר לכנס / עיתון.',
                    n: 0.128,
                },
            },
        },
        {
            i: 259,
            $: {
                '0': { v: '044180', n: 1 },
                '1': { v: 'נושא אישי למצטיינים', n: 0.577 },
                '2': {
                    v: 'דרישות קדם: ממוצע מצטבר של 91 ומעלה וצבירה של 100 נקודות לפחות במועד הרישום למקצוע. כל סטודנט הרשאי להרשם לקורס זה יונחה באופן אישי ע"י אחד מחברי הסגל בנושא אשר חבר הסגל הביע נכונות להנחות, ויהיה חייב בהגשת דו"ח מסכם בסיום עבודתו. מיועד לסטודנטים מצטיינים, תואר ראשון בהנדסת חשמל.',
                    n: 0.143,
                },
            },
        },
        {
            i: 260,
            $: {
                '0': { v: '044184', n: 1 },
                '1': { v: 'נושאים מתקדמים למצטיינים', n: 0.577 },
                '2': {
                    v: 'דרישת קדם: ממוצע מצטבר של 86 ומעלה וצבירה של 100 נקודות לפחות. כל סטודנט הרשאי להירשם למקצוע זה יונחה באופן אישי על ידי אחד מחברי הסגל בנושא אשר חבר הסגל הביע נכונות להנחות, ויהיה חייב בהגשת דו"ח מסכם בסיום עבודתו.',
                    n: 0.158,
                },
            },
        },
        {
            i: 261,
            $: {
                '0': { v: '044185', n: 1 },
                '1': { v: 'נושא מיוחד למצטיינים', n: 0.577 },
                '2': {
                    v: 'דרישות קדם: ממוצע מצטבר של 86 ומעלה וצבירה של 80 נקודות לפחות. כל סטודנט הרשאי להירשם למקצוע זה יונחה באופן אישי על ידי אחד מחברי הסגל בנושא אשר חבר הסגל הביע נכונות להנחות. הסטודנט יהיה חייב בהגשת דו"ח מסכם בסיום עבודתו.',
                    n: 0.156,
                },
            },
        },
        {
            i: 262,
            $: {
                '0': { v: '044191', n: 1 },
                '1': { v: 'מערכות בקרה 1', n: 0.577 },
                '2': {
                    v: 'חזרה על תיאור מתמטי של מערכות לינאריות. לינאריזיציה במרחב המצב. מאפייני התגובה הדינאמית ותגובת התדר. קריטריון נייקויסט ליציבות. שרטוט המיקום הגיאומטרי של השורשים. שגיאות המצב המתמיד. בקרי PID. תכן רשתות תיקון בתחום התדר ובגישת מיקום השורשים. מגבלות תכן. מימוש בקרים ספרתיים. מערכות מצב: קונטרולביליות, אובזרווביליות, מינימאליות, צורות קנוניות, הצבת קטבים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 263,
            $: {
                '0': { v: '044193', n: 1 },
                '1': { v: 'מעבדה לבקרה לינארית', n: 0.577 },
                '2': {
                    v: 'במעבדה נערכים שישה ניסויים: חזרה על שיטות תכן קלאסי, בקרת זרוע בחיבור גמיש על ידי משוב מצב ובקר LQ, ייצוב מטוטלת הפוכה מעגלית בעזרת בקר LQR, שיטות בבקרה לא ליניארית, כיונון בקר PID, ובקרה של מטוטלת הפוכה קווית בשיטות הצבת קטבים ובקרת חוגים עוקבים.',
                    n: 0.151,
                },
            },
        },
        {
            i: 264,
            $: {
                '0': { v: '044198', n: 1 },
                '1': { v: 'מבוא לעבוד ספרתי של אותות', n: 0.447 },
                '2': {
                    v: 'דגימה ושחזור. התמרת פורייה דיסקרטית ( DFT ) קונבולוציה מעגלית. אלגוריתמים לחישוב יעיל של DFT. אנליזה ספקטרלית. מבוא לתכן מסננים ספרתיים. פאזה לינארית מוכללת. תכן מסננים בעלי תגובת הלם סופית ( FIR ). תכן מסננים אנלוגיים ומסננים ספרתיים בעלי תגובת הלם אינסופית ( IIR ). מערכות מרובות קצבים, דצימציה ואינטרפולציה.',
                    n: 0.141,
                },
            },
        },
        {
            i: 265,
            $: {
                '0': { v: '044202', n: 1 },
                '1': { v: 'אותות אקראיים', n: 0.707 },
                '2': {
                    v: 'חזרה על מושגים בסיסיים בהסתברות. שערוך. תהליכים אקראיים בזמן רציף ובזמן בדיד. תהליכים אקראיים גאוסיים. מעבר אותות במערכות לינאריות. אנליזה ספקטרלית. סינון לינארי. רעשים פיסיקליים במערכות, מקורות רעש ברשתות חשמליות. תהליכי מרקוב.',
                    n: 0.177,
                },
            },
        },
        {
            i: 266,
            $: {
                '0': { v: '044214', n: 1 },
                '1': { v: 'טכניקות קליטה ושידור', n: 0.577 },
                '2': {
                    v: 'שיטות אפנון לינאריות: SSB, DSB-SC, AM. שיטות אפנון זוויתיות: PM, FM, הדגש-קדם וגריעת-קדם, ספקטרום של אותות מאופננים, רעש תרמי במערכות תקשורת, ספרת רעש, טמפרטורת רעש. תפקיד אנטנות במערכות תקשורת, מאזן תקשורת במרחב חופשי, משוואת התקשורת, משוואת המכ"מ. עיוות, נקודת דחיסה ונקודת פגישה. מבנה משדרים ומקלטים, רדיו TRF, סופרהטרודין והומודין. עקרונות מערכת סלולרית. השימוש במטריצות בניתוח מעגלים לתדר גבוה. תכנון של מסננים אנלוגיים. תכנון מגברים לתדר גבוה.',
                    n: 0.123,
                },
            },
        },
        {
            i: 267,
            $: {
                '0': { v: '044231', n: 1 },
                '1': { v: 'התקנים אלקטרוניים 1', n: 0.577 },
                '2': {
                    v: '1. קבל MOS: חזרה על מושגי בסיס במוליכים למחצה, כולל ניתוח דיודה וקוואזי רמות פרמי. חישוב תופעות שפה כתלות בפוטנציאל השטח ורמת פרמי (משואת פואסון). קבל MOS לא אידאלי, מחסור שער, פונקצית עבודה, מטענים ומלכודות בתחמוצת. אפייני ( V ) C בתחומי הפעלה שונים. מודל גנרציה ורקומבינציה לפי SRH, ומהירות רקומבינציה משטחית. התנהגות בזמן של קבל MOS - מחסור עמוק ומדידת זמן חיים. 2. התקן MOS עם 3 הדקים: קבל מבוקר-צומת, קווזי רמות פרמי. אפקט המצע. 3. טרנזיסטור MOS עם 4 הדקים: האופינים בתחום לינארי, רוויה ותת הולכה. התקני CCD. הנחתת הניידות ( UNIVERSAL MOBILITY )ורווית מהירות ( VELOCITY SATURATION ). תעלה קצרה: התקצרות התעלה ( CLM ) ותלות VT באורך ( DIBL ). תופעות אלקטרונים חמים - BTBT ו: IMPACT LONIZATION. זרם בשער ובעיות אמינות SNAPBACK, LATCHUP TDDB. 4. הנדסת התקני MOS: תהליך CMOS סטנדרטי. אופטימיזציה של טרנזיסטור MOS. 5. מעבדות: השתתפות חובה:מדידת מוליכות ואפקט הול (ניסוי ון-דר-פאו), ניסוי היינס שוקלי, מדידה ואפיון קבל MOS, מדידה ואפיון טרנזיסטור MOS.',
                    n: 0.079,
                },
            },
        },
        {
            i: 268,
            $: {
                '0': { v: '044239', n: 1 },
                '1': { v: 'תהליכים במיקרואלקטרוניקה', n: 0.707 },
                '2': {
                    v: 'תהליכים פוטוליטוגרפיים, תהליכים תרמיים של חמצון יבש ורטוב, צריבה רטובה ויבשה של תחמוצות, דיפוזיה ושקוע כימי, השתלת יונים, תהליכי נידוף והתזה של שכבות דקות, הכרת אמצעי בדיקה ומדידה שונים לאפיון התהליכים. יצור התקני מוליכים למחצה שונים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 269,
            $: {
                '0': { v: '044252', n: 1 },
                '1': { v: 'מערכות ספרתיות ומבנה המחשב', n: 0.5 },
                '2': {
                    v: 'אלגברה בוליאנית, המודל הספרתי. פונקציות מיתוג. שערים לוגיים ומערכת שלמה. הטרנזיסטור כמתג. מעגלים צירופיים וסדרתיים. המתודולוגיה הסינכרונית. מכונות מצבים. נקודה צפה. קודים לתיקון שגיאות. שפה לתיאור חומרה. מכונת פון נוימן, סט הפקודות, אופני מיעון, קפיצות. מחסנית וקישור שגרות. פסיקות. מעבד מצונר. זמן פעולה מול תפוקה. תלויות בקרה ותלויות מידע.',
                    n: 0.143,
                },
            },
        },
        {
            i: 270,
            $: {
                '0': { v: '044268', n: 1 },
                '1': { v: 'מבוא למבני נתונים ואלגוריתמים', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס להקנות את המושגים של מבנה נתונים מופשט, מבני נתונים, אלגוריתמים וסיבוכיות. מבני הנתונים כוללים מחסניות, תורים, דו-תורים, תורי קדימות, ערימות, טבלאות ערבול, עצים, עצים מאוזנים וגרפים. הנושאים האלגוריתמים כוללים הפרד ומשול, אלגוריתמים חמדניים, רקורסיה ורנדומיזציה. האלגוריתמים כוללים אלגוריתמי מיון, אלגוריתמי חיפוש, אלגוריתמי ערבול, אלגוריתמים בגרפים, כולל חיפושי עומק ורוחב, עצים פורשים מינימום, מציאת רכיבים קשירים ואלגוריתמים בסיסיים למציאת מסלולים קצרים. נושאי הסיבוכיות כוללים אנליזה אסימפטוטית וחסמים עליונים ותחתונים.',
                    n: 0.12,
                },
            },
        },
        {
            i: 271,
            $: {
                '0': { v: '044334', n: 1 },
                '1': { v: 'רשתות מחשבים ואינטרנט 1', n: 0.5 },
                '2': {
                    v: 'קורס ראשון ברשתות מחשבים ואינטרנט. הקדמה: מושג השכבות, מיתוג חבילות, מיתוג קוויים. שכבת הקו: גישה אקראית, כתובות, ETHERNET, גשרים, שכבת הרשת: IP, נתבים, ניתוב באינטרנט. שכבת ההובלה: TCP, UDP. רשתות חשובות ומושגים חשובים ברשתות: רשתות אלחוטיות, רשתות תורים, הוגנות.',
                    n: 0.16,
                },
            },
        },
        {
            i: 272,
            $: {
                '0': { v: '044339', n: 1 },
                '1': { v: 'פוטוניקה ולייזרים', n: 0.707 },
                '2': {
                    v: 'אלומות גאוסיות, מהודים אופטיים, אינטראקציה של קרינה וחומר, הגברה, פעולת לייזר רציף ולייזר פולסים, גלים בתווכים לא איזוטרופיים, האפקט האלקטרו-אופטי ושימושיו.',
                    n: 0.218,
                },
            },
        },
        {
            i: 273,
            $: {
                '0': { v: '045000', n: 1 },
                '1': { v: 'יזמות בהנ.אלקטרונ.,מחשבים ותקשורת', n: 0.577 },
                '2': {
                    v: 'הקורס יעסוק בהקנית רקע וכלים עסקיים, חשבוניים, משפטיים, שיווקיים וניהוליים, לסטודנטים בהנדסת חשמל ומחשבים שישתלבו בעתיד בתעשית ההיי-טק, החיוניים ליזמות של מוצרים וחברות. הקורס יתן דגש על שימוש פרקטי בכלים כאלו ושילובם ביזום ומיצוב של מוצרים וחברות בתחום תוך שימוש בדוגמאות אקטואליות לסטודנטים.',
                    n: 0.152,
                },
            },
        },
        {
            i: 274,
            $: {
                '0': { v: '045002', n: 1 },
                '1': { v: 'מבט-על להנדסת חשמל ומחשבים', n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים בסמסטרים ראשון ושני בלבד. מטרתו לתאר את שלל התחומים הכלולים בהנדסת חשמל ומחשבים, ולהציג היבטים עיקריים של כישורי המהנדס בתחומי ההי-טק. נושאים: הנדסת חשמל והנדסת מחשבים. חשמל ואלקטרומגנטיות. רשת החשמל ומקורות אנרגיה חשמלית. מערכות תקשורת. מערכות מחשב. אכסון מידע. עיבוד מידע. התקני מיקרו- וננו-אלקטרוניקה. פוטוניקה והתקנים אלקטרואופטיים. נושאים נוספים.',
                    n: 0.139,
                },
            },
        },
        {
            i: 275,
            $: {
                '0': { v: '046002', n: 1 },
                '1': { v: 'תכן וניתוח אלגוריתמים', n: 0.577 },
                '2': {
                    v: 'אלגוריתמים מתקדמים בתורת הגרפים: גרפים מכוונים, בעיות זרימה, בעיות כיסוי וצביעה. מחלקות ,P ו-NP רדוקציות פולינומיות, NP - שלמות אלגוריתמי קירוב. שיטות אלגוריתמיות מתקדמות נוספות.',
                    n: 0.2,
                },
            },
        },
        {
            i: 276,
            $: {
                '0': { v: '046003', n: 1 },
                '1': { v: 'נושאים מתקדמים 1', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס היא חשיפת סטודנטים לתחום מחקרי מתקדם שאינו מכוסה ע"י חברי הסגל בפקולטה. הוא יוצע בדרך כלל בחודשי הקיץ ויינתן ע"י מומחה אורח. יתכן שהקורס יהיה מרוכז ויכלול 14 שעות הרצאה ברצף של שבוע. נושא הקורס ומועדו יפורסמו בהתאם לצורך ולזמינות המרצה המתאים.',
                    n: 0.151,
                },
            },
        },
        {
            i: 277,
            $: {
                '0': { v: '046005', n: 1 },
                '1': { v: 'רשתות מחשבים ואינטרנט 2', n: 0.5 },
                '2': {
                    v: 'קורס המשך ברשתות. גישת מעלה-מטה. שכבת היישום: עקרונות, HTTP AND WEB, DNS, יישומי P2P. שכבת ההובלה:UDP,TCP, בקרת זרימה, בקרת צפיפות ב-TCP.שכבת הרשת: קווים וירטואליים, IP, כתובות 4IPV. ניתוב: עקרונות ואלגוריתמים, BELLMAN-FORD-DISTANCE VECTOR,LINK STATE, CT, PIF,PI , ניתוב אופטימלי,ניתוב באינטרנט,BGP, OSPF, RIP. נושאים מתקדמים ברשתות כגון: רשתות וירטואליות ברשתות מרכזי מידע, רשתות מוגדרות תוכנה ( SDN ).',
                    n: 0.134,
                },
            },
        },
        {
            i: 278,
            $: {
                '0': { v: '046006', n: 1 },
                '1': { v: 'נושאים מתקדמים 3', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס היא חשיפת סטודנטים לתחום מחקרי מתקדם שאינו מכוסה על ידי חברי הסגל בפקולטה. הוא יוצע בדרך כלל בחודשי הקיץ ויינתן על ידי מומחה אורח. יתכן שהקורס יהיה מרוכז ויכלול 28 שעות הרצאה ו-14 שעות תרגול ברצף של שבועיים.נושא הקורס ומועדו יפורסמו בהתאם לצורך ולזמינות המרצה המתאים.',
                    n: 0.144,
                },
            },
        },
        {
            i: 279,
            $: {
                '0': { v: '046042', n: 1 },
                '1': { v: 'מבוא למערכות הספק ורשת חכמה', n: 0.447 },
                '2': {
                    v: 'סקירת מבנה רשת ההספק, מקורות אנרגיה ומקורות מתחדשים. מושגי יסוד במערכות הספק, שנאים, גנרטור סינכרוני, חיבור מקבילי ולרשת קשיחה. קווי תמסורת זרימת ההספק במצב המתמיד בקרת הספק, תדר , מתח הספק עיוור, היבטים כלכליים, מבוא לרשת חכמה. תוצאות למידה: הדגש בקורס הוא על מערכת ההספק כמכלול. מטרת הקורס היא להקנות לסטודנטים: 1. זווית ראייה רחבה על מערכות הספק תוך דיון בעקרונות הבסיסיים של רשתות הספק והתקנים מרכזיים להמרת אנרגיה חשמלית. תוצאות למידה: מטרת הקורס היא להקנות לסטודנטים זווית ראיה רחבה על מערכות הספק תוך דיון בעקרונות הבסיסיים של רשתות הספק והתקנים מרכזיים להמרת אנרגיה חשמלית.',
                    n: 0.103,
                },
            },
        },
        {
            i: 280,
            $: {
                '0': { v: '046187', n: 1 },
                '1': { v: 'תכן מעגלים אנלוגיים', n: 0.577 },
                '2': {
                    v: 'תכנון מעגלים: שיטת תכנון ע"פ העקרון של אי-תאום אימפדנסים. מגברים רחבי סרט. טכניקה של "הזנת קדימה" ( FEED FORWARD ) להרחבת רוחב הסרט. תאים סטנדרטיים ב-VLSI. משוב: השיטה הטופולוגית לניתוח מגברי משוב. אחידות חוקי משוב מקבילי וטורי, תוך נצול הדואליות הקיימת ביניהם. הגדרת הרגישות של מגבר להפרעות חיצוניות והשימוש במשוב לשם הקטנתה. הקטנת ה-CMRR ( COMMON MODE REJECTION RATIO ) של מגברי הפרש ע"י משוב. תכנון מגברי משוב לתגובה מונוטונית בנוכחות השהיה בעניבה, תוך שמוש בשיטת ROOT-LOCUS. הגדרת המושג "משוב מדגיש" והשלכותיו על תכנון מגברים. הטכניקה הטרנסליניארית של גילברט: תכנון מגברים לפי שיטה זו. מכפל אנלוגי. ממוש של סיכום וקטורים ופונקציות אי- לינאריות אחרות. אופן זרם: מעתיקי זרם. אינטגרטור זרם. מגבר בעל משוב זרם אמיתי בכניסה ודרגת יציאה של זרם. נושאים של רעש: רעש בדיודות, טרנזיסטורים ומגברים. תכן מגברי קדם לרעש נמוך.',
                    n: 0.087,
                },
            },
        },
        {
            i: 281,
            $: {
                '0': { v: '046192', n: 1 },
                '1': { v: 'מערכות בקרה 2', n: 0.577 },
                '2': {
                    v: 'משוב מצב והצבת קטבים. משחזר מצב. צורה סטנדרטית למערכת שאינה קונטרולבילית ואובזרוובילית. יציבות במובן ליאפונוב ומשוואת ליאפונוב. בקרה אופטימאלית: מבוא, בקר .LQR מסנן קלמן. בקר LQG ומבוא לבקרה אופטימאלית בתחום התדר. מערכות לינאריות משתנות בזמן._\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. לתאר ולהשתמש בשיטות התכן הבסיסיות של בקרה ושערוך לינארי במרחב המצב, ובפרט:\n2. לחשב את הצורה הסטנדרטית של מערכת מצב לא מינימלית.\n3. לתכנן משחזר מצב, ולממש מסנן קלמן אופטימלי._\n4. לתכן בקר בשיטת הצבת קטבים, ובקר אופטימלי מסוג LQR ומסוג LQG.\n5. לתאר את תכונות הפתרונות של מערכות מצב לינאריות משתנות בזמן.',
                    n: 0.105,
                },
            },
        },
        {
            i: 282,
            $: {
                '0': { v: '046195', n: 1 },
                '1': { v: 'מערכות לומדות', n: 0.707 },
                '2': {
                    v: 'קורס מבוא למערכות לומדות בהקשרן לעיבוד אותות, בינה מלאכותית ולמערכות בקרה. בעיות סיווג, רגרסיה ואישכול. רשתות עצביות: פרספטרונים רב-שכבתיים, פונקציות בסיס רדיאליות. עצי החלטה. יסודות בתורת הלמידה: הגישה הבייסיאנית, מרחבי השערות. הפחתת מימדיות בעזרת מיצוי רכיבים עיקריים. סיווג בשיטת וקטורי התמיכה. למידה על ידי חיזוקים. תוצאות למידה: בסיום הקורס הסטודנטים יכירו את יסודות התחום של מערכות לומדות, כולל מספר אלגוריתמים מרכזיים, וידעו לפהיעלם על בעיות מעשיות.',
                    n: 0.123,
                },
            },
        },
        {
            i: 283,
            $: {
                '0': { v: '046200', n: 1 },
                '1': { v: 'עבוד ונתוח תמונות', n: 0.577 },
                '2': {
                    v: 'מבוא לראייה ולעבוד תמונות. אותות ומערכות ליניאריות בדו-מימד. דגימה ושחזור של תמונות: דגימה אחידה, תופעת הקיפול בתמונות ( ALIASING ), דגימה על סריג כללי. קוונטיזציה: סקלרית, שיקולים חזותיים, קוונטיזצית צבע. שיפור תמונות: פעולות נקודה, עיצוב היסטוגרמה, סינון והחלקה, הדגשת שפות. שחזור תמונה: שחזור ML, שחזור MAP. התמרות דיסקרטיות בדו-מימד. ייצוג וניתוח תמונות ברזולוציה משתנה. דחיסת תמונה: מושגים בסיסיים בתורת האינפורמציה, יתירויות בתמונות, דחיסה משמרת, דחיסה לא משמרת. מבוא לראיה ממוחשבת.',
                    n: 0.12,
                },
            },
        },
        {
            i: 284,
            $: {
                '0': { v: '046201', n: 1 },
                '1': { v: 'עיבוד אותות אקראיים', n: 0.577 },
                '2': {
                    v: 'הגדרה ודוגמאות של בעית השערוך, מושגים בסיסיים בשערוך פרמטרים, שערוך פרמטר אקראי ודטרמיניסטי במודל לינארי, מודלים פרמטריים של תהליכים אקראיים בזמן בדיד, שיטות לשערוך פרמטרי של פונקצית האוטוקורלציה והספקטרום של תהליך סטציונרי, חיזוי לינארי, אלגוריתם ה-LMS, בחינת השערות פשוטות ומורכבות.',
                    n: 0.158,
                },
            },
        },
        {
            i: 285,
            $: {
                '0': { v: '046202', n: 1 },
                '1': { v: 'עיבוד וניתוח מידע', n: 0.577 },
                '2': {
                    v: 'מבוא לנושאי הפקת מידע מנתונים ושיטות למידה לא מפוקחת. יסודות בהסקה סטטיסטית: אמידה פרמטרית ולא-פרמטרית, בדיקת השערות. עיבוד ראשוני של נתונים. בחירת מאפיינים. שיטות להורדת מימדיות: ניתוח רכיבים עיקריים, פירוק ערכים סינגולריים, הרחבות לא-לינאריות. מדדי מרחק ודימיון בין פריטי מידע. אלגוריתמים לאשכול. זיהוי שכיחות וקשר, וזיהוי חריגים. יישומים מייצגים. תוצאות למידה: בתום הקורס הסטודנט יהיה מסוגל: 1. לתאר את בעיות היסוד בניתוח מידע. 2. להסביר וליישם שיטות סטטיסטיות להערכת פרמטרים ובדיקת השערות מתוך מידע 3. להסביר וליישם שיטות בסיסיות לבחירת מאפיינים. 4. להסביר וליישם אלגוריתמים להורדת ממדיות מידע.\n5. להסביר וליישם אלגוריתמים לזיהוי שכיחות וקשר. 6. להסביר וליישם אלגוריתמים לאשכול נתונים. 7. להסביר וליישם אלגוריתמים לניתוח וזיהוי חריגים במידע.',
                    n: 0.096,
                },
            },
        },
        {
            i: 286,
            $: {
                '0': { v: '046204', n: 1 },
                '1': { v: 'תקשורת אנלוגית', n: 0.707 },
                '2': {
                    v: 'שיטות איפנון פולסים במשרעת, בזמן ובתדר. תופעת הסף באיפנון מרחיב סרט. רבוב זמן ותדר. שידור על גל נושא, העתקה ספקטרלית SSB. איפנון רציף במשרעת ובתדר ושיטות דמודולציה. השוואת שיטות תקשורת לפי יחס אות לרעש. מאזני הספקים דרושים לתקשורת יעילה.',
                    n: 0.16,
                },
            },
        },
        {
            i: 287,
            $: {
                '0': { v: '046206', n: 1 },
                '1': { v: 'מבוא לתקשורת ספרתית', n: 0.577 },
                '2': {
                    v: 'מבוא לתורת התקשורת הסטטיסטית. בעיות והחלטה בין מספר סופי של אותות אפשריים. המקלט האופטימלי עבור אותות בעלי צורה ידועה בצרוף רעש גאוסי לבן. מקלט הקורלציה והמסננת המתואמת. הסתברות השגיאה. שיטות אפנון ספרתיות. בחירה יעילה של אותות לתקשורת ספרתית בינרית. גילוי אופטימלי כאשר מספר פרמטרים לא ידועים. בעית המכ"מ הקלסית. יסודות השערוך וישומם לבעיות מכ"מ אפנון PPM. תקשורת בינרית במשטר פואסוני (אופציונלי).',
                    n: 0.128,
                },
            },
        },
        {
            i: 288,
            $: {
                '0': { v: '046209', n: 1 },
                '1': { v: 'מבנה מערכות הפעלה', n: 0.577 },
                '2': {
                    v: 'הקדמה: סוגי מערכות הפעלה, הצגה הירארכית. מושג התהליך: מבני נתונים, יצירה, בקרה (קואורדינציה) והשמדה, תקשורת תהליכים CONTEXT SWITCHING. נהול זיכרון ראשי: ארגון ומימוש. טיפול בפסיקות: קלט-פלט, זימון, פסיקות תכנה. נהול שעון בזמן אמת: ארגון ומימוש. מערכות קבצים: קלט-פלט לדיסק, מבני נתונים, מדריכים. נהול קלט-פלט: מסופים, דיסקים, אפיק תקשורת, אתחול מערכת ונהול קונפיגורציה.',
                    n: 0.139,
                },
            },
        },
        {
            i: 289,
            $: {
                '0': { v: '046210', n: 1 },
                '1': { v: 'מעבדה במערכות הפעלה', n: 0.577 },
                '2': {
                    v: 'תרגול יישומי של עקרונות מערכות הפעלה בשפת C עם קריאות מערכת של UNIX',
                    n: 0.277,
                },
            },
        },
        {
            i: 290,
            $: {
                '0': { v: '046211', n: 1 },
                '1': { v: 'למידה עמוקה', n: 0.707 },
                '2': {
                    v: 'נלמד כלים תיאורטיים ומעשיים כדי לבנות, לאמן ולנתח רשתות נוירונים ללמידה עמוקה, בדגש על למידה מונחית. למשל, תכונות ותנאי התכנסות של אלגוריתם הגרדיאנט וגרסאותיו השונות, רשתות רב שכבתיות (תכונות קירוב וסימטריות), חישוב יעיל של נגזרות, רשתות קונוולוציה והרחבותיהן למשימות ראייה, שיטות אימון וניתוחן, רשתות למשימות סדרתיות, ולמידה מקדימה.\nתוצאות למידה: עם השלמת הקורס הסטודנטים יהיו מסוגלים:\n1. להכיר את המודלים העיקריים ושיטות אימון מקובלות ללמידה עמוקה. 2. לכתוב קוד PYTHON , בסביבת PYTORCH, לבנייה, אימון ושימוש ברשת עמוקה. 3. להבין את השיקולים הנדרשים לכיוונון רשתות עמוקות כדי לקבל ביצועים טובים, ואת התוצאות התיאורטיות הרלוונטיות (במידה וקיימות).',
                    n: 0.103,
                },
            },
        },
        {
            i: 291,
            $: {
                '0': { v: '046212', n: 1 },
                '1': { v: "מבוא לרובוטיקה ח'", n: 0.577 },
                '2': {
                    v: 'מבוא לקינמטיקה, דינמיקה, תכנון תנועה ובקרה של מניפולטורים רובוטיים. טרנספומציות הומוגניות, קינמטיקה קדמית והופכית, יעקוביאן קדמי והופכי. דינמיקה במרחב הצירים ובמרחב המבצעי. מערכת הפעלה רובוטית ( ROS ). בקרת תנועה ובקרת כוח. תכנון תנועה. מערכת הפעלה רובוטית. תוצאות למידה: לימוד העקרונות לתכנון ובקרת תנועה של מניפולטור רובוטי, קינמטיקה ודינמיקה, ועד למימוש אלגוריתמי בקרה במערכת הפעלה רובוטית. בסוף הקורס, הסטודנט/ית יממשו תכנון תנועה ובקרה של רובוט בסימולציה.',
                    n: 0.123,
                },
            },
        },
        {
            i: 292,
            $: {
                '0': { v: '046225', n: 1 },
                '1': { v: 'עקרונות פיזיקליים של התקני מל"מ', n: 0.447 },
                '2': {
                    v: 'ריכוזי אלקטרונים וחורים במל"מ. FREEZEOUT. IMPURITY BANDS. הולכה אמביפולרית, תהליכי התאחדות. התאחדות באזור המיחסור של צומת PN. קואזי רמת פרמי. תנאי בולצמן. IMPACT IONIZATION. צומת מתכת-מל"מ. HETEROJUNCTION. פליטה תרמיונית. תופעות תלויות זמן - קיבול דיפוזיה.',
                    n: 0.169,
                },
            },
        },
        {
            i: 293,
            $: {
                '0': { v: '046232', n: 1 },
                '1': { v: 'פרקים בננו-אלקטרוניקה', n: 0.707 },
                '2': {
                    v: 'סקלות אורך אופייניות במוצקים, תורת לנדאואר (שימושים: קוואנטיזציה של הולכה, אפקט הול הקוואנטי), פאזות גיאומטריות (ברי, אהרונוב - בוהם), תהליכי התאבכות והריסתם, אנטראקציות אלקטרון-אלקטרון, לוקליזציה ופלקטואציות בהולכה, גז האלקטרונים הדו-מימדי, נקודות קוונטיות ומחסום קולומב, מחשוב קוואנטי.',
                    n: 0.167,
                },
            },
        },
        {
            i: 294,
            $: {
                '0': { v: '046237', n: 1 },
                '1': { v: 'מעגלים משולבים - מבוא ל-וי.ל.ס.י.', n: 0.447 },
                '2': {
                    v: 'שיקולים בתיכון מעגלי VLSI בטכנולוגית MOS. עריכה גיאומטרית וחוקי תיכון ב-NMOS. מתודולוגיות בתיכון מעגלים משולבים: לוגיקה אקראית, תיכון מבני, PLA. מעגלי זכרון ב-MOS. מעגלים משולבים בטכנולוגית CMOS. מעגלים משולבים בטכנולוגיה ביפולרית. שיקולי תיכון של מעגלים אנלוגיים משולבים.עזרי מחשב בתיכון VLSI. מערכי שערים, תאים סטנדרטיים, מעגלים יחודיים. כיווני התפתחות בהנדסת VLSI.',
                    n: 0.141,
                },
            },
        },
        {
            i: 295,
            $: {
                '0': { v: '046241', n: 1 },
                '1': { v: 'מכניקה קוונטית', n: 0.707 },
                '2': {
                    v: "הנושאים: יסודות המכניקה האנליטית, לגרנג'יאן והמילטוניאן, מבוא מתמטי למרחבי הילברט, מקום ותנע, דינמיקה קוואנטית, אוסצילטור הרמוני, תנע זויתני, מערכת ספין 1/2, אטום המימן, שיווי משקל תרמי, תורת ההפרעות הבלתי תלויה בזמן.",
                    n: 0.18,
                },
            },
        },
        {
            i: 296,
            $: {
                '0': { v: '046243', n: 1 },
                '1': { v: 'טכנולוגיות קוונטיות', n: 0.707 },
                '2': {
                    v: "פוסטולטים של מכאניקת הקוונטים. מערכת שני מצבים: ספין, ספירת בלוך, תהודה מגנטית גרעינית ( NMR ), שליטה קוהרנטית על מצב ספין. מטרולוגיה קוונטית: MRI, שעונים אטומים. חישוב קוונטי: קיוביט, שערים ואלגוריתמים קוונטים. אינפורמציה קוונטית: שזירות ומטריצת הצפיפות. תקשורת והצפנה קוונטית. מימושים למחשוב קוונטים: NMR, CAVITY QED וצמתי ג'וספסון. אינטרקציה בין אור וחומר: צימוד חלש וחזק, מודל JAYNCE - CUMMING . סימולטורים קוונטים וחומרים קוונטים.\nמטרת הקורס היא ללמד את היסודות הנדרשים להבנה ופיתוח טכנולוגיות קוונטיות, בדגש על אפליקציות מבוססות וטכנולוגיות מתפתחות. נלמד ייצוג מידע קוונטי דרך ספין וספירת בלוך, יחד עם שיטות לשליטה קוהרנטית. הסטודנטים ירכשו את העקרונות מאחורי MRI, NMR, ושעונים אטומיים, תוך סקירת תהליך המחקר שהוביל לטכנולוגיות אלו. על בסיס אבני בניין שיירכשו, יילמדו אינפורמציה, תקשורת, ומחשוב קוונטי. הסטודנטים יישמו אלגוריתם המתאים למחשב קוונטי ( IBM-Q ). בנוסף,יילמדו בהרחבה אתגרי ואופני המימוש העיקריים ברמת החומרה והשליטה במערכת תוך שימוש בעקרונות הלקוחים מאינטראקציות אור-חומר. לשם כך, יילמדו אתגרי המימוש מרמת החומרה דרך אופן קידוד האינפורמציה ועד אלגוריתמיקה קוונטית בסיסית. בהתאם להספק בכיתה הסטודנטים יקבלו טעימה מעקרונות של אינטראקציית אור-חומר וחומרים קוונטיים. בסיום הקורס, הסטודנטים ירכשו את הבסיס הפיסיקלי להשתלבות בקבוצת מחקר העוסקת בטכנולוגיות קוונטיות ויבינו את אופן התכנון של התקנים קוונטים.",
                    n: 0.072,
                },
            },
        },
        {
            i: 297,
            $: {
                '0': { v: '046244', n: 1 },
                '1': { v: 'תופעות גלים', n: 0.707 },
                '2': {
                    v: 'תופעות גלים בסיסיות (חזרה). קרוב האופטיקה הגיאומטרית: גישת LUNEBURG-KLINE. שיטות ניתוב. דוגמאות יישום לתכנון מערכות אופטיות ותאור תהליכי התפשטות ופיזור בתדרי רדיו ומיקרוגל. אופטיקה גיאומטרית לדיפרקציה ( GTD ): מושגי יסוד ודוגמאות יישום. קרוב האופטיקה הפיסיקלית: תאור וקטורי וסקלרי. הנחות קירהוף וריילי-סומרפלד. תאור העקיפה בעזרת סופרפוזיציה ספקטרלית של גלים מישוריים. עקיפת פראונהופר ופרנל. מושג האלומה. דוגמאות יישום. עקרונות אופטיקה פוריה ואנלוגיה לתורת המערכות הלינאריות: תכונות פורייה של עדשות דקות. סינון מרחבי עיבוד אותות אופטי. שיטות פתרון חישוביות, מומנטים. היבטים אקראיים בתורת הגלים: מונחי יסוד. פיזור מסריגים.',
                    n: 0.108,
                },
            },
        },
        {
            i: 298,
            $: {
                '0': { v: '046249', n: 1 },
                '1': { v: 'מערכות אלקטרו-אופטיות', n: 0.707 },
                '2': {
                    v: "אלקטרו-אופטיקה בפורמליזם של מערכות. התמרת פורייה אופטית ודימות. הולוגרפיה וסינון מרחבי. קיטוב. תיאוריית הקוהרנטיות. מערכות משולבות דיגיטליות-אופטיות. שיטות ומערכות למדידות אופטיות, כגון אינטרפרומטריה, אינטרפרומטריה הולוגרפית, מד טווח, לייזר-ג'רוסקופ ומד מהירות לייזר-דופלר.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. לדעת לנתח התפשטות אור במרחב חופשי וברכיבים אופטיים תחת הקירוב הפראקסיאלי. 2. להכיר מודלים לתיאור קיטוב של אור ורכיבים בסיסיים המבוססים על קיטוב. 3. להכיר מערכות אינטרפרומטריות וידעו לנתחן במקרה של קוהרנטיות חלקית.",
                    n: 0.119,
                },
            },
        },
        {
            i: 299,
            $: {
                '0': { v: '046256', n: 1 },
                '1': { v: 'אנטנות וקרינה', n: 0.707 },
                '2': {
                    v: 'קרינה ממקורות מאולצים, מושגי יסוד: עקום קרינה, רשת אקויולנטית, הגבר, חתך אפקטיבי, אימפדנס עצמי והדדי, הפסדי נתיב, טמפרטורת רחש, הדדיות. אנטנות קליטה. מערכים סופיים ואינסופיים. עיבוד אותות בקליטה ע"י מערך אנטנות. אנטנות מפתח. אנטנות רחבות סרט. שיטות מדידה. שיטות נומריות באנליזה ותכנון.',
                    n: 0.154,
                },
            },
        },
        {
            i: 300,
            $: {
                '0': { v: '046265', n: 1 },
                '1': { v: 'ארכיטק. ומעגלים בשילוב ממריסטורים', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בהשפעה של טכנולוגיות חדישות על מערכות וארכיטקטורות. במהלך הקורס יידונו ממריסטורים - רכיבי זיכרון חדישים - בשלל רבדים כולל רמת הרכיב הבודד, התאוריה שמאחורי ממריסטורים והשימוש בממריסטורים כזכרונות לא נדיפים. כמו כן יתוארו השימושים בממריסטורים ביישומים ייחודיים כגון מעגלים לוגיים, רשתות נוירונים ומעגלים אנלוגיים וייסקרו ההשלכות של שימוש בממריסטורים על ארכיטקטורת מחשבים, כולל ארכיטקטורות במכונות שאינן מכונת פון-נוימן בנוסף יילמדו המשמעויות של שימוש בממריסטורים בתחומים מגוונים כגון תורת הקידוד ואבטחה. תוצאות למידה: 1. יכולת ניתוח ההשפעה של טכנולוגיה על מערכת. 2. הבנת פעולת הממריסטורים בתאוריה ובמעשה ויכולת מעשית לפתח מודלים שונים. 3. כלים מעשיים לתכנון מעגלים המשולבים בממריסטור. 4. הכרות עם המשמעויות הארכיטקטוניות של שילוב ממריסטורים במחשבים. 5. הכרות עם מגוון נושאי המחקר בתחומים',
                    n: 0.093,
                },
            },
        },
        {
            i: 301,
            $: {
                '0': { v: '046267', n: 1 },
                '1': { v: 'מבנה מחשבים', n: 0.707 },
                '2': {
                    v: 'מדדי ביצועים והקשר בינם לבין ארכיטקטורות, שיטות למדידת ביצועים. זיכרון היררכי, זיכרון וירטואלי, ארגון הזיכרון הראשי. ארגון ובקרת המעבד למיקבול ביצוע תוכניות: צתינור, OUT OF ORDER EECUTION, חיזוי קפיצות וביצוע ספקולטיבי של פקודות, פריסת לולאות וצינור בתוכנה, MULTI-THREADING, VLIW, SUPERSCALAR, ריבוי ליבות. קלט/פלט: מערכת האיחסון, תקשורת ופסיקות. התפר חומרה - מערכת הפעלה. תוצאות למידה: בסיום הקורס הסטודנט ידע: 1. להכיר את יחידות המחשב ושיטות לתיכנון. 2. להכיר מדדים לביצוע מחשב והבנת משמעותם. 3. דגש מיוחד מושם על פיתוח חשיבה ביקורתית ויכולת ניתוח וחשיבה מערכתית. 4. להבין את הקשרים וההשפעות ההדדיות.',
                    n: 0.105,
                },
            },
        },
        {
            i: 302,
            $: {
                '0': { v: '046273', n: 1 },
                '1': { v: 'תכנות פונקציונאלי מבוזר', n: 0.577 },
                '2': {
                    v: 'נושאים: יסודות התכנות הפונקציונאלי וטכניקות בסיסיות בחישוב מבוזר, שפת ארלנג ERLANG))- שפת תכנות פונקציונאלית עם תמיכה מובנית בתכנות מערכות מבוזרות. עקרונות התכנות הפונקציונאלי ותחשיב למדה- פונקציות, רקורסיה, שערוך עצל. טיפוסים דינמיים. מודל CSP לתכניות מבוזרות. ניתוח נכונות תוכנה. מודל- שרת לקוח. שמירת מידע קבוע PERSISTENT)). עמידה בנפילות וטכניקות שכפול. מודלים נוספים לתכנות מבוזר: MAP-REDUCE, ממשק MPI להעברת הודעות וסנכרון עם מחסומים BARRIERS)), חישובי STREAMING .',
                    n: 0.124,
                },
            },
        },
        {
            i: 303,
            $: {
                '0': { v: '046277', n: 1 },
                '1': { v: 'הבטחת נכונות של תוכנה', n: 0.5 },
                '2': {
                    v: 'הקורס יציג שיטות באימות וניתוח של תוכנה וסינתזה של תוכנה: ניתוח סטטי, ניתוח זרימת מידע, ניתוח זרימת בקרה, סמנטיקה ביצועית, פירוש מופשט ותחומים נומריים, פותרי SAT/SMT, הרצה סימבולית, סינתזה של תוכנה, סינתזה מנייתית, תכנות ע"י דוגמאות, סינתזה מונחית דוגמאות נגדיות, קוד גדול.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להסביר שיטות שונות להבטחת נכונות של תוכנה.\n2. להבין איך להשתמש בשיטות אלו עבור מערכות תוכנה מעשיות.\n3. להבין את היתרונות המעשיים והמגבלות של השיטות השונות.',
                    n: 0.118,
                },
            },
        },
        {
            i: 304,
            $: {
                '0': { v: '046280', n: 1 },
                '1': { v: 'עקרונות וכלים באבטחת מחשבים', n: 0.5 },
                '2': {
                    v: 'אבטחה הינה דרישה בסיסית בתכן מערכות מחשב מודרניות, החל משרתים, דרך מכשירים ניידים, כלי רכב, וכלה בהתקני IOT. קורס זה מספק כלים בסיסיים לתכן וניתוח אבטחה של מערכות מחשב. הנושאים כוללים: עקרונות (מדיניות, איומים, פגיעויות), כלים קריפטוגרפיים (הגדרות, מפתח סמטרי וציבורי, מערכות קריפטוגרפיות, מנגנון דיפי-הלמן, פונקציות גיבוב), אימות (אדם ומכונה), הרשאה, פרטיות (אנונימיות, DIFFERENTIAL PRIVACY, במרשתת), אבטחה עם תורת המשחקים (בלוקצ\'יין, הוכחת עבודה, הוכחת השקעה), אבטחת חומרה (סביבות ריצה אמינות, SGX, TRUSTZONE), בעיית ה CONFINEMENT, זרימת מידע, התקפות ערוצי צד ופתרונות (תזמון מטמון, ערוץ כוח, ריצה ספקולטיבית, ROWHAMMER ).\nתוצאות למידה: בוגר הקורס ירכוש את המיומנויות הבאות: 1. ניתוח אבטחה של מערכת מחשב במגוון פרספקטיבות (פגיעויות, אימות, כלים קריפטוגרפיים וכיו"ב) 2. תכן מערכות בטוחות בצורה מובנית (בחירת מודל איום מתאים, מדיניות וכלים)',
                    n: 0.091,
                },
            },
        },
        {
            i: 305,
            $: {
                '0': { v: '046326', n: 1 },
                '1': { v: 'מבוא לאותות ומערכות ביולוגיים', n: 0.5 },
                '2': {
                    v: "הקורס מתמקד בפיתוח גישה מערכתית ומתמטית לתא-עצב כאב-טיפוס למערכות ביולוגיות. מבחינה מתמטית יודגשו שני נושאים מרכזיים: מערכות דינמיות לא-לינאריות ותהליכים אקראיים בזמן רציף, שני נושאים בעלי חשיבות רבה לניתוח מערכות ביולוגיות באשר הן. נושאי הלימוד הם: מבוא לביופיסיקה של תאי עצב ושלוחותיהם וניתוח כמערכות כניסה-יציאה במובן ההנדסי. התא העצבי: מושגי יסוד על מבנה קרום התא ותכונותיו החשמליות והכימיות - אלקטרודיפוסיה ומתח המנוחה של התא. התפשטות אותות בסיבים פסיביים וצימוד בין תאים דרך סינפסות כימיות. מודל הודג'קין-האקסלי לעירור של תא חשמלי, ופישוטים המאפשרים ניתוח מתמטי מפורט של התנהגות תאי-עצב מעוררים. אלמנטים אקראיים בתאי-עצב.",
                    n: 0.104,
                },
            },
        },
        {
            i: 306,
            $: {
                '0': { v: '046332', n: 1 },
                '1': { v: 'מערכות ראיה ושמיעה', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד על הבסיס הפיסיקלי והפיסיולוגי של תקשורת במערכות ראיה ושמיעה: מבנה ואופן פעולת העין והאוזן. מנגנונים פיסיולוגיים המשמשים לקידוד, לעיבוד והעברת אותות במערכת הראיה. ניתוח הרמוני של אותות דינמיים. בקרת הגבר אוטומטית ברשתית. ייצוג אותות במרחב משולב תדר-מקום. התכונות הססטיסטיות של האותות וחוקי סף פסיכופיסיים. מודלים של עיבוד אותות במערכת הראיה. מבנה תמונות והיבטים טכנולוגיים (ראיה ממוחשבת).',
                    n: 0.131,
                },
            },
        },
        {
            i: 307,
            $: {
                '0': { v: '046733', n: 1 },
                '1': { v: 'תורת האינפורמציה', n: 0.707 },
                '2': {
                    v: 'אפיון מקורות וערוצים. צפינת מקורות. הגדרת האינפורמציה ההדדית. משפט עבוד הנתונים. שיטת הסדרות הטיפוסיות. פונקצית קצב-עוות ושמושים למקורות אנלוגיים ודיסקרטיים. קצב האינפורמציה וקבול הערוץ. משפט הצפינה. צפינה משולבת מקור-ערוץ ומשפט ההפרדה.',
                    n: 0.18,
                },
            },
        },
        {
            i: 308,
            $: {
                '0': { v: '046734', n: 1 },
                '1': { v: 'תורת האינפורמציה לתקשורת קוונטית', n: 0.5 },
                '2': {
                    v: 'מבוא לתורת האינפורמציה הקוונטית ותקשורת דרך ערוץ קוונטי: קיבול קלאסי של ערוץ קוונטי, קיבול קוונטי, ותקשורת עם משאבי שזירות. רקע לתורת האינפורמציה הקלאסית ותורת האינפורמציה הקוונטית. אקסיומות מכניקת הקוונטים. מערכות קוונטיות מבודדות ללא רעש ומערכות קוונטיות רועשות. התאור הפיזיקלי של ערוץ קוונטי וההגדרה המתמטית. פרוטוקולים בסיסיים של תקשורת קוונטית ואי שוויונים בין משאבים. מדדי אינפורמציה ואנטרופיה קלאסיים וקוונטיים. המשמעות של אנטרופיה מותנית קוונטית ומדוע היא יכולה להיות שלילית. שיטת הטיפוסים הקוונטית ודחיסת שומאכר. קיבול ערוץ קוונטי בשידור של מידע קלאסי (ביטים). משפט הקיבול עבור ערוץ קלאסי-קוונטי. בעיית הרגולריזציה והסופר-אדיטיביות של אינפורמציית חולבו. קידוד של מידע קוונטי (קיוביטים). הקיבול הקוונטי וסופר-אקטיבציה. תקשורת בסיוע משאבי שזירות. תוצאות למידה: עם סיום הקורס הסטודנטיות והסטודננטים יהיו מסוגלים:\n1. להבין את העקרונות שבבסיס תורת שנון הקוונטית, התיאור האינפורמציוני של בעיות תקשורת, והפרוטוקולים הבסיסיים להמרת משאבים קוונטיים, יעריכו את ההבדלים הממשמעותיים שבין מערכות תקשורת קלאסיות לקוונטיות והאתגרים הנובעים מהם ויפתחו אינטואיציה להבנת התנהגויות אלו.\n2. יכירו את משפטי הקיבול המרכזיים בתורת האינפורמציה הקוונטית וישלטו בשיטות אנלטיות חשובות בתחום.',
                    n: 0.079,
                },
            },
        },
        {
            i: 309,
            $: {
                '0': { v: '046745', n: 1 },
                '1': { v: 'עבוד ספרתי של אותות', n: 0.5 },
                '2': {
                    v: 'השפעת אורך מלה סופי במסננים ספרתיים. שערוך לא פרמטרי של ספקטורום הספק- פריודוגרמות. עיבוד רב-קצבים: מערכות דצימציה ואינטרפולציה, מימוש פוליפאזה ומערכות מרובות דרגות. מערכי מסננים דו-ערוציים, מערכים במבנה עץ, מערכים אחידים. התמרת פוריה לזמן קצר אנליזה וסינתזה, ייצוג GABOR. מבוא ל-WAVELETS : אנליזת זמן-תדר, אנליזה מרובת רזולוציות. תוצאות למידה: בסיום הקורס הסטודנט ידע: 1. קוונטיזציה ומודל לרעש קוונטזיציה. 2. שגיאות חשיוב (נקודה קבועה ונקודה צפה) במסננים ספרתיים. 3. מניעת גלישה והבטחת יציבות במסננים ספרתיים. 4. שיערוך לא פרמטרי של ספקטרום הספק - פריודוגרמות. 5. מערכות דצימציה ואינטרפולציה, מימוש פוליפאזה, מימוש מרובה דרגות. 6. מערכי מסננים דו ערוציים - BILINEAR, CQF, QMF, מערכני מסננים במבנה עץ. 7. מערכי מסננים אחידים. 8. התמרת פוריה לזמן קצר, אנליזה וסינתיזה התמרת GABOR. 9. אנליזת WAVELET , אנליזה מרובת רזולוציות.',
                    n: 0.089,
                },
            },
        },
        {
            i: 310,
            $: {
                '0': { v: '046746', n: 1 },
                '1': { v: "אלג' ויישומים בראייה ממוחשבת", n: 0.5 },
                '2': {
                    v: 'בעיות בסיסיות בראייה ממוחשבת, אלגוריתמים המותאמים לפתרון בעיות אלו ויישומים מעשיים של הגישות לפתרון._\nשימוש ברשתות עמוקות להבנת תמונות. שיטות לתיכנון, בניה, אימון והבנה של רשתות. זיהוי אובקיטים, סגמנטציה של תמונה. מודלים גנרטיבים ליצירת תמונות. התאמת תמונות שצולמו מנקודות מבט שונות. גאומטריה של מצלמות, חישוב תנועה, סטריאו ושחזור תלת מימד. עקיבה אחרי תנועה._\nתוצאות למידה בסיום הקורס הסטודנטיות והסטודנטים ירכשו את הכלים הבאים:\n1) הבנת גיאומטריה של מצלמות.\n2) הבנת אלגוריתמים ללמידת תמונות. 3. היכרות עם אלגוריתמים מתקדמים בתחומי הראיה הממוחשבת 4) התנסות מעשית בספריות תוכנה בתחומי הראיה הממוחשבת.',
                    n: 0.108,
                },
            },
        },
        {
            i: 311,
            $: {
                '0': { v: '046773', n: 1 },
                '1': { v: 'התקני מל"מ אלקטרואופטיים לגלוי', n: 0.5 },
                '2': {
                    v: 'מקורות קרינה: קרינת גוף שחור, קרינה ספונטנית ומאולצת. גלאים אלקטרו-אופטיים: בליעת קרינה, גלאים לקרינה, מדד לביצועי גלאי קרינה (יחס אות-רעש), גלאי פוטומוליך, גלאי פוטו-וולטאי, פוטו-דיודה דיודה PIN, תאי שמש, פוטוטרנזיסטור, תגובתיות ( RESPONSIVITY ), סף קליטה ( DETECTIVITY ) והתגובה בזמן של גלאי. דוגמאות של גלאים לתחום הנראה ותחום האינפרה-אדום: SI, INSB וכן HGCDTE, מערכי דיודות צמת ו-CCD. גלאים תרמיים: צמד תרמי, מערכי צמדים ( THERMOPILE ), גלאים פירו-אלקטריים. מעגלי עיבוד אות למערכי גלאים.',
                    n: 0.116,
                },
            },
        },
        {
            i: 312,
            $: {
                '0': { v: '046853', n: 1 },
                '1': { v: 'ארכיטקטורות מחשבים מתקדמות', n: 0.577 },
                '2': {
                    v: 'תכנון ארכיטקטורות מחשבים בסביבה מרובת מעבדים ובסביבת ארכיטקטורות מאיצים ללמידת מכונה (MACHINE LEARNING) תוך שימוש בשיטות איכותיות וכמותיות תוך אילוצי הספק ואנרגיה. הגדרת מגמות טכנולוגיות וטכניקות עתידיות במבנה המערכת. מערכות חישוב אסימטריות, ארכיטקטורות מתקדמות של מאיצים במערכות לומדות עם דגשים על DEEP NEURAL NETWORKS. הבנה של הדרישות הבסיסיות של מערכות לומדות וניצולן לתכנון ארכיטקטוני יעיל אנרגטית. מטרת הקורס הינה לספק את בסיס הידע והגישה הארכיטקטונית שיאפשרו לסטודנט חשיבה ויישום ארכיטקטורני של מערכות חישוב עתידיות.',
                    n: 0.116,
                },
            },
        },
        {
            i: 313,
            $: {
                '0': { v: '046880', n: 1 },
                '1': { v: 'תכן לוגי ממוחשב של שבבים', n: 0.447 },
                '2': {
                    v: 'ייצוגים של מערכות VLSI. מתודולוגיות של תכן. כלי תכן לסוגיהם. מודלים מבניים והתנהגותיים. שפות ומבני נתונים לתיאור חמרה. אימות סטטי ודינמי. סימולטורים לרמות ייצוג שונות. שיטות לאימות פורמלי, שימוש ב-BDD. סינתזה לוגית אוטומטית. ניתוח סטטי של השהיות ומסלולים. סינתזה להשגת יעדי תזמון. תוצאות למידה: בתום הקורס הסטודנט ידע 1. לתאר את תהליך הסינתזה של מערכת VLSI ואת האלגוריתמים בהם משתמשים במגוון סוגים של כלים לתכן אוטומטי בעזרת מחשב. 2. להשתמש בייצוגי מערכת, אלגוריתמים ומבני נתונים במטלות תכנות. 3. ירכוש תובנות ויפתח יכולת להבין ספרות מקצועית בתחום.',
                    n: 0.108,
                },
            },
        },
        {
            i: 314,
            $: {
                '0': { v: '047003', n: 1 },
                '1': { v: 'נושאים מתקדמים 4', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס היא חשיפת סטודנטים לתחום מחקרי מתקדם שאינו מכוסה על ידי חברי הסגל בפקולטה. הוא יוצע בדרך כלל בחודשי הקיץ ויינתן על ידי מומחה אורח. יתכן שהקורס יהיה מרוכז ויכלול 14 שעות הרצאה ברצף של שבוע. נושא הקורס ומועדו יפורסם מעת לעת, בהתאם לצורך ולזמינות המרצה המתאים',
                    n: 0.144,
                },
            },
        },
        {
            i: 315,
            $: {
                '0': { v: '048000', n: 1 },
                '1': { v: 'צילום חישובי', n: 0.707 },
                '2': {
                    v: 'צילום חישובי הוא תחום מחקר חדש ומתפתח בתפר בין גרפיקה ממוחשבת, ראיה ממוחשבת ואופטיקה. מטרתו להתגבר על מגבלות של מערכות צילום סטנדרטיות בעזרת חישוב ולאפשר לנו לצלם או למדוד אינפורמציה טובה יותר ועשירה יותר על העולם. האפליקציות באות לידי ביטוי בצילום יומיומי וגם בכל תחומי המחקר, מאסטרונומיה למיקרוסקופיה וצילום רפואי. נושאי הלימוד: הצגה של מערכות צילום, אופטיקה בסיסית, עומק שדה וטשטוש, הסרת טשטוש כתוצאה מהתנועה או מדיפוקוס, מצלמות חישוביות, צילום מכווץ, שדות אור, סדרות תמונות והרחבת טווח דינמי, תאורה חישובית, מעבר אור בסצנה, זמן תעופה. תוצאות למידה: הכרות עם הבסיס ועם תוצאות מחקרית עדכניות בתחום הצילום החישובי.',
                    n: 0.102,
                },
            },
        },
        {
            i: 316,
            $: {
                '0': { v: '048080', n: 1 },
                '1': { v: 'נ.נ. במערכות מחשבים: ארכ. תוכנה', n: 0.447 },
                '2': {
                    v: 'בקורס נתמקד בנושאים עכשוויים של מערכות מחשב בדגש על אנטרקציה בין חומרה לתוכנה, כגון ארכיטקטורות מערכות בטוחות, מערכות הפעלה מודרניות, תוכנה וחומרה למאיצים חישוביים ומאיצי קלט/פלט ועוד. הקורס יתבסס על המאמרים החשובים ביותר בתחום, וכן עבודות עכשוויות. __א תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יכירו:\n1. נושאים ושיוטות מחקר במערכות מחשבים.\n2. עקרונות של חומרה בטוחה ומערכות הפעלה מתקדמות.',
                    n: 0.132,
                },
            },
        },
        {
            i: 317,
            $: {
                '0': { v: '048150', n: 1 },
                '1': { v: 'הסתברות בממד גבוה למדע הנתונים', n: 0.447 },
                '2': {
                    v: 'תחומים מדעיים ויישומיים רבים הרחיבו לאחרונה את מעטפת היכולות שלהם הודות לאיסוף נתונים נרחב. המתדולוגיה של הסתברות בממד גבוה וניתוח לא אסימפטוטי מאפשרת הבנה יסודית של האפשרויות למיצוי מידע זה, וכוח מניע לשיפור ביצועים. הקורס יציג את העקרונות והכלים של תיאוריה זאת, וידגים את יישומיהם במגוון בעיות הסקה ולמידה סטטיסטית. 1. מבוא להסתברות בממד גבוה וסטטיסטיקה לא-אסימפטוטית.__\n2. משתנים אקראיים תת-גאוסיים ואי-שיויון HOEFFDING. משתנים תת-מעריכיים. ואי-שיוויון BERNSTEIN. מרחבי ORLICZ של משתנים אקראיים. יישומים בבעיות שערוך וסיווג.\n3. אי-שיוויונות מקסימליים, רשתות וחסמים על מספרי כיסוי ואריזה. יישומים בבעיות רגרסיה לינארית כללית ובבעיות עם תנאי דלילות._\n4. ביצועי מינימקס בהסקה סטטיסיטית: תכונות בסיסיות ותכונות טנזוריזציה של מדדי שונות-אינפורמציונית. שיטת שתי ההשערות של LE-CAM והרחבה למספר השערות בשיטת FANO. 5. אי-שיויוני ריכוז של סכום מטריצות בלתי-תלויות ואי-שיוויון BERNSTEIN מטריצי. ריכוז של אופרטורים של מטריצות אקראיות ומשפט DAVIS-KAHAN. יישומים בבעיות של שערוך מטריצה, ביטול-רעש, זיהוי קהילות ברשתות, וניתוח רכיבים עיקריים (PCA)._\n6. תהליכים אקראיים גאוסיים, ואי-שיויוני השוואה של SLEPIAN, SUDAKOV-FERNIQUE. מינורציה של SUDAKUV._\n7. סימטריזציה וביטול-צימוד. שיטת השרשור של DUDLEY. חוק מספרים גדולים במידה-שווה. קשרים בין מספרי כיסוי לממד VAPNIK-CHERVONENKIS . הלמה של SAUER-SHELAH והלמה של DUDLEYץ חסמי הכללה בבעיות של למידה סטטיסטית. תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יוכלו לנסח להככליל ולעדן מודלים מתמטיים לתרחישי ניתוח נתונים, סטטיסטיקה במדד גבוה ולמידה סטטיסטית, להפעיל כלים של הסתברות בממד גבוה לניתוח שלהם ולתרום לחזית המחקר המדעי . יכירו את המאפיינים הייחודיי של גדלים אקראיים .',
                    n: 0.067,
                },
            },
        },
        {
            i: 318,
            $: {
                '0': { v: '048712', n: 1 },
                '1': { v: 'מעבדה באלקטרואופטיקה 2', n: 0.577 },
                '2': {
                    v: 'הקורס כולל לימוד עצמי (קריאה מודרכת) של עקרונות פעולת הלייזר. מבנה הלייזר ותכונותיו וביצוע פרוייקט מעבדתי באחד או יותר מן הנושאים הבאים: עיבוד אותות בשיטות אופטיות, צילום הולוגרפי, מדידות בעזרת לייזרים, בנייה של מערכות אלקטרואופטיות, חקר תכונות של לייזרים, תקשורת אופטית, אופטיקה לא לינארית, שיטות בדיקה ללא הרס.',
                    n: 0.144,
                },
            },
        },
        {
            i: 319,
            $: {
                '0': { v: '048721', n: 1 },
                '1': { v: 'נושאים מתקדמים בלמידת מכונה 2', n: 0.447 },
                '2': {
                    v: 'קורס מתקדם שיעסוק בנושאים שונים בלמידת מכונה, בתחום עיסוקו של המרצה. סילבוס מפורט ותוצרי למידה יפורסמו לפני תחילת כל סמסטר בו ינתן הקורס. בו יינתן הקורס. הקורס ישמש גם כבסיס למשתלמים המעוניינים לבצע עבודת מגיסטר או דוקטורט בתחום.',
                    n: 0.162,
                },
            },
        },
        {
            i: 320,
            $: {
                '0': { v: '048722', n: 1 },
                '1': { v: 'נ.נ. בלמידה: אופטימיזציה לבעיות', n: 0.5 },
                '2': {
                    v: 'כלים ושיטות מתקדמות לאופטימיזציה תופסים מקום מרכזי בתחום של למידה ובעיות עם נתוני עתק. רעיונות וכלים מתקדמים באופטימיזציה ונדגים את הקשר החזק בינם לבין בעיות בלמידה וסטטיסטיקה._\nתוצאות למידה: בסיום ה קורס, הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להכיר שיטות וכלים מתקדמים לאופטימיזציה ויהיו מסוגלים לקרוא ולהבין מאמרים בתחום._\n2. להשתמש בכלים שילמדו לפתרון בעיות ולבניית שיטות למידה חדשות.',
                    n: 0.135,
                },
            },
        },
        {
            i: 321,
            $: {
                '0': { v: '048723', n: 1 },
                '1': { v: 'נ.נ. בלמידה עמוקה: אותות דיבור', n: 0.447 },
                '2': {
                    v: 'מטרת הקורס לאפשר לסטודנטים להבין ולתכנן מערכות לומדות לתחום הדיבור, להבין איך הדיבור מיוצג במערכות האלו וכיצד הן עובדות. נתרכז בזיהוי אוטומטי של ויצירת דיבור. נסביר כיצד עובדות מערכות זיהוי הדיבור הטובות ביותר כיום ומהי חזית המחקר בתחום. כמו כן נציג כיצד מייצרים דיבור סינטטי באיכות אנושית, ומהי חזית המחקר בתחום זה.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להבין כיצד נוצר דיבור ומהם המרכיבים האקוסטיים של דיבור.\n2. להבין כיצד מיוצג הדיבור במערכות מבוססות רשתות עמוקות.\n3. להכיר את המודלים ושיטות אימון המקובלות במערכות לזיהוי דיבור אוטומטית._\n4. להכיר את המודלים ושיטות אימון המקובלות במערכות ליצירת דיבור סינטטית.___',
                    n: 0.102,
                },
            },
        },
        {
            i: 322,
            $: {
                '0': { v: '048747', n: 1 },
                '1': { v: 'מעבדה באותות ומערכות ביולוגיים', n: 0.5 },
                '2': {
                    v: 'אנליזה של מערכות פיסיולוגיות. פיתוח שיטות לזיהוי תבניות אותות למטרות אבחון מחלות (EEG, ECG, EMG, ERG אותות תנועת העין). תכנון ובנית מכשור הדרוש במחקר פיסיולוגי וקליני. מדידות פרמטרים ביולוגיים ואנליזה של חשיבותם במערכות ביולוגיות. פיתוח מודלים של מערכות ביולוגיות ובחינתם ע"י דימוי ספרתי ואנלוגי.',
                    n: 0.151,
                },
            },
        },
        {
            i: 323,
            $: {
                '0': { v: '048816', n: 1 },
                '1': { v: 'מעבדה לעבוד אותות', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לבצע פרויקטים בתחום של עיבוד אותות לאחר לימוד מקצוע הקדם ומקצועות אחרים (בלימודי הסמכה/מוסמכים) אשר יקבעו על-פי הנושאים שיוצעו. הפרויקטים יהיו הן בתחום של חמרה ( HARDWARE ) מיוחדת לעיבוד אותות (מימוש ספרתי, אנלוגי או היברדי) והן בתחום של חקר אלגוריתמים ותכנה לעיבוד אותות באמצעות מערכות המחשבים שבמעבדה. המעבדה מהווה בדרך כלל שלב ראשון בגבוש נושא מחקר בתחום.',
                    n: 0.127,
                },
            },
        },
        {
            i: 324,
            $: {
                '0': { v: '048828', n: 1 },
                '1': { v: 'עיבוד וניתוח אותות מרחביים', n: 0.5 },
                '2': {
                    v: 'עיבוד מרחבי של אותות במערכי גלאים בתחום הזמן ובתחום התדר, תת-מרחבים של האות ושל הרעש, מעצבי אלומה אופטימליים, מדדי טיב של מערכים, קיפולים מרחביים, כיווניות מרחבית, MVDR, LCMV, GSC, שערוך כיוון ההגעה ושערוך הפרש זמני הגעה, עיצוב אלומה מסתגל, עיצוב אלומה דיפרנציאלי, תכן של תבנית האלומה.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. ליישם אלגוריתמים לעיבוד מרחבי של אותות בתחום הזמן ובתחום התדר. 2. לתכנן וליישם מעצב אלומה אופטימאלי לסינון מרחבי במערכי גלאים.\nהרכב הציון: 30 אחוז הרצאה סמינריונית 70 אחוז פרויקט סיום',
                    n: 0.11,
                },
            },
        },
        {
            i: 325,
            $: {
                '0': { v: '048836', n: 1 },
                '1': { v: 'מעבדה במעגלים מהירים', n: 0.577 },
                '2': {
                    v: 'מעבדת HFIC מתמקדת במחקר במעגלים משולבים עבור יישומים כמו הדמיה תקשורת וחישה. המעבדה מספקת סביבת מחקר לסטודנטים לתארים מתקדמים עבור מערכות תקשורת אלחוטיות וקוויות עתידיות מבוססים על מעגלים משלובים בטכנולוגית CMOS . תחומי עניין כגון: מעגלי רדיו וגמ"מ , אלגוריתמיים למעגלים מעורבים וארכיטקטורות של מערכות רדיו. המעבדה מצוידת בתחנת בדיקה מודרנית המאפשרת מדידות של שבבים ואפיון מלא עד תדר של 110 גיגה הרץ. תוצאות למידה: בתום קורס מעבדת HFIC הסטודנט יכיר את סביבת המחקר עבור מערכות תקשורת אלחוטיות וקוויות עתידיות. הסטודנט יכיר תחומי עניין: מעגלי רדיו וגמ"מ אלגריתמים למעגלים מעורבים וארטיקטורות של מערכות רדיו.',
                    n: 0.103,
                },
            },
        },
        {
            i: 326,
            $: {
                '0': { v: '048848', n: 1 },
                '1': { v: 'נושאים מתקדמים באלקטרו-אופטיקה 1', n: 0.5 },
                '2': {
                    v: 'קורס מתקדם באלקטרואופטיקה העוסק בנושאי מחקר מתחום מחקרו של המרצה.',
                    n: 0.316,
                },
            },
        },
        {
            i: 327,
            $: {
                '0': { v: '048852', n: 1 },
                '1': { v: 'מעבדה בהמרת אנרגיה', n: 0.577 },
                '2': {
                    v: 'חקר פעולת מקורות אנרגיה חדשים. בדיקת שדות מגנטיים וכוחות משיכה ודחיה הנוצרים על ידי מגנטים תמידיים. חקר ומפוי שדות מגנטיים. מדידות מיקרופרוססוריות במערכות הספק. הגנות מיקרופרוססוריות בקרים ובקרה על תהליכים. בקרת מנועי זרם ישר וזרם חלופין באמצעות מישרים מווסתים. דמוי ספרתי של מערכות אלקטרומכניות.',
                    n: 0.151,
                },
            },
        },
        {
            i: 328,
            $: {
                '0': { v: '048870', n: 1 },
                '1': { v: 'פיתוח נושאים בהנדסת חשמל 1', n: 0.447 },
                '2': {
                    v: 'דרישות קדם: אישור המנחה ומרכז המקצוע. במסגרת המקצוע יפותחו נושאים מתקדמים בכל אחד מהשטחים המתפתחים והחדשניים של הפקולטה בהנחיתו האישית של חבר סגל. סטודנט במסלול מחקרי יוכל ללמוד את הקורס לכל היותר פעם אחת. סטודנט במסלול ללא תזה יוכל לקחת את הקורס יותר מפעם אחת ובלבד שיהיה מדובר בחברי סגל שונים.',
                    n: 0.14,
                },
            },
        },
        {
            i: 329,
            $: {
                '0': { v: '048877', n: 1 },
                '1': { v: 'מעבדה לתכנה וחומרה', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לבצע פרוייקטים בתחום של מחשבים לאחר לימוד מקצועות הקדם ומקצועות אחרים (בלימודי הסמכה/מוסמכים) אשר יקבעו על פי הנושאים שיוצעו. הפרוייקטים יהיו הן בתחום של מערכות חמרה ( HARDWARE ) ו/או מערכות תכנה.',
                    n: 0.167,
                },
            },
        },
        {
            i: 330,
            $: {
                '0': { v: '048891', n: 1 },
                '1': { v: 'מערכות חומרה - מתיאורה להתנסות', n: 0.447 },
                '2': {
                    v: 'בשנים באחרונות , עם חדירת השימוש במחשב לכל תחומי חיינו (גם ללא רצוננו) הופך נושא הבטחת המערכות לנושא חשוב הן מהבחינה המחקרית והן מהבחינה היישומית. הקורס המוצע נועד ללמד ולחקור היבטים שונים של אבטחת מערכות באמצעות חומרה ייחודית החל מהאספקטים התאורטיים שלהם וכלה בהתנסות שיטות הגנה והתקפה שונות. דגש מיוחד יינתן בקורס על שימוש של התקפות מסוג ערוצי צד ועל שילוב של טכניקות הלקוחות מעולם הלמידה העמוקה לצורך הנדסה לאחור. לצורך לימוד הנושא, נשתמש בערכות התנסות ייחודיות אשר יאפשרו לסטודנטים לבחון שיטות התקפה והגנה שונות ומתקדמות באופן מעשי. התנסות ייחודיות אשר יאפשרו לסטודנטים לבחון את שיטות התקפה והגנה שונות ומתקדמות באופן מעשי.מטרת הקורס להסביר את הצדדים התיאורטיים והמעשיים של טכניקות התקפה והגנה מתקדמות. הקורס יעמיק גם באמצעים עדכניים של הגנת מערכות מחשוב באופן שגורמים לא מורשים לא יוכלו, או יקשה מאד עליהם, לשלוף מידע או להשפיע על התנהגות המערכת. תוצאות למידה:\nבסיום הקורס יבינו הסטודנטים את הסכנות והאפשרויות לגנבת סודות ממערכות אשר אינן מוגנות היטב, מה הם אמצעו החומרה הקיימים אשר נועדו לעזור במיגון מערכות מחשב, כיצד לנצל אותם באופן המיטבי. הקורס יאפשר לסטודנטים לתרגל באופן מעשי שיטות התקפה מסוג "שימוש בערוצי צד" ולהיחשף לנושאי מחקר עדכניים הנמצאים בחזית המחקר בתחום ובכך לעודד משתלמים לחקור את התחום במסגרת עבודת מגיסטר או דוקטור.',
                    n: 0.071,
                },
            },
        },
        {
            i: 331,
            $: {
                '0': { v: '048892', n: 1 },
                '1': { v: 'אתגרים אלגוריתמים בבלוקציין', n: 0.577 },
                '2': {
                    v: 'תכנון וניתוח אלגוריתמים לרשתות בלוקציין. עקרונות רשתות בלוקציין, הוגנות, שבירות וערוצים משניים. נתמקד בכלים מתורת הגרפים כגון: זרימה וניתוב, צביעה, קיבוץ ותכנון טופולוגיות. מבני נתונים ושיטת קידוד. הקורס יועבר במתכונת משולבת של הרצאות וברובו כסמינר. סטודנטים וסטודנטיות יתבקשו להגיש פרויקטון גמר._\nעם השלמת הסמינר בהצלחה, לסטודנטים ולסטודנטיות תהיה הכרות עם מגוון בעיות מרכזיות בתחום רשתות הבלוקציין וכן כלים לתכנון אלגוריתמים להתמודדות איתן. הסטודנטים והסטודנטיות יהיו מסוגלים לנתח ולהבין את היתרונות והחסרונות של גישה מסוימת. יחשפו לאבני בנין שיכולות לשמש בעתיד למענה לאתגרים חדשים.',
                    n: 0.11,
                },
            },
        },
        {
            i: 332,
            $: {
                '0': { v: '048907', n: 1 },
                '1': { v: 'אופטיקה בתווכים מפזרים ויישומיה', n: 0.5 },
                '2': {
                    v: 'יסודות פיסיקליים של התפשטות אור ברקמה וסקירת שיטות עדכניות אשר מאפשרות דימות אופטי בסקלות עומק שונות. הדגש יינתן בעיקר על שיטות דימות טומוגרפיות בסקלות עומק בהן האור דיפוסיבי לחלוטין. יישומים עדכניים בעיקר בתחומי הביולוגיה והרפואה. פיזור אור מחלקיקים קטנים. התקדמות אור ברקמה: מודלים וכלי סימולציה. שיטות בליסטיות לדימות אופטי. שיטות דיפוסיביות לדימות אופטי. שיטות משולבות לדימות אופטי. תוצאות למידה: בסיום הקורס הסטודנט: 1. ידע את העקרונות הפיסיקלים של התפשטות אור ברקמה. 2. יכיר מודלים אנליטיים ונומריים הנפוצים בתחום. 3. ידע לנתח את היתרונות והחסרונות של שיטות דימות שונות ויוכל להסביר את מקור ההבדלים.',
                    n: 0.104,
                },
            },
        },
        {
            i: 333,
            $: {
                '0': { v: '048922', n: 1 },
                '1': { v: 'מע בראייה מבנה תמונות וראיה ממוחש', n: 0.408 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לבצע פרוייקטים בעלי זיקה למערכת הראייה מבנה תמונות זיהוי צורות ולהבטים שונים של ראייה ממוחשבת. הפרויקטים יבוצעו בהדרכת חבר סגל בכיר ויהוו צעד ראשון לקראת עבודות מגיסטר בתחום.',
                    n: 0.177,
                },
            },
        },
        {
            i: 334,
            $: {
                '0': { v: '048931', n: 1 },
                '1': { v: 'מידות אינפורמציה ושימושיהן', n: 0.577 },
                '2': {
                    v: 'הקורס מציג מידות אינפורמציה קלאסיות ומוכללות ובוחן מספר אפליקציות שלהן במדעי הנתונים, סטטיסטיקה, הסתברות וקומבינטוריקה. הקורס מתייחס במחציתו הראשונה למידות האינפורמציה הקלאסיות של שאנון ושימושיהן, ובמחציתו השניה - הקורס עוסק באינפורמציית פישר, ובמידות אינפורמציה מוכללות ושימושיהן. תוצאות למידה: 1. הסטודנט יחשף למגוון של מידות אינפורמציה קלאסיות ומוכללות, ויכיר שימושים מגוונים במדעי הנתונים, סטטיסטיקה, הסתברות וקומבינטוריקה. 2. הסטודנט יהיה מסוגל לחשוב על שילוב מידות אינפורמציה לצורך פתרון בעיות בתחום מדעי הנתונים, ועל שימוש במידות אינפורמציה לצורך פתרון בעיות מתמטיות. הכרת מידות אינפורמציה ושימושיהן רלוונטית לדיסיפליונות שונות בשטחים של הנדסת חשמל, מדעי המחשב, מתמטיקה ופיזיקה.',
                    n: 0.104,
                },
            },
        },
        {
            i: 335,
            $: {
                '0': { v: '048933', n: 1 },
                '1': { v: 'מעבדה לתקשורת', n: 0.707 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המתעניינים בלימוד שטח התקשורת בלימודי המוסמכים ומבקשים לבצע פרוייקטים בתחום התקשורת האנלוגית או הספרתית. הפרוייקטים יהיו בתחום מימוש אלגוריתמי צפינה מתקדמים ושילובם בערוצים סיפרתיים שונים או בתחום של חיפוש צפנים אופטיפליים. פרוייקטים בנושאים נוספים יוגדרו בהמשך. בצוע פרוייקט במעבדה עשוי לעזור לסטודנט בגיבוש נושא למחקר בתחום התקשורת.',
                    n: 0.141,
                },
            },
        },
        {
            i: 336,
            $: {
                '0': { v: '048966', n: 1 },
                '1': { v: 'מעבדה במיקרואלקטרוניקה', n: 0.707 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים בלימודי מוסמכים המעוניינים בשטח המיקרו- אלקטרוניקה. דרישות קדם: לפחות 3 קורסים בשרשרת המיקרואלקטרוניקה ופיזיקת מצב מוצק בלימודי הסמכה. הפרויקטים יבחרו מתוך התחומים הבאים: תכן ו/או איפיון מעגל משולב, איפיון התקנים אלקטרונים ואלקטרו אופטיים, תהליכים במיקרואלקטרוניקה.',
                    n: 0.162,
                },
            },
        },
        {
            i: 337,
            $: {
                '0': { v: '048967', n: 1 },
                '1': { v: 'מעבדה לרשתות מחשבים', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לבצע פרויקטים בתחום של רשתות מחשבים לאחר מקצוע הקדם ומקצועות אחרים (בלמודי הסמכה/מוסמכים), אשר יקבעו על פי הנושאים שיוצעו. הפרויקטים יהיו הן בתחום של חמרה מיוחדת לרשתות מחשבים והן בתחום של חקר אלגוריתמים ותכנה לתקשורת מחשבים באמצעות הציוד שבמעבדה. המעבדה יכולה להוות שלב ראשון לגבוש נושא מחקר בתחום.',
                    n: 0.139,
                },
            },
        },
        {
            i: 338,
            $: {
                '0': { v: '048976', n: 1 },
                '1': { v: 'מעבדה במערכות מקביליות', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לבצע פרויקטים בתחום מערכות ותת-מערכות של מחשבים בכלל, ומערכות מקביליות בפרט. מקצועות קדם נוספים ומקצועות צמודים (בלמודי הסמכה/מוסמכים) ייקבעו על פי הנושא. הפרויקטים יהיו בתחומים של תכן מערכות מחשבים, יצירת כלי פיתוח למערכות מתקדמות, וכן חקר ביצועי מערכות ע"י מדידות וסימולציה. הפרויקטים יכללו פיתוח חומרה ו/או תוכנה על פי הצורך, תוך שימת דגש מיוחד על ביצועים והגורמים להם. המעבדה יכולה להוות שלב ראשון בגיבוש נושא למחקר בתחום.',
                    n: 0.119,
                },
            },
        },
        {
            i: 339,
            $: {
                '0': { v: '048980', n: 1 },
                '1': { v: 'תיכנון וניהול רשתות תקשו. לא שיתו', n: 0.408 },
                '2': {
                    v: 'שיתוף ותחרות ברשתות גדולות ורחבות סרט: מוטיבציה ודוגמאות. מושגי יסוד בתורת המשחקים. משחקי בקרת זרימה, משחקי ניתוב, תחרות על רוחב סרט. תכנון רשתות לא-שיתופיות: הפרדוקס של בראס, תכנון טופולוגי והקצאת קיבולים, תכנון GATEWAY. ניהול רשתות תקשורת לא-שיתופיות: אסטרטגיות סטקלברג, גביית אגרות.',
                    n: 0.156,
                },
            },
        },
        {
            i: 340,
            $: {
                '0': { v: '048990', n: 1 },
                '1': { v: 'סמינריון 1', n: 0.707 },
                '2': {
                    v: 'במסגרת מקצוע זה יוכל הסטודנט לבצע פרוייקט לשם מילוי חלקי של הדרישות לתואר "מגיסטר בהנדסת חשמל" (מסטר ללא תיזה). במסגרת זו יעשו פרוייקטים כגון: סקירת ספרות מקפת, סימולציות בהיקף גדול, כתיבת תכנה מתאימה.',
                    n: 0.174,
                },
            },
        },
        {
            i: 341,
            $: {
                '0': { v: '048991', n: 1 },
                '1': { v: 'סמינריון 2', n: 0.707 },
                '2': {
                    v: 'במסגרת מקצוע זה יוכל הסטודנט לבצע פרוייקט לשם מילוי חלקי של הדרישות לתואר "מגיסטר בהנדסת חשמל" (מסטר ללא תיזה). במסגרת זו יעשו פרוייקטים כגון: סקירת ספרות מקפת, סימולציות בהיקף גדול, כתיבת תכנה מתאימה.',
                    n: 0.174,
                },
            },
        },
        {
            i: 342,
            $: {
                '0': { v: '048996', n: 1 },
                '1': { v: 'גלים במבנים מחזוריים', n: 0.577 },
                '2': {
                    v: 'מבנים מחזוריים בתחום גלי המיקרו, האופטיקה ומערכות קוונטיות. מבנים מחזוריים פתוחים וסגורים. בעיות פיזור והתפשטות. פונקציות גרין. תופעות מעבר. מבנים דו-ותלת-מימדיים. מערכות בעלות מספר סופי של תאים זהים. קרינה של אלקטרונים הנעים במבנים מחזוריים.',
                    n: 0.171,
                },
            },
        },
        {
            i: 343,
            $: {
                '0': { v: '049005', n: 1 },
                '1': { v: 'מעבדה בנושאי בקרה', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לבצע פרוייקטים בתחום הבקרה, לאחר מקצועות הקדם ומקצועות אחרים (בלימודי הסמכה/מוסמכים), אשר יקבעו על פי הנושאים שיוצעו. הפרוייקטים יהיו בסימולציות וממושים של אלגוריתמים בנושאי בקרה מתקדמים באמצעות הציוד שבמעבדה. המעבדה יכולה להוות שלב ראשון לגבוש נושא מחקר בתחום. הערה: ההרשמה למעבדה דורשת אישור מוקדם של האחראי על המעבדה.',
                    n: 0.139,
                },
            },
        },
        {
            i: 344,
            $: {
                '0': { v: '049006', n: 1 },
                '1': { v: 'מעבדה לגלים אלקטרומגנטיים', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המעוניינים לבצע פרוייקטים בתחום השדות או הגלים האלקטרומגנטיים. הפרוייקטים יהיו בנושאי תכנון, מימוש ומדידה של התקנים שונים. המדידות תהיינה במישור התדר או במישור הזמן. קיימת אפשרות לבצע פרוייקטים נומרים במאמצעות תוכנה קיימת. העבודה במעבדה עשויה להוות שלב ראשון בגבוש נושא מחקר לקראת תואר גבוה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 345,
            $: {
                '0': { v: '049027', n: 1 },
                '1': { v: 'מערכות מרובות משתמשים', n: 0.577 },
                '2': {
                    v: 'חזרה על מושגי יסוד ותוצאות בסיסיות בקידוד משתמש יחיד. הערוץ הגאוסי. ערוץ גאוסי וקטורי ומשפטי WATER POURING. ערוץ גאוסי מוגבל סרט. ערוץ משתמש יחיד התלוי במצב אקראי. קיבול עם מידע צד. הצגת המודלים הבסיסיים של ערוצים מרובי משתמשים. תחום קיבול ומשפט קידוד לערוץ מרובה גישות. ערוץ גאוסי מרובה גישות. מודל כללי לערוץ הפצה ( BROADCAST CHANNEL ). ערוץ הפצה מדורג ( DEGRADED ). תחום קיבול ומשפט קידוד. ערוץ הפצה גאוסי. חזרה על תוצאות בסיסיות בקידוד מקור יחיד. קידוד ללא עיוות למקורות מתואמים ( SLEPIAN-WOLF ). קידוד מקור עם עיוות ומידע צד. בעית WYNER-ZIV. אופציונלי: דואליות בין בעיות קידוד עם מידע צד וקידוד מקור עם מידע צד.',
                    n: 0.097,
                },
            },
        },
        {
            i: 346,
            $: {
                '0': { v: '049043', n: 1 },
                '1': { v: 'דחיסת מידע אוניברסלית', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד ותוצאות בצפינה ללא עיוות, טכניקות צפינה מאורך קבוע לאורך משתנה ( F-V ) , ומאורך משתנה לאורך קבוע ( V-F ) , מודלים הסתברותיים למקורות אינפורמציה בעלי זיכרון, צפינה אוניברסלית למחלקות של מקורות הסתברותיים, אלגוריתם למפל- זיו, יישומים של צפינה אוניברסלית לבעיות שונות.',
                    n: 0.149,
                },
            },
        },
        {
            i: 347,
            $: {
                '0': { v: '049053', n: 1 },
                '1': { v: 'מעבדה בלמידה חישובית', n: 0.577 },
                '2': {
                    v: 'המעבדה מיועדת לסטודנטים המבקשים לערוך פרוייקטים בעלי זיקה ללמידה חישובית וישומיה בתחומים, כגון עיבוד שפה טבעית, זיהוי בתחומים כגון אודיו ותמונות ולמידה מחוזקת. הפרוייקטים יערכו בהדרכת חבר סגל בכיר. עריכת פרוייקט במעבדה עשויה להוות שלב ראשון בגיבוש נושא מחקר בתחום הלמידה.',
                    n: 0.156,
                },
            },
        },
        {
            i: 348,
            $: {
                '0': { v: '049062', n: 1 },
                '1': { v: 'דימות ושחזור תלת-מימדי', n: 0.577 },
                '2': {
                    v: 'גישות פיזיקליות למיפוי תלת מימדי של עצמים וסצינות, בעיקר על ידי אור. הגישות מבוססות על: טריאנגולציה גאומטרית, עומק שדה, תאורה מובנית, קוהרנטיות, פיזור, ניתוח של עקיפת אור, הצללה, צל, קיטוב, הנדסה של מפתחים, פלואורוסנציה, זמן החזרה, וטומוגרפיה. הסצינות פורשות קני מידה: מיקרוסקופיים, מאקרוסקופיים ועד אסטרונומיים. גישות לתצוגה תלת ממדית. תוצאות למידה: בסיום הקורס הסטודנטים: 1. יכירו עקרונות וגישות פאסיביות ואקטיביות למדידת מרחקי עצמים. 2. יכירו עקרונות וגישות פאסיביות ואקטיביות למדידת שיפועים וצורות תלת ממדיות. 3. יכירו עקרונות וגישות חישה לגופים נפחיים המעבירים קרינה (כגון טומוגרפיה). 4. יכירו עקרונות וגישות ליצירת אשליות אופטיות המנוצלות לתצוגה תלת ממדית. 5. יבינו את מגבלות ויתרונות הגישות השונות.',
                    n: 0.099,
                },
            },
        },
        {
            i: 349,
            $: {
                '0': { v: '049064', n: 1 },
                '1': { v: 'שיטות וריאציוניות בעיבוד תמונה', n: 0.5 },
                '2': {
                    v: 'עקרונות במינמיזציית אנרגיה קמורה ולא קמורה.דיפוזיה לא לינארית (פרונה מאליק) ולא איזוטרופית (וייקרט). אבולוציה של קווי מתאר אקטיבים לסגמנצטיה תוך שימוש ברמות גובה. שיטות נומריות למימוש משוואות דיפרנציאליות חלקיות. ניקוי רעשים בעזרת אנרגיית וריאציה כוללת, ובאמצעות פונקציונאלים מסדר גבוה, אבולוציה של יריעות . אופרטורים ואנרגיות לא לוקאלים. יישומים: הורדת רעש, דקונבולוציה, חידוד תמונה, סגמנטציה, זרימה אופטית, רגיסטרציה. תוצאות למידה: בסיום הקורס הסטודנט: 1. יהיה מסוגל להשתמש בידע מתמטי ולהשתמש בכלים של אופטימיזציה קמורה. 2. יהיה בעל יכולת לממש באופן נומרי קוד הפותר משוואות דיפרנציאוליות חלקיות לא לינאריות. 3. יכיר אלגוריתמים בעיבוד תמונה.',
                    n: 0.104,
                },
            },
        },
        {
            i: 350,
            $: {
                '0': { v: '054133', n: 1 },
                '1': { v: 'מבט על הנדסה כימית וביוכימית', n: 0.447 },
                '2': {
                    v: 'הכרות קצרה עם הטכניון והפקולטה להנדסה כימית. הגדרת המקצועות הנדסה כימית והנדסה ביוכימית. מקומו של המהנדס הכימי והביוכימי בתעשייה. תחומי מחקר בהנדסה כימית. הקורס מיועד במסגרת הבחירה החופשית לסטודנטים בסמסטר ראשון בפקולטה להנדסה כימית והמסלול להנדסה ביוכימית.',
                    n: 0.164,
                },
            },
        },
        {
            i: 351,
            $: {
                '0': { v: '054135', n: 1 },
                '1': { v: 'מבוא להנדסה כימית וביוכימית', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס לאפשר הכרה ראשונית של ההנדסה הכימית והביוכימית ולהקנות כלים בסיסיים לעוסקים במקצוע זה. הנושאים הנלמדים: יחידות, דייקנות ודיוק, מספרים חסרי ממדיים, גזים אידיאלים וראליים. שיווי משקל אדים ונוזל, חוק הפאזות, טבלאות קיטור. מאזני חומר: מאזנים במצב יציב, מאזנים ללא ועם תגובות כימיות, תהליכי סחרור ומעקף. מאזני אנרגיה: מאזן אנרגיה כללי, חום ועבודה, מאזני אנרגיה במצב יציב, מאזני אנרגיה עם תגובות כימיות. מאזני חומר ואנרגיה סימולטניים. מאזני חומר ואנרגיה במצב לא יציב.',
                    n: 0.117,
                },
            },
        },
        {
            i: 352,
            $: {
                '0': { v: '054136', n: 1 },
                '1': { v: 'תהליכי הפרדה 1 בה.כימית וביוכימית', n: 0.447 },
                '2': {
                    v: 'המקצוע עוסק בתהליכי הפרדת נוזל-מוצק, נוזל-אדים, ומוצק-גז וכן במערכות חלקיקים. רתיחה ועיבוי. זרימת פלואידים דרך מצע נקבובי. סינון מוצק-נוזל. מפל לחץ בזרימת גז-נוזל בעמוד מוארז. הרחפה. זרימה על פני גופים טבולים: מקדמי גרר. תנועת חלקיקים בפלואידים. שקיעת חלקיקים בשדה כובד ובשדה צנטריפוגלי. הפרדת חלקיקים לפי גודל וצפיפות: מסמיך, ציקלון. אפיון גודל חלקיקים. ניפוי, טחינה וגריסה. ערבוב נוזלים ומוצקים. אידוי, חישוב מאיידים חד-ורב-דרגיים. מבוא לגיבוש. מאפייני סינון של חומרים ביולוגיים, שבירת תאים, מבוא לתהליכי ממברנות.',
                    n: 0.116,
                },
            },
        },
        {
            i: 353,
            $: {
                '0': { v: '054251', n: 1 },
                '1': { v: 'עבודה בתעשיה  1', n: 0.577 },
                '2': {
                    v: 'עבודה במפעל תעשייתי בתפקיד התורם להקנית נסיון מקצועי בהנדסה כימית. משך העבודה - 6 שבועות לפחות. לאחר סיומה על הסטודנט להגיש דו"ח על פעילותו במפעל.\nהערה: המקצוע מוצע לסטודנטים שצברו לפחות 80 נק\' זכות.',
                    n: 0.174,
                },
            },
        },
        {
            i: 354,
            $: {
                '0': { v: '054305', n: 1 },
                '1': { v: 'תהליכי הפרדה 2', n: 0.577 },
                '2': {
                    v: 'המקצוע עוסק בתהליכי הפרדה תעשייתיים המבוססים על עקרונות מעבר חומר. מעבר חומר בין פאזי. תהליכי הפרדה במגע רציף ובשלבים במערכות גז-נוזל: ספיגה, זיקוק והלחה, במערכות נוזל-נוזל: מיצוי, במערכות מוצק-פלואיד: יבוש וגיבוש. מבוא לתהליכי הפרדה במערכות רב-מרכיביות.',
                    n: 0.167,
                },
            },
        },
        {
            i: 355,
            $: {
                '0': { v: '054306', n: 1 },
                '1': { v: "עקרונות הנדסה כימית 2 מ'", n: 0.447 },
                '2': {
                    v: 'המקצוע עוסק בתופעות מעבר חום ויישומן ההנדסי במתקני מעבר חום וכן בעקרונות תופעות מעבר חומר. מנגנוני מעבר חום. מעבר חום בהולכה במצב תמידי ואי תמידי. מעבר חום בהסעה. אנליזת מימדים: מקדמי מעבר חום בהסעה טבעית ומאולצת. מתאמים למקדמי מעבר חום בהסעה. אנלוגיות למעבר תנע וחום. מחליפי חום. מעבר חום בקרינה. מאזן אנרגיה דיפרנציאלי כללי. שכבת הגבול התרמית. מנגנוני מעבר חומר. מאזני חומר דיפרנציאליים. מעבר חומר בדיפוזיה מולקולרית במצב תמידי ואי-תמידי. מעבר חומר בהסעה. אנלוגיות למעבר תנע, חום וחומר. שכבת גבול ריכוזית.',
                    n: 0.111,
                },
            },
        },
        {
            i: 356,
            $: {
                '0': { v: '054309', n: 1 },
                '1': { v: 'תהליכי הפרדה בהנדסה כימית', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בפעולות יסוד בהנדסה כימית ותהליכי הפרדה מבוססי קינטיקה ושיווי משקל. הנושאים כוללים זרימה בצנרת, אביזרי צנרת, משאבות, זרימת פלואידים דרך מצע נקבובי נייח ומרחף, סינון מוצקים, איפיון גודל חלקיקים, שקיעת חלקיקים , שיקוע וגיבוש חומרים, הפרדות ע"י בממברנות ושדה חשמלי, זיקוק, מיצוי, ספיחה, כרומטוגרפיה, הלחה וייבוש מוצקים.',
                    n: 0.143,
                },
            },
        },
        {
            i: 357,
            $: {
                '0': { v: '054314', n: 1 },
                '1': { v: "מבוא לדינמיקה ובקרת תהליכים מ'", n: 0.447 },
                '2': {
                    v: 'פתוח מודל תהליכי דינמי. ליניאריזציה. ניתוח מערכות דינמיות ליניאריות בתחומי הזמן ולפלס. תגובתן בזמן של מערכות ליניאריות. יציבות. תכן וכוונון של מערכות בקרה במשוב. ניתוח ותכן של מערכות בקרה באמצעות שיטת מקום השורשים. הכרה ושימוש בתוכנות מחשב לפתרון של מודלים מתמטיים, ניתוחם והצגתם באופן גרפי.',
                    n: 0.149,
                },
            },
        },
        {
            i: 358,
            $: {
                '0': { v: '054316', n: 1 },
                '1': { v: "תרמודינמיקה א' מתקדם", n: 0.577 },
                '2': {
                    v: "מושגי יסוד. גדלים אקסטנסיביים ואינטנסיביים. אנרגיה פנימית והחוק הראשון. חישובי אנרגיה, עבודה וחום. משוואות מצב, חישובי חום בתהליכים כימיים, אנטרופיה והחוק השני, מחזור קרנו, התורה הקינטית וטמפרטורה, מערכות פתוחות, אפקט ג'אול-תומסון, תכונות תרמודינמיות, אנרגיה חופשית, חוק הפאזות של גיבס, מכונות ומשאבות חום. הקורס כולל מעבדה.",
                    n: 0.149,
                },
            },
        },
        {
            i: 359,
            $: {
                '0': { v: '054319', n: 1 },
                '1': { v: "תרמודינמיקה ב' מתקדם", n: 0.577 },
                '2': {
                    v: 'שיווי משקל בין פאזות במערכות רב-מרכיביות. חישוב הרכבים בתמיסות אידיאליות ובלתי אידיאליות, מקדמי פעילות, תמיסות אלקטרוליטים, שיווי משקל כימי, חישוב הרכבים בשיווי משקל. ביצוע ניסוי מעבדה לקביעת תכונות אנתלפיה, אנטרופיה ואנרגית גיבס, מתח פנים ושטח פנים של מוצק, סיווג תמיסות לפי תכונות העודף וקביעת יציבות וחיזוי הפרדות לשתי פאזות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 360,
            $: {
                '0': { v: '054320', n: 1 },
                '1': { v: "עקרונות הנדסה כימית 2 ח'", n: 0.447 },
                '2': {
                    v: 'מבוא לתופעות מעבר חום וחומר בהנדסה כימית. מנגנוני מעבר חום. מאזני אנרגיה והמשוואה הדיפרנציאלית של מעבר חום. מעבר חום בהולכה במצב מתמיד ובמצב לא מתמיד. מעבר חום בהסעה: אנליזת מימדים, שכבת הגבול התרמית, מתאמים למקדמי מעבר חום בהסעה מאולצת וטבעית. מעבר חום עם מעבר פאזה. מחליפי חום. מעבר חום בקרינה. מנגנוני מעבר חומר, המשוואה הדיפרנציאלית של מעבר חומר, מעבר חומר בדיפוזיה במצב מתמיד ובמצב לא מתמיד. מעבר חומר בהסעה. שכבת הגבול הריכוזית. פתרון בעיות מעבר חום וחומר באמצעות שיטות חישוביות.',
                    n: 0.112,
                },
            },
        },
        {
            i: 361,
            $: {
                '0': { v: '054321', n: 1 },
                '1': { v: 'מבוא לתכן ריאקטורים כימיים(ח)', n: 0.5 },
                '2': {
                    v: 'קצב ריאקציה, סדר ריאקציה, ריאקציות אלמנטריות, רברסיביליות ושווי משקל. השפעת הטמפרטורה. ריאקציות מורכבות, ריאקציות שרשרת, פיצוץ ופילמור. קטליזה הומוגנית. ספיחה וקטליזה הטרוגנית. קינטיקה אנזימטית. התורה הקינטית של הגזים. תורת ההתנגשויות, משטחי פוטנציאל ותורת מצב המעבר.',
                    n: 0.169,
                },
            },
        },
        {
            i: 362,
            $: {
                '0': { v: '054350', n: 1 },
                '1': { v: 'פולימרים 1', n: 0.707 },
                '2': {
                    v: 'הקדמה והגדרות. מנגנוני פולימריזציה. קינטיקה של פילמור שרשרת. קינטיקה של קופולימריזציה. קינטיקה של פילמור בשלבים. תהליכי פולימריזציה תעשייתיים במסה, תרחיף, תחליב ותמיסה. המבנה הכימי של פולימרים שימושיים.',
                    n: 0.192,
                },
            },
        },
        {
            i: 363,
            $: {
                '0': { v: '054351', n: 1 },
                '1': { v: 'פולימרים 2', n: 0.707 },
                '2': {
                    v: 'תרמודינמיקה של תמיסות פולימריות. שיטות לקביעת משקל מולקולרי. ריאולוגיה של תמיסות פולימריות ופולימרים מותכים. תכונות פיסיקליות ומכניות של פולימרים במצב מוצק. מבנים אמורפיים וגבישיים. אלסטיות גומי. עיבוד חומרים תרמופלסטיים.',
                    n: 0.186,
                },
            },
        },
        {
            i: 364,
            $: {
                '0': { v: '054364', n: 1 },
                '1': { v: 'עבודה בתעשיה 2', n: 0.577 },
                '2': {
                    v: 'עבודה במפעל לפי המתכונת המצוינת במקצוע "עבודה בתעשיה 1"\nהמקצוע מוצע לסטודנטים שצברו לפחות 120 נק\' זכות.',
                    n: 0.25,
                },
            },
        },
        {
            i: 365,
            $: {
                '0': { v: '054367', n: 1 },
                '1': { v: 'פרויקט מחקר 1', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע מחקר נסויי או עיוני באחד משטחי ההנדסה הכימית בהנחית חבר סגל בכיר. על הסטודנט להגיש דו"ח על העבודה. הערה: המקצוע פתוח לסטודנטים מצטיינים בלבד.',
                    n: 0.196,
                },
            },
        },
        {
            i: 366,
            $: {
                '0': { v: '054368', n: 1 },
                '1': { v: 'פרויקט מחקר 2', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע מחקר נסויי או עיוני באחד משטחי ההנדסה הכימית בהנחית חבר סגל בכיר. על הסטודנט להגיש דו"ח על העבודה. הפרויקט יכול להיות המשך ל"פרויקט מחקר 1", או להיות מחקר עצמאי שונה.\nהערה: המקצוע פתוח לסטודנטים מצטיינים בלבד.',
                    n: 0.164,
                },
            },
        },
        {
            i: 367,
            $: {
                '0': { v: '054375', n: 1 },
                '1': { v: 'יצור התקני מל"מ למהנדסים כימיים', n: 0.447 },
                '2': {
                    v: 'מבוא, מושגי יסוד ורקע: מבנים גבישיים, פסי אנרגיה, צפיפות מצבים ורמת פרמי, ניידות ומוליכות חשמלית, סימום, התקנים יסודיים. סביבת תהליך הייצור, גידול סיליקון, תהליכי חמצון ודיפוזיה, השתלת יונים, ליתוגרפיה, איכול רטוב ויבש, שיקוע כימי מפאזה גאזית, אפיטקסיה, מיתוך ויצירת מגעים, ראייה אינטגרטיבית של פעולת היסוד.',
                    n: 0.149,
                },
            },
        },
        {
            i: 368,
            $: {
                '0': { v: '054377', n: 1 },
                '1': { v: 'מבוא לטכנולוגית אבקות', n: 0.577 },
                '2': {
                    v: 'חלק גדול מהמוצרים הכימיים מיוצרים, משונעים ונמכרים כאבקות. מומחיות בטכנולוגיית אבקות הכרחית לייצור אבקות בעלות תכונות רצויות, טיפול בהן ושימושן בהמשך התהליך. הקורס יעסוק בהיבטים השונים של ייצור ושימוש באבקות בתעשייה, בדגש על תעשיית התרופות: גיבוש, הפרדה מאויר או נוזל, הקטנת גודל חלקיקים, שיטות עיבוד ושיטות אפיון.',
                    n: 0.146,
                },
            },
        },
        {
            i: 369,
            $: {
                '0': { v: '054400', n: 1 },
                '1': { v: 'מעבדה   להנדסה כימית 2', n: 0.5 },
                '2': {
                    v: 'במעבדה זו מבוצעים ניסויים שנועדו להמחשת : א. עקרונות פעולות יסוד המבוססות על תהליכי מעבר חומר. ב. עקרונות הנדסת ריאקטורים כימיים. מטרת המעבדה ומתכונתה זהים לאלו של המקצוע "מעבדה להנדסה כימית 1".',
                    n: 0.177,
                },
            },
        },
        {
            i: 370,
            $: {
                '0': { v: '054406', n: 1 },
                '1': { v: 'מחקר גמר 1', n: 0.577 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים בפקולטה להנדסה כימית (כל המסלולים) בסמסטר השביעי ללימודיהם. הסטודנטים יבצעו מחקר ניסויי או עיוני באחד משטחי ההנדסה הכימית או הביוכימית, בזוגות או יחידים. בהנחיית חבר סגל בכיר. על הסטודנט למצוא מנחה ונושא מחקר לפני תחילת הסמסטר. הנושא ייחקר בדרך כלל במשך שני סמסטרים (ראה מחקר גמר 2). היקף המחקר הוא 8 שעות שבועיות. בנוסף יתקיימו מספר פגישות במהלך הסמסטר אשר הנוכחות בהן היא חובה. במשך הסמסטר על הסטודנטים להגיש שני דוחות ביניים. בסוף הסמסטר על הסטודנטים להציג את עבודתם באירוע כלל פקולטי,ולהגיש דוח מסכם.',
                    n: 0.107,
                },
            },
        },
        {
            i: 371,
            $: {
                '0': { v: '054407', n: 1 },
                '1': { v: 'מחקר גמר 2', n: 0.577 },
                '2': {
                    v: 'הסטודנט ישלים בדרך כלל את המחקר שהתחיל במסגרת המקצוע "מחקר גמר 1 ", ובתום הסמסטר ידווח על עבודתו וממצאיה בכתב ובתצוגת פוסטרים.',
                    n: 0.213,
                },
            },
        },
        {
            i: 372,
            $: {
                '0': { v: '054412', n: 1 },
                '1': { v: 'הנדסה ביוכימית', n: 0.707 },
                '2': {
                    v: 'קינטיקה של ריאקציות אנזימטיות, עיכוב וקואופרטיביות, אנזימים אלוסטריים, אנזימים מקובעים. מבוא לבקרה מטבולית. מקדמי בקרה ואלסטיות, ניתוח של רשתות מטבוליות, ויסות היצע וביקוש ועיכוב במשוב שלילי. מבוא לביולוגיה מערכתית, מודלים מבוססי אילוצים, מאזני שטף ברשתות מטבוליות. מעגלי בקרה גנטית כמערכות דינמיות. היבטים מערכתיים של מטבוליזם ובקרה גנטית. ריאקטורים ביולוגיים, מעבר חום וחומר בביו-ריאקטורים. יציבות גנטית ותחרות באוכלוסיות תאים מעורבות.',
                    n: 0.13,
                },
            },
        },
        {
            i: 373,
            $: {
                '0': { v: '054416', n: 1 },
                '1': { v: 'תכון אינטגרטיבי של תהליכים כימיים', n: 0.447 },
                '2': {
                    v: 'קורס זה מלמד את הסטודנט לבצע תכנון אינטגרטיבי של תהליכים כימיים על מנת לקיים דרישות השוק תוך הגברת רווחים, הבטחת איכות המוצר, מזעור הנזק הסביבתי, והפעלה בטוחה ומבוקרת של מתקן היצור. קורס זה מנוהל במתכונת "הכיתה ההפוכה".',
                    n: 0.164,
                },
            },
        },
        {
            i: 374,
            $: {
                '0': { v: '054417', n: 1 },
                '1': { v: "תכון אינטגר. של תהליכים כימיים מ'", n: 0.408 },
                '2': {
                    v: 'נושאים הנלמדים: מבוא לתכן תהליכי, אתיקה הנדסית, הערכת עלות מתקן וניתוח רווחיות, סינתזת שרשרת הפרדה, סינתזת רשת מחליף חום, שילוב בקרת בתכן תהליכי, סינתזת מערכת בקרה למתקן כולל, HAZOP ו- HAZAN. פרויקט המורחב כולל תכנון וניתוח כלכלי של תהליך כימי שלם. קורס זה מנוהל במתכונת "הכיתה ההפוכה".',
                    n: 0.146,
                },
            },
        },
        {
            i: 375,
            $: {
                '0': { v: '054420', n: 1 },
                '1': { v: "מעבדה להנדסה כימית 2 בכ'", n: 0.447 },
                '2': {
                    v: 'במעבדה זו מבוצעים ניסויים שנועדו להמחשת: א. עקרונות פעולות יסוד המבוססות על תהליכי מעבר חומר. ב. עקרונות הנדסת ריאקטורים כימיים.',
                    n: 0.224,
                },
            },
        },
        {
            i: 376,
            $: {
                '0': { v: '054452', n: 1 },
                '1': { v: 'בעיות סביבתיות-זיהום אויר', n: 0.577 },
                '2': {
                    v: 'הכרת בעיות זיהום האויר בסביבה והדרכים לפתרון בעיות אלה. הצגת ופתוח המושגים היסודיים של זיהום אויר: סוגי המזהמים, תכונותיהם. רוחות מקומיות ורוחות גלובליות. מצבים אטמוספיריים והשפעתם על הפיזור של מזהמים באטמוספרה. הווצרות מזהמים בתהליכי שריפה. סילוק מזהמים מתהליכים שונים.',
                    n: 0.16,
                },
            },
        },
        {
            i: 377,
            $: {
                '0': { v: '056146', n: 1 },
                '1': { v: 'נושאים הנדסיים נבחרים', n: 0.577 },
                '2': {
                    v: 'קורס מתקדם שנועד ללימוד מעמיק בנושאים הנדסיים. סילבוס מפורט יקבע בשנה בה ינתן הקורס. סמסטר ב\' תשע"ז: קטליזה על משטחים. סמסטר א\' תשע"ח: טכנולוגית אבקות. סמסטר א\' תשע"ט: טכנולוגית אבקות.',
                    n: 0.183,
                },
            },
        },
        {
            i: 378,
            $: {
                '0': { v: '056386', n: 1 },
                '1': { v: 'נושאים הנדסיים נבחרים 2', n: 0.5 },
                '2': {
                    v: 'קורס מתקדם בנושאים הנדסיים כימיים. הקורס ינתן בעיקר ע"י מרצים אורחים. סילבוס מפורט יקבע לפני הסמסטר בו ינתן הקורס. סמסטר ב\' תשע"ז: הנדסה אקלוגית בחיי יומיום. סמסטר א\' תשע"ט: אנליזת פני שטח של חומרים פונקציונאליים.',
                    n: 0.169,
                },
            },
        },
        {
            i: 379,
            $: {
                '0': { v: '056391', n: 1 },
                '1': { v: 'חיישנים מבוססי ננו-(ביו) חומרים', n: 0.5 },
                '2': {
                    v: 'נושאים: אפיוני חיישנים בהתאם לסוג היישום. אפיוני ננו-חומרים ליישומי חישה. ננו-חלקיקים מתכתיים ומוליכים למחצה. ננו-חוטים וננו-צינורות אורגניים ואי-אורגניים. חיישנים אופטיים, מכניים, וכימיים מבוססי ננו- חומרים. חיישנים מבוססי ננו-חומרים מוכלאים. עיבוד אותות של חיישנים בודדים ומערך של חיישנים (אף אלקטרוני).',
                    n: 0.16,
                },
            },
        },
        {
            i: 380,
            $: {
                '0': { v: '056394', n: 1 },
                '1': { v: 'תבניות ריח: מבוא ויישומים', n: 0.5 },
                '2': {
                    v: 'כימיה של מולקולות ריח, מנגנוני היווצרות של מולקולות ריח-חומרים אורגניים נדיפים ונדיפים למחצה, תהליכים מטבוליים ושימושים קליניים-דיגום נשיפה, טכנולוגיות ושיטות זיהוי-מערכות אנליטיות וחיישנים, שימושים טכנולוגיים בתחומים נוספים- איכות סביבה, מזון, זיהוי פלילי. תוצאות למידה: בסיום המקצוע הסטודנט יהיה מסוגל: 1. לתאר ולפרש תהליכים ומולקולות כימיות הקשורות לריח. 2. להבין תהליכים תרמודינמיים ומנגנוני היווצרות של מולקולות נדיפות. 3. לנבא תהליכים היכולים להביא ליצירת מולקולות או סמנים נדיפים בקליניקה,בתעשיה ובסביבה. 4. להשוות ולהדגים מנגנוני חישה של ריח ושימושם באורגניזמים בטבע ובמיוחד בבני אדם. 5. להעריך ולנבא מסלולים מטבוליים לשימוש כסמנים קליניים במחלות. 6. להכיר ולהבין את המתודולוגיה של אנליזת נשימה ושימושיה. 7. לבחור טכנולוגיות אנליטיות או טכנולוגיות חישה לבדיקת חומרי ריח. 8. להבין ולנתח תוצאות סטטיסטיות של ספרות בתחום 9. לסכם ולנתח תוצאות מדעיות וכן להציג עבודה מדעית בפני קהל.',
                    n: 0.088,
                },
            },
        },
        {
            i: 381,
            $: {
                '0': { v: '056396', n: 1 },
                '1': { v: 'חלקיקים קולואידים וכוחות בין-מולק', n: 0.5 },
                '2': {
                    v: 'כוחות שטח ( DLVO THEORY ) בין חלקיקים קולואידים (ננו- ומיקרו-חלקיקים) והשלכות על אנרגיות אדהזיה ומתח פנים של מוצקים ונוזלים, דיאגרמות אנרגיה עבור יציבות קינטית של תרחיפים (אמולסיות וסספנסיות), משוואות קצב עבור תהליכי קואגולציה בתרחיפים כתלות בכוחות שטח, טמ"פ, גודל חלקיקים, וצמיגות הנוזל הבין חלקיקי, ואפליקציה לתהליכי הפרדה. תוצאות למידה: בסיום הקורס הסטודנט יוכל: א.לחשב כוחות בין משטחיים הנובעים מתהליכים בין מולקולרים. ב. להעריך באופן איכותי (באמצעות דיאגרמות אנרגיה) ובאופן כמותי (באמצעות מודלים קינטיים) את התהליכים הלוקחים חלק תוך כדי מפגש בין חלקיקים קולואידים, וכן את משך הזמן שבו תרחיפים שומרים על יציבות (חיי מדף). בנוסף הסטודנט יישם את הידע הנרכש בקורס על מנת לקבוע יעילות תהליכי הפרדת חלקיקים.',
                    n: 0.096,
                },
            },
        },
        {
            i: 382,
            $: {
                '0': { v: '056397', n: 1 },
                '1': { v: 'ממברנות עקרונות וחומרים', n: 0.577 },
                '2': {
                    v: "סקירת תהליכי ממברנות ועקרונותיהם הפיזיקליים. תהליכים: מים, הפקת אנרגיה, אלקטרוכימיה ואחרים. ממברנות ביולוגיות וסנתטיות, פולימרים וחומרים מתקדמים לממברנות. תרמודינמיקה ומנגנוני מעבר וסלקטיביות למולקולות ויונים בממברנות שונות. תופעות פני שטח בממברנה: אילוח, סוגיו והפחתתו. מודיפיקציה ואפיון ממברנות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין ולנתח מנגנוני הפרדה בתהליכי ממברנות שונים כולל מערכות אלקטרו- ממברנליות, הפקת אנרגיה, טיהור מים, הפרדת גזים וכו'. 2. להבין יתרונות ומגבלות בתהליכים קיימים ברמת מנגנונים פיזיקליים (תרמודינמיקה וקינטיקה). 3. לראות כיצד חומרים מתקדמים וביומימטיים יכולים לשפר ביצועי ממברנות. 4. להבין תופעות קיטוב ואילוח, השפעתן על ביצועים ודרכים להתמודד איתן.",
                    n: 0.103,
                },
            },
        },
        {
            i: 383,
            $: {
                '0': { v: '056402', n: 1 },
                '1': { v: 'מודלים בכימיה מולקולרית וקינטית', n: 0.5 },
                '2': {
                    v: 'בקורס זה נלמד על שיטות חישוביות לקביעת תכונות חומרים ברמה המולקולרית והסקה על תכונותיהם התרמודינמיות ברמה המאקרוסקופית באמצעות מכניקה סטטיסטית, כמו גם חישוב קבועי קצבי ריאקציות וקבועי קבצי ריאקציות התלויים בלחץ. יינתן רקע מתאים בתרמודינמיקה סטטיסטית. נלמד על מודלים קינטיים אלמנטריים ונתנסה בבנייתם באופן אוטומטי. הקורס משלב תכנות (בעיקר בשפת PYTHON), ויזואליזציה, ואוטומציה. בקורס זה נשתמש בתוכנות קוד פתוח בלבד (לדוגמא 4ISP, RDKIT), כך שמשתתפי הקורס יקבלו הכשרה שתוכל לשמש אותם בכל מסגרת עתידית ללא תלות בתוכנות מסחריות. תוצאות למידה: בסיום הקורס הסטודנט/ית יהיו מסוגלים: 1. לייצג מולקולות באמצעות תוכנת מחשב 2. לבצע מניפולציות בקונפורמציה התלת מימדית של מולקולות 3. לבצע חישובי מבנה אלקטרונים 4. לחשב תכונות תרמודינמיות כגון אנתלפיית ואנטרופיית היווצרות סטנדרטיות המבוססות על חישובי מבנה אלקטרוניים באמצעות פונקציית החלוקה 5. לחשב קבועי קצב כמו גם קבועי קצב התלויים בלחץ 6. לבנות מודלים קנטיים תוך שימוש בכלים אוטומטיים',
                    n: 0.085,
                },
            },
        },
        {
            i: 384,
            $: {
                '0': { v: '058002', n: 1 },
                '1': { v: 'מבוא לזרימה רב פאזית - ס', n: 0.408 },
                '2': {
                    v: 'תפיסות בסיסיות לזרימות רב פאזיות ולמשוואות השולטות, משוואות קינטיות, משואות מאזן אוכלוסיות, מבוא כללי לשיקוע, הרחפה, אמולסיפיקציה, תהליכי אטומיזציה ושימושיהם התעשייתיים. קירובי מודלים, נפחי זורמים, אלמנטים בדידים, מודל שני זרמים. טכניקות מדידה, הדמית צללים, פיזור מיא, מדידת מהירות חלקיקים. _תוצאות למידה:\nבסיום הקורס הסטודנט יהיה בעל ידע בתחומים הבאים:_\n1. הבנת נושאי זרימה רב פאזית_\n2. חישובי מודלים של שיקוע והרחפה_\n3. פיתוח מודלים לסוגי זרימה.\n4. הבנת טכניקות מדידה רב פאזיות.',
                    n: 0.122,
                },
            },
        },
        {
            i: 385,
            $: {
                '0': { v: '058127', n: 1 },
                '1': { v: 'תופעות מעבר-זרימת פלואידים', n: 0.577 },
                '2': {
                    v: 'טנזורים קרטזיים. עווי. מאמץ. משוואות קונסטיטוטיביות. משוואות הרציפות, התנועה והאנרגיה. משוואות נויר סטוקס. פתרונות מדוייקים. פונקצית הזרימה. זרימה לא ניוטונית, זרימה צמיגה שכבות גבול. זרימה טורבולנטית.',
                    n: 0.196,
                },
            },
        },
        {
            i: 386,
            $: {
                '0': { v: '058143', n: 1 },
                '1': { v: 'תופעת מעבר - חום וחומר', n: 0.447 },
                '2': {
                    v: 'פנומנולוגיה של דפוזיה, מקדמי דפוזיה והולכה, מעבר חום וחומר חד-ורב-ממדי, דפוזיה בתמיסות מרוכזות, תווך אניזוטרופי, משוואות כלליות למעבר חום ולמעבר חומר במערכות בינאריות. פתרונות אנליטיים ונומריים לבעיות מעבר חום וחומר בהסעה מאולצת וטבעית. דפוזיה רב-מרכיבית, צמוד תופעות מעבר חום וחומר, בעיות גבול נע.',
                    n: 0.152,
                },
            },
        },
        {
            i: 387,
            $: {
                '0': { v: '058145', n: 1 },
                '1': { v: 'תכנון ראקטורים מתקדם', n: 0.577 },
                '2': {
                    v: 'סטוכיומטריה של מערכת ראקציות. משוואות השימור והפשטתן למודלים של ראקטורים. פילוג זמני שהייה. קצבי ראקציות הטרוגניות. מעבר חום וחומר בראקטורים הטרוגניים. שיטות תכנון.בעיות נבחרות.',
                    n: 0.204,
                },
            },
        },
        {
            i: 388,
            $: {
                '0': { v: '058174', n: 1 },
                '1': { v: 'סמינר מתקדם בהנדסה כימית', n: 0.5 },
                '2': {
                    v: 'הקורס מיועד למסלול מגיסטר להנדסה. במסגרתו תבוצע עבודת גמר סמינריונית. העבודה יכולה להיות מחקר מעבדתי, פרויקט תכנון או סקר ספרות בקורתי.',
                    n: 0.218,
                },
            },
        },
        {
            i: 389,
            $: {
                '0': { v: '058177', n: 1 },
                '1': { v: 'שיטות מתמטיות בהנדסה כימית', n: 0.5 },
                '2': {
                    v: 'פונקציות של משתנים מורכבים. אינטגרציה במישור מורכב. מרחבים לינארים. טורי פוריה. התמרות פוריה והתמרות אינטגרליות אחרות. בעיות שטורם-לאוויל. סווג של משוואות דיפרנציאליות חלקיות(מד"ח). מד"ח מסדר ראשון. מד"ח אליפטיות ופרבוליות. הפרדת משתנים. פונקציות גרין. יישומים בהנדסה כימית.',
                    n: 0.167,
                },
            },
        },
        {
            i: 390,
            $: {
                '0': { v: '058187', n: 1 },
                '1': { v: 'סידור עצמי במערכות פולימריות', n: 0.5 },
                '2': {
                    v: 'בקורס ילמדו הנושאים הבאים: תהליכי ארגון עצמי- פולימרים ובלוק- קופולימרים, ננו-חלקיקים, דנ"א אוריגמי, התארגנות סופר מולקולרית, שימוש בפולימרים לתהליכי ננו-פבריקציה, ייצור ממברנות וננו- חלקיקים, שילוב של חומרים אי-אורגנים בפולימרים, שיטות אפיון של ארגון עצמי. הקורס מתאים ברמתו לסטודנטים לתארים מתקדמים ולסטודנטים בהסמכה בשנה האחרונה ללימודיהם. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין עקרונות פיזיקאליים בתהליכי ארגון עצמי במערכות שונות. 2. לנתח מערכות ארגון עצמי ולהבין את היתרונות והחסרונות במערכות אלו. 3. להכיר שימושים שונים של פולימרים ותהליכי ארגון עצמי בננו פבריקציה, ממברנות וננו- חלקיקים. 4. להתאים שיטות אפיון מתאימות לשאלות מחקריות בתחום הארגון העצמי.',
                    n: 0.102,
                },
            },
        },
        {
            i: 391,
            $: {
                '0': { v: '064001', n: 1 },
                '1': { v: 'עבודת גמר  1', n: 0.577 },
                '2': {
                    v: "הסטודנט בוחר בנושא לעבודת מחקר ניסויית, מתוך רשימת נושאים המכסה את כל שטחי הלימוד במחלקה. הסטודנט מבצע את עבודתו בהדרכת מורה בכיר ועליו להוכיח יכולתו לרכז ולנתח את הספרות הקשורה לנושא, לתכנן את עבודת המחקר ואת הניסויים ולבצעם, לפרש את התוצאות ולסכם את עבודתו בחיבור מתאים. מיועד לסטודנטים בסוף שנה ג' או בשנה ד'.",
                    n: 0.136,
                },
            },
        },
        {
            i: 392,
            $: {
                '0': { v: '064002', n: 1 },
                '1': { v: 'עבודת גמר 2', n: 0.577 },
                '2': {
                    v: 'הסטודנט בוחר בנושא לעבודת מחקר ניסויית, מתוך רשימת נושאים המכסה את כל שטחי הלימוד במחלקה. הסטודנט מבצע את עבודתו בהדרכת מורה בכיר ועליו להוכיח יכולת לרכז ולנתח את הספרות הקשורה לנושא, לתכנן ניסויים ולבצעם, לפרש את התוצאות ולסכם את עבודתו בחיבור מתאים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 393,
            $: {
                '0': { v: '064003', n: 1 },
                '1': { v: 'עבודה מעשית בתעשית מזון', n: 0.5 },
                '2': {
                    v: 'לימוד בלתי אמצעי על בעיות היום-יום של תעשית המזון.\nהערה: 8 שבועות עבודת קיץ.',
                    n: 0.277,
                },
            },
        },
        {
            i: 394,
            $: {
                '0': { v: '064005', n: 1 },
                '1': { v: 'פרויקט מיוחד', n: 0.707 },
                '2': {
                    v: 'במסגרת קורס זה יכין הסטודנט עבודה עצמית בנושא ספציפי ומוגדר באחד משטחי ההנדסה, הטכנולוגיה או מדעי המזון. הערה: מקצוע זה יאושר רק במקרים מיוחדים על מנת לאפשר לסטודנטים להם חסרה נקודה אחת (או פחות ) לסיים את לימודיהם.',
                    n: 0.162,
                },
            },
        },
        {
            i: 395,
            $: {
                '0': { v: '064106', n: 1 },
                '1': { v: 'תרמודינמיקה בהנ.ביוטכנולוג.ומזון', n: 0.707 },
                '2': {
                    v: 'מושגי יסוד וחזרה על חוקי התרמודינמיקה, חישובי חום עבודה ושינויים בתכונות בתהליכים מנתיים ובתהליכי זרימה. הפיכות תהליכים וניצולת מכונות חום, תכונות תרמודינמיות של חומרים טהורים, ובפרט מים במצבי צבירה שונים. גזים אידיאליים וראליים, תהליכי דחיסה ותערובות גזים. תכונות תרמודינמיות של תערובות גז-אד, ובפרט של אויר ואדי מים (פסיכרומטריה) וניתוח תהליכי ייבוש והלחה. התנהגות מוצר באריזה קשיחה. משאבות חום ותהליכי קירור ומיזוג. מודל השריג והתאוריה הרגילה של התמיסות. שיווי משקל בין פאזות, פוגסיות, פוטנציאל כימי, תמיסות אידיאליות ואמיתיות, חוק ראול וחוק הנרי, ושינויים בהרכב הפאזות בעת איוד וזיקוק. תכונות קוליגטיביות, תהליכי קירור והקפאה.',
                    n: 0.104,
                },
            },
        },
        {
            i: 396,
            $: {
                '0': { v: '064117', n: 1 },
                '1': { v: 'תופעות מעבר חום', n: 0.577 },
                '2': {
                    v: 'אינטגרציה של חוק פוריה ( FOURIER ) במצב יציב, מעבר חום בהולכה, משוואות דיפרנציאליות למעבר חום, מעבר חום בהסעה, מחליפי חום, מעבר חום בקרינה, אינטגרציה של חוק פוריה ( FOURIER ) במצב לא יציב, איוד ורתיחה, עיקור.',
                    n: 0.164,
                },
            },
        },
        {
            i: 397,
            $: {
                '0': { v: '064119', n: 1 },
                '1': { v: 'תכן מפעלים', n: 0.707 },
                '2': {
                    v: 'הכרת תרשימי זרימה וסקירת ציוד הכרחי לתהליכים תעשייתיים. בחירת נושא לפרויקט, הכנת תקציר מנהלים, תכנון וביצוע תרשים, ביצוע חישובי כמויות, ספיקות וקיבולות, תכנון וביצוע תרשים ציוד הנדסי ( ע"י תוכנת SUPER PRO DESIGNER ), הכנת טבלת ציוד הנדסי, התמקדות ביחידת ציוד מסוימת על כל אביזריה, הכנת טבלת אביזרים ובקרים ליחידת ציוד זו, ביצוע מאזני אנרגיה וחישוב צריכה חודשית, פירוט נקודות קריטיות, הנחות וחישובים.',
                    n: 0.126,
                },
            },
        },
        {
            i: 398,
            $: {
                '0': { v: '064120', n: 1 },
                '1': { v: "שיטות נומריות בהנ. ביוטכ' ומזון", n: 0.447 },
                '2': {
                    v: 'הקורס נועד להקנות כלים בסיסים באנליזה נומרית הרלוונטיים להנדסה. בין השאר ילמדו שיטות מדויקות ואיטרטיביות לפתרון בעיות לינאריות, מציאת שורשים במשוואות לא לינאריות, התאמת עקומות, אינטרפולציה, נגזרת ואינטגרל על ידי הפרשים סופיים ופתרון של משוואות דיפרנציאליות רגילות. הסטודנטים ידרשו ליישם אלגוריתמים ב- MATLAB .',
                    n: 0.151,
                },
            },
        },
        {
            i: 399,
            $: {
                '0': { v: '064210', n: 1 },
                '1': { v: 'פרקים נבחרים בטכנולוגיה של מזון א', n: 0.408 },
                '2': {
                    v: 'פרקים נבחרים בטכנולוגיה ובמדעי המזון כגון: טכנולוגיה של גבינות, בקרה בתעשית המזון, תהליכי עיבוד אבקות, מזון אורגני, טכנולוגיה של שוקולד, תהליך פיתוח מוצרים ועוד. הערה: מתכונת הקורס זהה לזו של המקצוע 064211-פרקים נבחרים בטכנולוגיה של מזון ב\' (כלומר לקט הרצאות ע"י מרצים שונים מהתעשיה ומהאקדמיה). חלק מהנושאים נלמדים במקצוע 064210 ואחרים במסגרת המקצוע 064211. במהלך שנה אקדמית לא תהיה חפיפה בין הנושאים של שני המקצועות כך שניתן ומומלץ לקחת את שניהם, במסגרת המסלול להנדסת מזון.',
                    n: 0.115,
                },
            },
        },
        {
            i: 400,
            $: {
                '0': { v: '064212', n: 1 },
                '1': { v: 'טכנולוגיה של מזון', n: 0.577 },
                '2': {
                    v: 'מבוא. היבטי שיווק, איכות, בטיחות מזון ורגולציה, עיבוד תוצרת חקלאית, טיפולים תרמיים, מבוא לתהליכי ריכוז, איוד ייבוש, קירור והקפאה, עקרונות ניהול איכות, סניטציה, ניקוי וחיטוי, מבוא לטכנולוגיה של מספר קטגוריות מזון נבחרות.',
                    n: 0.177,
                },
            },
        },
        {
            i: 401,
            $: {
                '0': { v: '064239', n: 1 },
                '1': { v: 'מע.בהנ. תהליכים וחומרים ביולוגיים', n: 0.5 },
                '2': {
                    v: 'מעבדה זו תקנה לסטודנטים ידע וניסיון בתפעול יחידות פעולה בסיסיות הנפוצות בתחומי הביוטכנולוגיה התהליכית והנדסת מזון. בוגרי הקורס ידעו לשלב ידע קודם ולהפעיל יחידות ציוד ואנליזה התחומי מעבר חום, חומר ואפיון זורמים כמו גם לנתח מידע הנאסף מיחידות אלו ולהציגו בדו"ח מקצועי.',
                    n: 0.154,
                },
            },
        },
        {
            i: 402,
            $: {
                '0': { v: '064322', n: 1 },
                '1': { v: 'כימיה של מזון', n: 0.577 },
                '2': {
                    v: 'ליפידים במזון: מבנה, תכונות ושימושים במזון, תגובות, היבטים תזונתיים, ליפידים מובנים. חימצון שמנים, אנטיאוקסידנטים וקרוטנואידים. סוכרים: תכונות, נגזרות. רב סוכרים וסיבים תזונתיים: מבנה, תכונות ושימושים במזון. השחמת מייארד והיבטים בריאותיים שלה, השחמה אנזימתית. חומצות אמינו, פפטידים, חלבונים במערכות מזון, שימוש באנזימים בתעשית המזון, פעילות מים והשפעתה על קינטיקה של תגובות במזון.',
                    n: 0.14,
                },
            },
        },
        {
            i: 403,
            $: {
                '0': { v: '064324', n: 1 },
                '1': { v: "שיטות אנליטיות בביוטכ' ומזון", n: 0.5 },
                '2': {
                    v: 'חשיבות ביצוע בדיקות אנליטיות של מוצרי מזון. סטנדרטים ביצור מזון והגופים המפקחים בארץ ובעולם. מושגים: GMP, HACCP, ISO, תוויות מזון._ספקטרוסקופיה ופולרימטריה - רקע ושימושים באנליזת מזון. גז כרומטוגרף, ספקטרומטריית מסות, כרומטוגרפיית נוזלים - רקע תאורטי של כל שיטה ושימושים באנליזת מזון. שיטות אימונולוגיות לאנליזה של מזון. תוספי מזון ותוספי תזונה. אלרגנים במזון.',
                    n: 0.139,
                },
            },
        },
        {
            i: 404,
            $: {
                '0': { v: '064326', n: 1 },
                '1': { v: 'מע.באנליזה:מזון וחומרים ביולוגיים', n: 0.577 },
                '2': {
                    v: 'שיטות שונות לקביעת רטיבות במזון. קביעת כמות ואיכות של שמנים במזון: ערך פרוקסיד, מספר יוד, אלדהידים נדיפים, הרכב חומצות שומן ע"י גז כרומטוגרף וספקטרומטריית מסות. קביעת תרופות בעזרת HPLC. בדיקת זיוף בגבינות ובבשר ע"י שיטות אימונולוגיות. קביעת כמות חלבון במזון בשיטת קלדל ושיטה ספקטרוסקופית. קביעת קפאין ונוגדי חימצון במשקאות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 405,
            $: {
                '0': { v: '064420', n: 1 },
                '1': { v: 'מיקרוביולוגיה של מזון', n: 0.577 },
                '2': {
                    v: 'מיקרואורגניזמים במזון ומים. מיקרוביולוגיה חיובית - תסיסה ע"י שמרים. תסיסה ע"י חידקים לקטיים. מיקרוביולוגיה שלילית - היבטים מיקרוביאליים של שימור וקילקול מזון. איפיון וקביעת מיקרואורגניזם במזון ומים. מק"א גורמי מחלה במזון ובמים. תקנים ותקנות, שמירה על איכות מיקרוביאלית של מוצרי מזון במפעל.',
                    n: 0.154,
                },
            },
        },
        {
            i: 406,
            $: {
                '0': { v: '064507', n: 1 },
                '1': { v: 'ביוטכנולוגיה מולקולרית', n: 0.707 },
                '2': {
                    v: 'עקרונות בסיסיים בגנטיקה של חיידקים (אופרוני הלקטוז והטריפטופן), אנזימים רסטריקציה, פלסמידים, ספריות, DNA טכנולוגיות הספג, ריצוף DNA, הליכה לאורך כרומוזום, אמפליפיקציה של DNA, מוטגנזה מכוונת, מערכות ביטוי בפרוקריוטים ואאוקריוטים, מערכי DNA, RNA לא מקודד, בע"ח טרנסגניים, שיבוט בע"ח, מבוא לריפוי גנטי, מבוא לביולוגיה סינתטית, מבוא לביולוגיה מבנית.',
                    n: 0.146,
                },
            },
        },
        {
            i: 407,
            $: {
                '0': { v: '064509', n: 1 },
                '1': { v: 'תהליכי יסוד בביוטכנולוגיה', n: 0.577 },
                '2': {
                    v: 'גידול מיקרוביאלי: תיאור כימי, שיטות מדידה, קינטיקה, קבלת תוצרים. תאוריה וישום של תרבית רציפה. פרודקטיבות בתהליך רציף ומנתי. מעבר חמצן בראקטורים ביולוגיים: שיטות מדידה והקשר בין הספק וקבוע מעבר החמצן, עיקור וגימלון של ריאקטורים ביולוגיים. אנזימים וריאקטורים אנזימתיים. ריאקטורים לתאים אנימליים. ניתוח פרמנטציות: חומצות אמינו אנטיביוטיקות. הערכה כלכלית של תהליכי פרמנטציה.',
                    n: 0.14,
                },
            },
        },
        {
            i: 408,
            $: {
                '0': { v: '064522', n: 1 },
                '1': { v: 'מבוא להנ. ביוטכנולוגיה ומזון', n: 0.5 },
                '2': {
                    v: 'מהי ביוטכנולוגיה ומהי הנדסת מזון, המפגש בין מדע בסיסי למדע יישומי, תכונות של מזון והערכת מזון, התא כבית חרושת לייצור ביוכימיקליים, נקודות מרכזיות בייצור וחקר הנדסת מזון וביוטכנולוגיה, הקשר שבין מזון ובריאות, הגנום המיקרוביאלי ושימושו בתכנון חיסונים ודיאגנוסטיקה, תאים מיקרוביאליים ככלי ביוטכנולוגי, דוגמאות לתהליכי ייצור מזון וייצור ביוטכנולוגי.',
                    n: 0.144,
                },
            },
        },
        {
            i: 409,
            $: {
                '0': { v: '064523', n: 1 },
                '1': { v: 'מבוא לביוטכנולוגיה מולקולרית', n: 0.577 },
                '2': {
                    v: 'מבנה של חומצות גרעין, דנ"א ו-רנ"א, מבנה הגנום בפרוקריוטים ויוקריוטים, רפליקציה של דנ"א, מוטציות ומנגנוני תיקון, רקומבינציה הומולוגית וספציפית, טרנספוזומים, מנגנון השעתוק, עיבוד רנ"א, מנגנון התרגום, הקוד הגנטי, רגולציה של ביטוי גנים בפרוקריוטים ויוקריוטים.',
                    n: 0.171,
                },
            },
        },
        {
            i: 410,
            $: {
                '0': { v: '064603', n: 1 },
                '1': { v: 'תזונה', n: 1 },
                '2': {
                    v: 'ויסות צריכת המזון. מערכת העיכול : מבנה ותפקוד. חלבונים : הערכת התצרוכת, חומצות אמינו הכרחיות. ערך תזונתי ושיטות לקביעתו. מטבוליזם של חומצות אמינו. הפחמימיות בתזונה : בקרה הורמונלית, ליקויים מטבוליים. שומנים : חומצות שומן הכרחיות, עיכול, ספיגה וחימצון, כולסטרול, ליפופרוטאינים. אנרגטיקה, אנרגיה, בקרה. הקשר בין חלבונים, שומנים, פחמימות והתצרוכת האנרגטית במטבוליזם ובהרכב התפריט.',
                    n: 0.137,
                },
            },
        },
        {
            i: 411,
            $: {
                '0': { v: '064615', n: 1 },
                '1': { v: 'תזונה', n: 1 },
                '2': {
                    v: 'הקדמה למדעי התזונה והמטבוליזם. מערכת העיכול: מבנה ותפקוד. חומרי מזון מספקי אנרגיה באופן כללי, עיכול, ספיגה, מטבוליזם ובקרת תאבון. חלבונים: שיטות לערכת איכות תזונתית, קצבה יומית מומלצת, מטבוליזם של חומצות שומן, בקרה הורמונלית, מיקרוביאוטה. שומנים: מטבוליזם, חומצות אמינו. פחמימות וסיבים: מטבוליזם. הרכבה של תפריט מאוזן. הכרחיות, כולסטרול, ליפופרוטאינים. ויטמינים ומינרלים באופן כללי.',
                    n: 0.139,
                },
            },
        },
        {
            i: 412,
            $: {
                '0': { v: '066012', n: 1 },
                '1': { v: "פרויקט מתקדם בביוטכ'ומזון 1", n: 0.5 },
                '2': {
                    v: 'מטרת הפרויקט היא לפתח מוצר חדש בתחום הביוטכנולוגיה או המזון משלב הרעיון ועד היישום, תוך שימוש בידע שרכשו בקורסי בסיס. הסטודנטים ישובצו לצוותים שיבצעו פרויקטים אינטגרטביים שיכללו תכנון המוצר על פרטיו כולל סקר ספרות מקיף, דרישות מחומרי הגלם, ניתוח כלכלי של הפתוח, ניתוח השוק, כתיבת תוכנית עסקית בסיסית. בסוף הסמסטר הסטודנטים יציגו את התוצר בפני חברי סגל מהפקולטה. תוצאות הלמידה: בסיום הקורס, הסטודנט יהיה מסוגל: 1. להבין את האתגרים בפיתוח מוצר בתחום הביוטכנולוגיה והמזון. 2. לתכנן ולבצע ניסוי מדעי באופן עצמאי. 3. לנסח רעיונות ופתרונות בעזרת כלים חשיבתיים. 4. לפתח יכולת עבודה בצוות מקומי או בינלאומי ולפתח כישורי רשתות עסקיות. 5. להציג רעיון בצורה ממוקדת כמו גם סמינר באנגלית למומחים בתחום.',
                    n: 0.095,
                },
            },
        },
        {
            i: 413,
            $: {
                '0': { v: '066013', n: 1 },
                '1': { v: "פרויקט מתקדם בביוטכ' ומזון 2", n: 0.447 },
                '2': {
                    v: "פרויקט המשך לקורס 066012 שיבשיל לביצוע ממשי. מטרת הפרויקט הקבוצתי לפתח מוצר חדש בתחום הביוטכנולוגיה או המזון משלב הרעיון ועד היישום תוך שימוש הידע שרכשו בקורסי הבסיס. הצוותים יבצעו פרויקטים אינטגרטיביים שיכללו תיכנון המוצר, סקר ספרות, ניתוח כלכלי, ניתוח השוק, פילוח המתחרים, כתיבת תוכנית עסקית בסיסית. בסוף הפרויקט הסטודנטים יציגו את התוצר בפני מומחים מהתעשייה והאקדמיה. תוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל: 1. להבין את האתגרים בפיתוח מוצר בתחום הביוטכ' והמזון. 2. לתכנן ולבצע ניסוי מדעי באופן עצמאי. 3. לנסח רעיונות ופתרונות בעזרת כלים חשיבתיים. 4. לפתח יכולת עבודה בצוות מקומי או בינלאומי ולפתח כישורי רשתות עסקיות. 5. להציג רעיון בצורה ממוקדת כמו גם סמינר באנגלית למומחים בתחום.",
                    n: 0.096,
                },
            },
        },
        {
            i: 414,
            $: {
                '0': { v: '066015', n: 1 },
                '1': { v: "נושאים נבחרים בהנד. ביוט' ומזון 2", n: 0.408 },
                '2': {
                    v: 'קורס העשרה שמטרתו לחשוף את הסטודנטים לתחום מתקדם שאינו נלמד במקצועות החובה. הקורס יכול להינתן גם על ידי מומחה אורח, ונושאו, מועדו ומבנהו יפורסמו על פי זמינות המרצה, באישור של ועדות הסמכה ומוסמכים בפקולטה, ושל בית הספר לתארים מתקדמים, לפני תחילת הסמסטר ו ינתן הקורס. יינתן הקורס.',
                    n: 0.146,
                },
            },
        },
        {
            i: 415,
            $: {
                '0': { v: '066217', n: 1 },
                '1': { v: 'אריזה וחיי מדף, מזון ומוצרים', n: 0.447 },
                '2': {
                    v: 'מטרת הקורס היא הכרת עקרונות היסוד בתחום האריזה והקשר לחיי מדף של מוצר. הקורס עוסק בתפקידי האריזה, סוגי חומרים לאריזה בדגש על חומרים פלסטיים (כימיה, מבנה ותכונות), מעברי חומר והקשרם לקינטיקה של קלקול חומרים ביולוגיים. נעמוד על השפעות של גורמים חיצוניים על חיי-מדף ונשקלל את מכלול הדרכים להעריך ולהאריך חיי-מדף תוך התחשבות בהיבטים סביבתיים ודרישות רגולטוריות. תוצאות למידה:בסיום הקורס הסטודנט יהיה מסוגל: 1. לתאר תפקידים עיקריים של אריזת מזון וחומרים ביולוגיים.\n2. להכיר מנגנוני סינתזה עיקריים של פולימרים.\n3. להבדיל בין פולימרים תרמולפלסטיים ותרמוסטיים.\n4. להכיר את מבנה הפולימר במצב המוצק, סוגי המעברים התרמיים המתרחשי בפולימרים אמורפיים וגבישיים למחצה ושיטות אפיון.\n5. להכיר את המושגים הבסיסיים בויסקואלסטיות של פולימרים בדגש על תכונות היתך ויכיר את הרלוונטיות של המודלים השכיחים.\n6. לתאר את ההתנהגות המכנית (עקומת מאמץ-מעוות) של פולימרים ויבין את השפעת הזמן והטמפרטורה.\n7. לקשר בין תכונות הפולמר למבנהו ולהסביר את הקשר בין תכונות הפולימר (תרמיות, ריאולוגיות, מכניות) למיקרומבנה הפולימר ולמשקל המולקולרי. להכיר שיטות זיהוי ובחירה של פולימרים. 8. להכיר את מושג הפרמיאביליות, מקדם הפרמיאביליות וגורמים המשפיעים על מקדם זה. לדעת לחשב את ההשפעה של גורמים אלו על חיי המדף של המוצר.\n9. להכיר את תופעת המיגרציה, הגורמים המשפיעים עליה, להבדיל בין מושגים של מיגרציה כללית ומיגרציה ספציפית, כיצד מודדים מיגרציה, ודרישות רגולטריות למגע עם מזון.\n9. להכיר, לדעת ולהעריך את האינטראקציות הרצויות והלא רצויות בין האריזה ומוצרי מזון.\n10. להכיר את ההשפעות הסביבתיות של אריזות מזון, להכיר את הקונספט של הערכת מחזור חיים ( LIFE CYCLE ASSESSMENT ) לאריזת מזון/מוצר.\n11. להכיר את המושגים המשמשים לתיאור חיי מדף שף מזון בתעשייה.\n12. להכיר את הגורמים המרכזיים הגורמים לקלקול מזון ואת השפעות החיצוניות על הקינטיקה שלה.\n13. להכיר ולהחשיב את חיי מדף בתנאים רגילים ומואצים ולהכיר את הקשר ביניהם ואת המגבלות במדידה בתנאים מואצים.',
                    n: 0.061,
                },
            },
        },
        {
            i: 416,
            $: {
                '0': { v: '066230', n: 1 },
                '1': { v: 'הערכת מזון באמצעות החושים', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בעקרונות ובשיטות המשמשים להערכת מזון באמצעות החושים. הבנה בסיסית של מבנה ותפקוד החושים הכימיים וגורמים המשפיעים על פעילותם. יילמדו מבחני חישה ויידונו היכולות והמגבלות של כל אחד מהם. יתורגלו ניתוח סטטיסטי של תוצאות מבחנים והסקת מסקנות בעלות משמעות. לימוד בחירת שופטים ואימונם לשמש בצוותי טעימה. הסטודנטים יתנסו בביצוע מבחני חישה, ניתוח התוצאות והסקת מסקנות וכן לקיחת חלק בתכנון מבחן חישה.',
                    n: 0.127,
                },
            },
        },
        {
            i: 417,
            $: {
                '0': { v: '066247', n: 1 },
                '1': { v: "חומרים מתקדמים לביוטכ' ומזון", n: 0.5 },
                '2': {
                    v: 'חומרים חדישים והשימוש שלהם בתעשיית הביוטכנולוגיה והמזון.סקירה של קבוצות החומרים העיקריות בתעשייה תוך התמקדותבאיפיון שלהם ובשיטות המגוונות להשפיע על תכונותיהם. התמקדות בחומרים מרוכבים, חומרים בהשראת הטבע, חומרים חכמים, חומרים אנטי בקטריאלים ובעלי פני שטח פעילים. תוצאות למידה:בסיום הקורס הסטודנטים: 1. יכירו את קבוצות החומרים העיקריות בתעשיית המזון והתרופות וידעו לאפיין אותם. 2. יבינו כיצד חומרים דומים יכולים להיות בעלי שימושים שונים. 3. יכירו שיטות מתקדמות לעיבוד חומרים אכילים לתעשיות המזון והתרופות. 4. יבינו את חשיבות המחקר לפיתוח חומרים חדישים בתעשיות המזון והתרופות.',
                    n: 0.11,
                },
            },
        },
        {
            i: 418,
            $: {
                '0': { v: '066327', n: 1 },
                '1': { v: 'שיטות פיסקליות לאפיון ביומולקולות', n: 0.5 },
                '2': {
                    v: 'עקרונות ויישומים של שיטות פיסיקליות לחקר חומרים רכים, בין היתר מולקולות ביולוגיות ומקרומולקולות. השיטות כוללות מיקרוסקופיה וקלורימטריה. שיטות אלו מאפשרות לחקור מצבי אנרגיה, מבנה (צורה, גודל וקונפורמציה), תכונות, פעילות, ואינטראקציות בין מולקולות.\nתוצאות למידה: בסיום הקורס הסטודנט יכיר את עקרונות הפעולה של השיטות, יוכל לדעת אילו שאלות מדעיות ניתן לפתוח בעזרת שיטות אלו, יוכל לנתח נכון תוצאות נסיוניות וידע לבחון באופן בקורתי מידע מהספרות.',
                    n: 0.126,
                },
            },
        },
        {
            i: 419,
            $: {
                '0': { v: '066418', n: 1 },
                '1': { v: 'מיקרוביולוגיה של פתוגנים', n: 0.577 },
                '2': {
                    v: 'פיזיולוגיה של מיקרואורגניזמים פתוגנים לאדם שמקורם במזון ובמים:חיידקים, עובשים ווירוסים. אפיון מנגנונים מולקולריים הקשורים בפתוגניות: היצמדות, חדירה לרקמה, הרס תאים ודרכי התגוננות מפני מערכת החיסון. הסיבות להופעת פתוגנים חדשים, או רכישה של תכונות פתוגניות על ידי מיקרואורגניזמים המוכרים כבלתי אלימים. שיטות זיהוי קונבנציונליות ומולקולריות. מנגנוני פעולה של חומרים אנטיבקטריאליים ורכישת עמידות. מודלים מתמטיים להערכת סיכון.',
                    n: 0.135,
                },
            },
        },
        {
            i: 420,
            $: {
                '0': { v: '066521', n: 1 },
                '1': { v: 'הנדסת רקמות', n: 0.707 },
                '2': {
                    v: 'פולימרים להנדסת רקמות וסינתזה של אלה המשמשים להנדסת רקמות, פולימרים סינתטיים וטבעיים, אפיון הפולימרים, פולימרים דו ותלת ממדיים, תאים בהנדסת רקמות, שיטות זריעה של תאים על גבי פולימרים, זריעה דינמית וסטטית ביוראקטורים לגידול תרביות תאים אנימליים, אינטראקציות בין תאים למטריצות פולימריות, הנדסת תאים ואברים, איברים מלאכותיים ומהונדסים, הנדסת רקמות המבוססת על החדרת גנים לתאים.',
                    n: 0.136,
                },
            },
        },
        {
            i: 421,
            $: {
                '0': { v: '066524', n: 1 },
                '1': { v: 'ביוטכנולוגיה של פפטידים', n: 0.577 },
                '2': {
                    v: 'ביוכימיה של פפטידים: תכונות כימיות ופיזיקליות, שיטות ביוטכנולוגיות וכימיות לייצור פפטידים ולבקרתם וכן שיטות לאפיון מבנה ופעילות. התמקדות בפפטידים אנטימיקרוביאליים ותפקידם בלחימה בעמידות לאנטיביוטיקה: מנגנונים לפיתוח עמידות, אינטראקציה עם ממברנות, מנגנון הפעולה האנטימיקרוביאלי, השפעות פיזיולוגיות וטוקסיקולוגיות, יחסי מבנה-פעילות ויישומים שונים.',
                    n: 0.158,
                },
            },
        },
        {
            i: 422,
            $: {
                '0': { v: '066525', n: 1 },
                '1': { v: 'יזמות בהנדסת ביוטכנולוגיה ומזון', n: 0.5 },
                '2': {
                    v: 'מסחור מחקר בתעשיית הפרמצאוטיקה וחברות הזנק ביוטכנולוגיות. תרופות גנריות, תקנות IND, NDA, ANDA, DMF והכנה ל-FDA) מערכות איכות (PCG, PLG, PMGC, PMG), פטנטים וקניין רוחני, העברת טכנולוגיות, החברה, השוק, שיווק וייצור.',
                    n: 0.18,
                },
            },
        },
        {
            i: 423,
            $: {
                '0': { v: '066529', n: 1 },
                '1': { v: 'ביואינפורמטיקה של סרטן', n: 0.577 },
                '2': {
                    v: 'המהפכה בטכנולוגיה של הריצוף הגנטי בעשור האחרון, איפשרה ריצוף גנטי של עשרות אלפי גידולים סרטניים, הן של הדנ"א והן של הרנ"א שלהם. יוזמות ריצוף גדולות כגון THE CANCER GENOME ATLAS (TCGA), חוללו מהפכה בהבנתנו את הביולוגיה של הסרטן, ובטיפול לו זוכים החולים. בקורס הסטודנטים יקבלו הקדמה קצרה על התפתחות גידולים סרטניים וסקירה של הטכנולוגיות החדישות ( NEXT GENERATION SEQUENCING - NGS ) של ריצוף גנטי של דנ"א ורנ"א. יינתן דגש כיצד ניתן יהיה להשתמש בטכנולוגיות הללו ובמסקנותיהן לצורך רפואה מותאמת אישית. תוצאות למידה: בסיום הקורס הסטודנטים:\n1. יבינו את הבסיס של הכלים הביואינפורמטיקאים הנצרכים לצורך ניתוח של המידע המתקבל ממכשירי הריצוף.\n2. ירכשו יכולת שימוש בכלים החישוביים הללו בסוגים שונים של דאטה.',
                    n: 0.095,
                },
            },
        },
        {
            i: 424,
            $: {
                '0': { v: '066533', n: 1 },
                '1': { v: 'לקראת תאים סינטטיים', n: 0.577 },
                '2': {
                    v: 'מהן הדרישות המינימאליות לבניית תא חי, האם ניתן להשתמש באבני בניין ביולוגייםכמו DNA, פוספוליפידים, מקרומולקולות, להרכבת תאים מלאכותיים המסוגלים לשכפל עצמם ולהציג מאפיינים מהותיים של חומר חי. האם הגענו להבנה מספקת של התא כדי ליצור גרסאות מלאכותיות שלו. האם נוכל להנדס מערכות סינתטיות המשמרות את תכונות החיים בארכיטקטורות שונות בתכלית והאם נוכל להשתמש בעקרונות הביולוגים הקיימים ע"מ להקנות לביולוגיה התאית יכולות חדשות. שאלות אלו עומדות בחזית התחום העוסק בהרכבת תאים מלאכותיים בגישת מן החלק אל השלם (BOTTOM-UP). מטרת הקורס היא להציג את תחום התאים המלאכותיים ואת התפתחותו המהירה בשנים האחרונות. נציג את המודולים החיוניים ששוחזרו על פלטפורמות סינתטיות, כגון ביטוי גנים ללא תאים, שכפול DNA, עיטוף ממברנלי, ייצור אנרגיה, ועוד. כמו כן נחקור עיצובי תאים דמיוניים המאתגרים את התפיסה המסורתית של מה שניתן להתייחס אליו כאל "ת א", נבחן תקשורת בין תאים מלאכותיים והתנהגויות קולקטיביות של רקמות סינתטיות.__\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להכיר את תחום הרכבת תאים מלאכותיים מן החלק אל השלם(BOTTOM-UP) בדגש על התפתחות התחום והישגי העבר._\n2. לזהות את ההבדלים והמגבלות העיקריים בשימוש בתאים מלאכותיים לבין תאים טבעיים, תוך הגדרת האתגרים העתידיים בתחום.__\n3. להכיר את שיטות הניסוי הנהוגות בתחום.__\n4. לדעת לבצע אומדנים מספריים על מערכות ביולוגיות, כמו גם מודלים כמותיים פשוטים.__\n5. לדעת לקרוא ביעילות מאמר מדעי.\n6. לפתח מיומנויות הצגה מדעית.',
                    n: 0.07,
                },
            },
        },
        {
            i: 425,
            $: {
                '0': { v: '068006', n: 1 },
                '1': { v: 'פרויקט מיוחד', n: 0.707 },
                '2': {
                    v: 'במסגרת קורס זה יכין הסטודנט עבודה עצמית בנושא ספציפי ומוגדר באחד משטחי ההנדסה, הטכנולוגיה או המדעים. הערה: מקצוע זה יאושר רק במקרים מיוחדים על מנת לאפשר לסטודנטים להם חסרה נקודה אחת (או פחות) לסיים את לימודיהם.',
                    n: 0.167,
                },
            },
        },
        {
            i: 426,
            $: {
                '0': { v: '068009', n: 1 },
                '1': { v: 'סמינר מתקדם בהנדסת מזון', n: 0.5 },
                '2': {
                    v: 'הקורס מיועד למסלול מגיסטר להנדסה בלבד (מגיסטר ללא תיזה). תבוצע עבודה סמינריונית בנושא הקשור במחקר מעבדתי, או בפרויקט תכנון או בסקר ספרות בקורתי.',
                    n: 0.209,
                },
            },
        },
        {
            i: 427,
            $: {
                '0': { v: '068509', n: 1 },
                '1': { v: 'תהליכי יסוד בביוטכנולוגיה', n: 0.577 },
                '2': {
                    v: 'גידול מיקרוביאלי: תיאור כימי, שיטות מדידה, קינטיקה, קבלת תוצרים. הרכב ותכנון של מצעי גידול תאוריה וישום של תרבית רציפה. פרודקטיבות בתהליך רציף ומנתי. מעבר חמצן בראקטורים ביולוגים: שיטות מדידה והקשר בין הספק וקבוע מעבר החמצן, עיקור וגימלון של ריאקטורים ביולוגים. ניתוח פרמנטציות: אנטיביוטיקות אנזימים, חומצות אורגניות ויטמנים פולסכירידים חלבונים רקומביננטים ותאים אנימלים.',
                    n: 0.139,
                },
            },
        },
        {
            i: 428,
            $: {
                '0': { v: '084154', n: 1 },
                '1': { v: 'שיטות ניסוי בהנדסה אוירונוטית', n: 0.5 },
                '2': {
                    v: 'כל סטודנט שנרשם לקורס זה - חייב להיות במצב אקדמי תקין. הקורס מיועד להכיר לסטודנטים בלימודי הסמכה שיטות ניסוי, מדידים, ומערכות רכישת נתונים ממוחשבות ע"י הצגת שיטות מדידה ויסודות הפעולה הבסיסיים ביישומי הנדסת אוירונוטיקה וחלל.',
                    n: 0.169,
                },
            },
        },
        {
            i: 429,
            $: {
                '0': { v: '084213', n: 1 },
                '1': { v: 'תרמודינמיקה', n: 1 },
                '2': {
                    v: 'מבוא ומונחים תרמודינמיים. משוואות מצב, תכונות גזים משוכללים, תכונות חומרים ממשיים בפזות השונות. ,תהליכים תרמודינמיים. עבודה, חום ואנרגיה. החוק הראשון ומסקנות מהחוק הראשון. מחזור קרנו, נצילות תרמודינמית. אנתלפיה, מערכות פתוחות. החוק השני, תהליכים הפיכים ובלתי הפיכים, אי-שוויון קלאוזיוס, אנטרופיה, שילוב החוק הראשון והשני. מכונות חום: מחזור אוטו, דיזל, ברייטון. תערובות גזים. הולכת חום.',
                    n: 0.137,
                },
            },
        },
        {
            i: 430,
            $: {
                '0': { v: '084220', n: 1 },
                '1': { v: 'מכניקת הטיס 1', n: 0.577 },
                '2': {
                    v: 'משוואות התנועה של מטוס כנקודת מסה. אטמוספרה סטנדרטית ומערכת פיטו-סטטית. כוחות אווירודינאמיים, דחף וצריכת דלק של מנועי סילון ושל מנועי מדחף. ניתוח ביצועים של מטוס: טיסה ישרה ואופקית, טווח ושהייה, גלישה, טיפוס, פניה, המראה ונחיתה. מעטפת טיסה. אנרגיה סגולית כמשתנה מצב.',
                    n: 0.156,
                },
            },
        },
        {
            i: 431,
            $: {
                '0': { v: '084225', n: 1 },
                '1': { v: 'דינמיקה', n: 1 },
                '2': {
                    v: "קינמטיקה של חלקיקים במערכות ייחוס אינרציאליות ומואצות, עבודה, אנרגיה, תקיפה ותנע, תנועות פלנטריות, מערכת חלקיקים, קינמטיקה של גוף קשיח, טנסור האינרציה, משואות אוילר, תנועה ג'ירוסקופית, יציבות, תהודה וריסון, משואות לאגרנז'.",
                    n: 0.183,
                },
            },
        },
        {
            i: 432,
            $: {
                '0': { v: '084312', n: 1 },
                '1': { v: 'זרימה דחיסה, כונסים ונחירים', n: 0.5 },
                '2': {
                    v: 'משוואות שימור אינטגרליות בזרימה חד-מימדית דחיסה. זרימה איזנטרופית. גלי הלם ניצבים. זרימה בנחיר. זרימה בכונס. זרימה בצינור עם מעבר חום (זרימת ריילי) ועם שינוי תנע (זרימת פנו). גלי הלם נעים ושפופרות הלם. גלים משופעים. מניפות התפשטות. גלים חלשים: קרובים מסדר ראשון ושני. תורת חתך הכנף בזרימה על-קולית. משוואת הפוטנציאל בזרימה דחיסה. חוקי דמיות על ותת קוליים. מספר מאך קריטי.',
                    n: 0.13,
                },
            },
        },
        {
            i: 433,
            $: {
                '0': { v: '084314', n: 1 },
                '1': { v: 'זרימה צמיגה ומעבר חום', n: 0.5 },
                '2': {
                    v: 'משוואות הרציפות ונוויה - סטוקס, פתרונות מדויקים למשוואות נוויה- סטוקס, שכבות גבול למינריות בזרימה דו-מימדית, פתרונות דמיות, פתרונות אינטגרלים מקורבים, תופעת הניתוק, מבוא לזרימה טורבולנטית, שכבות גבול טורבולנטיות, גרר חיכוך וצורה, סילונים ועקבות, מעבר חום בהולכה חד ודו-מימדית, צלעות, הולכה לא תמידית, הסעת חם, משוואת האנרגיה, שכבות גבול תרמיות, אנלוגיית ריינולדס, מבוא לקרינה, ניסויי מעבדה.',
                    n: 0.135,
                },
            },
        },
        {
            i: 434,
            $: {
                '0': { v: '084641', n: 1 },
                '1': { v: 'תכן הנ. וייצור של מערכות תעופתיות', n: 0.408 },
                '2': {
                    v: 'לימוד שיטות לתכן מפורט של רכיבים מכניים ע"י שימוש בקריטריוני כשל של חומרים משיכים ופריכים תחת עומס סטטי ודינמי (התעייפות). בחירת מאמצים מותרים, מקדמי בטחון והקשר שבין מקדמי בטחון לאמינות. יישום התיאוריות לתכן רכיבים כגון גלים, ברגי הנעה ומחברי ברגים ומסמרות. הכרה של תהליכי ייצור חשובים בתחום התעופה ובחירת חומרים לשימושים תעופתיים. הקשר שבין החומר, תהליך הייצור והתכן. אופטימיזציה ופתרון בעיות איטרטיבי בתכן.',
                    n: 0.126,
                },
            },
        },
        {
            i: 435,
            $: {
                '0': { v: '084651', n: 1 },
                '1': { v: 'פרויקט תכן 51-פ.אסטרונוטיקה(חורף)', n: 0.577 },
                '2': { v: 'ראה קורס פרויקט תכן 084653.', n: 0.447 },
            },
        },
        {
            i: 436,
            $: {
                '0': { v: '084653', n: 1 },
                '1': { v: 'פרויקט תכן 53-פ.אווירונוטיקה-חורף', n: 0.577 },
                '2': {
                    v: 'בשנה האקדמית האחרונה ללימודיו בוחר כל סטודנט בפרויקט תכן דו-סמסטריאלי. הפרויקט יהיה בתחום הנדסת אוירונוטיקה וחלל ויעסוק בנושאים הקשורים לכלי טייס ולוינים ומערכותיהם, מנועים רקטיים וסילוניים, מערכות שגור, מערכות תחזוקה תעופתיות, ונושאים אחרים, כפי שיוגדרו מדי פעם. לכל פרויקט יקבע מספר מזהה עם הגדרתו. הפרויקט יתבסס על סינטזה של ידע בתחומים שונים וידרוש עמידה במפרט קבוע מראש ובמעטפת בצועים נתונה. הפרויקט כולל תכן ראשוני עד להקפאת התכנון, שיבוצע בסמסטר הראשון. הסמסטר השני יוקדש לתכן מפורט של המערכת (או חלק ממנה). הפרויקט הגמור כולל מפרט, הצגת הפתרון, הצגת הביצועים, ביצוע ניסויים,יצור מודלים ודווח מפורט. הפרויקט יתבצע בפקולטה או בתעשיה. ההוראה בפרויקט מורכבת מהרצאות ומעבודה עצמית בהנחית חבר סגל או מורה נספח. הסטודנט מודרך בארגון ובגבוש דרך פתרון, לוח זמנים, שקולי אלטרנטיבות, היקף, שמוש באמצעי עזר, קטלוגים ויעוץ, ודווח בכתב ובעל פה.',
                    n: 0.088,
                },
            },
        },
        {
            i: 437,
            $: {
                '0': { v: '084738', n: 1 },
                '1': { v: 'תורת הבקרה', n: 0.707 },
                '2': {
                    v: 'מערכות משוב ויתרונן, ביצועי מצב מתמיד-סוג המערכת ומקדמי שגיאה, בקר יחסי-נגזרת-אינטגרלי( PID ), שיטת ( RL ) ROOT LOCUS, כולל ZERO-ANGLE RL ו- ROOT CONTOUR,תכן בקרים בשיטת RL, קריטריון היציבות של נייקויסט, שולי יציבות, תכן בקרים ורשתות תיקון בתחום התדר ( BODE ), הצבת קטבים. ניסויי מעבדה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 438,
            $: {
                '0': { v: '084913', n: 1 },
                '1': { v: 'יסודות הנדסת חלל', n: 0.577 },
                '2': {
                    v: 'סביבת החלל, משימות בחלל, יישומים לחישה מרחוק ותקשורת, מערכות עיקריות של רכבי חלל, משגרים, דינמיקת מסלולים, תנועה בשדה כובד מרכזי, מיקום במסלול כפונקציה של הזמן, פרמטרי מסלול תלת- ממדים ומערכות יחוס, הפרעת J2, הנעה בחלל, מעברים בין מסלולים, דינמיקה זוויתית של לוויין, ייצוב זוויתי בעזרת גרדיאנט שדה הכבידה, בקרה באמצעות גלגלי תנופה, מערכות הספק חשמלי, בקרה תרמית.',
                    n: 0.132,
                },
            },
        },
        {
            i: 439,
            $: {
                '0': { v: '085101', n: 1 },
                '1': { v: 'תעופה ספורטיבית 1', n: 0.577 },
                '2': {
                    v: '(מקצוע בחירה חופשית).\nבנית מודלים של כלי טיס לפי כללי הנדסה והטסתם.',
                    n: 0.302,
                },
            },
        },
        {
            i: 440,
            $: {
                '0': { v: '085102', n: 1 },
                '1': { v: 'תעופה ספורטיבית 2', n: 0.577 },
                '2': { v: 'ראה 085101.', n: 0.707 },
            },
        },
        {
            i: 441,
            $: {
                '0': { v: '085156', n: 1 },
                '1': { v: 'פרויקט ניסוי', n: 0.707 },
                '2': {
                    v: 'מעבדות פרוייקטים לפי בחירת הסטודנט.',
                    n: 0.447,
                },
            },
        },
        {
            i: 442,
            $: {
                '0': { v: '085220', n: 1 },
                '1': { v: 'מעבדה במכניקת הטיס', n: 0.577 },
                '2': {
                    v: 'הקורס יכלול מספר פרויקטים עיוניים ומספר פרויקטים ניסויים. הפרויקטים העיוניים יעסקו בהערכה של נגזרות יציבות ומקדמים אווירודינמיים של מטוס קל (כגון צסנה 172), ובהמשך, בהערכה של ביצועי טיסה ותכונות טיסה שלו. הפרויקטים הניסויים יוקדשו לאימות ההערכות התיאורטיות בניסויי טיסה.',
                    n: 0.16,
                },
            },
        },
        {
            i: 443,
            $: {
                '0': { v: '085305', n: 1 },
                '1': { v: 'מעבדה באוירודינמיקה', n: 0.707 },
                '2': {
                    v: 'א. הרצאות הדגמות - מנהרת רוח, מדי מהירות בשיטת התייל החם, המחשת זרימה, שימוש במחשב, מאזניים, תיקוני מנהרה, בדיקות דינמיות, מכשור מיוחד. ב. ניסויי מעבדה - 3 ניסויי מעבדה בהנחיית מדריך וניסוי עצמאי שבמסגרתו ידרש הסטודנט לתכנן את הניסוי.',
                    n: 0.16,
                },
            },
        },
        {
            i: 444,
            $: {
                '0': { v: '085405', n: 1 },
                '1': { v: 'מעבדה בהנעה ושריפה', n: 0.577 },
                '2': {
                    v: 'ירי סטטי של מנוע רקטי עם הודף מוצק: תלות קצב הבעירה בלחץ, בטמפרטורה ההתחלתית ובסוג ההודף, חישוב מהירות אופיינית ותקיפה סגולית. מנועי סילון: שיטות איפיון ביצועי מנועים, השפעת סיבובי מנוע (סל"ד) על הביצועים, ביצועי נחירים. מבנה להבה: ניסוי במבער הפועל עם דלק גזי: מדידת טמפרטורה והרכב תוצרי השריפה, חישוב נצילות הבעירה.',
                    n: 0.14,
                },
            },
        },
        {
            i: 445,
            $: {
                '0': { v: '085640', n: 1 },
                '1': { v: 'תמיכה כוללת במוצר למע. אויר חלל', n: 0.408 },
                '2': {
                    v: 'מרכיבי התכ"ם, יסודות הנדסת תחזוקה, ניתוחי הנדסת תחזוקה, גיבוש מדיניות אחזקה למערכת, נת"ת- ניתוחי תמיכה תחזוקתית LSA,ניתוחי רמות אחזקה LORA, ניתוחי הנדסת אחזקה MEA,הכנת תוכנית תכ"ם לפרויקט ILSP, ציוד בדיקה, ציוד תפעול ותחזוקה, רכש והצטיידות ראשונית אופטימאלית בחלפים, אומדן עלות מחזור חיים LCC, תמיכה בשירות המבצעי, שירות לקוחות, הוצאה מהשירות.',
                    n: 0.141,
                },
            },
        },
        {
            i: 446,
            $: {
                '0': { v: '085801', n: 1 },
                '1': { v: 'סמינריון בנושא זרימה', n: 0.577 },
                '2': {
                    v: 'סמינריון בתחום הזרימה הכולל לימוד הכנת מצגות אקדמיות, סקרי ספרות, הצעות מחקר, הכנת דו"חות טכניים והרצאות, מצגות בכנסים, ומיומנויות של תקשורת מילולית וכתיבה טכנית. המקצוע מיועד לסטודנטים בהנדסת אוירונוטיקה וחלל שצברו 120 נק\' ומעלה.',
                    n: 0.171,
                },
            },
        },
        {
            i: 447,
            $: {
                '0': { v: '085803', n: 1 },
                '1': { v: 'סמינריון בנושא הנעה', n: 0.577 },
                '2': {
                    v: 'סמינריון בתחום הנעה הכולל לימוד הכנת מצגות אקדמיות, סקרי ספרות, הצעות מחקר, הכנת דו"חות טכניים והרצאות, מצגות בכנסים, ומיומנויות של תקשורת מילולית וכתיבה טכנית. המקצוע מיועד לסטודנטים בהנדסת אוירונוטיקה וחלל שצברו 120 נק\' ומעלה.',
                    n: 0.171,
                },
            },
        },
        {
            i: 448,
            $: {
                '0': { v: '085804', n: 1 },
                '1': { v: 'סמינריון בנושא בקרה', n: 0.577 },
                '2': {
                    v: 'סמינריון בתחום הבקרה. הכולל לימוד הכנת מצגות אקדמיות, סקרי ספרות, הצעות מחקר, הכנת דו"חות טכניים והרצאות, מצגות בכנסים, ומיומנויות של תקשורת מילולית וכתיבה טכנית. המקצוע מיועד לסטודנטים בהנדסת אוירונוטיקה וחלל שצברו 120 נק\' ומעלה.',
                    n: 0.171,
                },
            },
        },
        {
            i: 449,
            $: {
                '0': { v: '085805', n: 1 },
                '1': { v: 'סמינריון בנושא חלל', n: 0.577 },
                '2': {
                    v: 'סמינריון בתחום החלל. הכולל לימוד הכנת מצגות אקדמיות, סקרי ספרות, הצעות מחקר, הכנת דו"חות טכניים והרצאות, מצגות בכנסים, ומיומנויות של תקשורת מילולית וכתיבה טכנית. המקצוע מיועד לסטודנטים בהנדסת אוירונוטיקה וחלל שצברו 120 נק\' ומעלה.',
                    n: 0.171,
                },
            },
        },
        {
            i: 450,
            $: {
                '0': { v: '085822', n: 1 },
                '1': { v: 'נושאים נבחרים בהנדסת אויר-חלל 2', n: 0.447 },
                '2': {
                    v: 'הקורס יוצע על ידי אורחים בפקולטה בשטחי התמחותם.',
                    n: 0.354,
                },
            },
        },
        {
            i: 451,
            $: {
                '0': { v: '085851', n: 1 },
                '1': { v: 'פרויקט מחקר 1', n: 0.577 },
                '2': {
                    v: 'מקצוע בחירה. מיועד לאמן את הסטודנט המצטיין בביצוע עבודה עצמית בעלת אופי מחקרי ניסויי או תאורטי בשנה האחרונה של לימודיו. הסטודנט יעבוד באופן צמוד לחבר סגל אשר יתן לו נושא לפרויקט. הסטודנט יבצע את המחקר בהדרכת חבר הסגל ויסכם את תוצאותיו בדו"ח סופי שיוגש למנחה. הרשמה באישור מרכז המקצוע בלבד כאשר סף הקבלה למקצוע הוא הצטיינות דיקן. הציון יקבע ע"פ הדוח והמעקב במשך הסמסטר.',
                    n: 0.125,
                },
            },
        },
        {
            i: 452,
            $: {
                '0': { v: '086219', n: 1 },
                '1': { v: 'דינמיקה ואוירודינמיקה  של מסוקים', n: 0.5 },
                '2': {
                    v: 'מבנה המסוק ורכיביו העיקריים, הריחוף והטיסה האנכית, ניתוח הכוחות האוירודינמיים הפועלים על אלמנט להב, מערכות הצירים המשמשות לחישוב הכוחות האוירודינמיים של הרוטור, זוית ההתקפה והנפנוף והשתנותם ההקפית, הכוחות הפועלים על הרוטור בטיסה אנכית ואופקית, טיסת קיזוז, בצועים, בעיות כלליות של מסוקים.',
                    n: 0.156,
                },
            },
        },
        {
            i: 453,
            $: {
                '0': { v: '086222', n: 1 },
                '1': { v: 'ניתוח מערכות משובצות מחשב ותוכנתן', n: 0.447 },
                '2': {
                    v: 'גישות קיימות לניתוח ולהגדרת דרישות של מערכות עתירות תוכנה. השימוש במודלים כבסיס לניתוח מערכות משובצות מחשב. מבוא לניתוח והגדרת דרישות בגישת OBJECT BASED לפי שיטת ECSAM ( EMBEDDED COMPUTER SYSTEMS ANALYSIS AND MODELING ). ניתוח היבטים מבניים וזרימת המידע וכן היבטים דינמיים (התנהגותיים) של מערכות. אימות מודל המערכת, סימולציות ובדיקות סטטיות ודינמיות. ניהול דרישות והכנת מפרטי מערכות משובצות מחשב.',
                    n: 0.13,
                },
            },
        },
        {
            i: 454,
            $: {
                '0': { v: '086289', n: 1 },
                '1': { v: 'בקרת מערכות רבות קלט ופלט', n: 0.447 },
                '2': {
                    v: 'מבוא למערכות רבות משתנים ( MIMO ), תאור מערכות MIMO במישור המצב והתדר, קטבים ואפסים של מטריצות תמסורת, יציבות, בקירות, צפיות, מימוש מאוזן, מימוש מזערי. תכונות מערכות משוב: מוגדרות, יציבות פנימית, קריטריון נייקוויסט מוכלל. דרישות ביצועים של מערכות בקרה MIMO, מגבלות על הביצועים, ערכים סינגולאריים, הגברים ראשיים. שיטות תכנון במשוב מצב: הצבת קטבים, משערכי מצב מסדר מלא ומופחת, בקרים מבוססים על משערכים. בעיית LQR, משוואת ריקטי אלגברית. שימושים ודוגמאות למערכות אוירונוטיות. תוצאות למידה: עם סיום הקורס הסטודנטים יוכלו: 1. לנתח מערכות MIMO בעזרת מטריות תמסורת ובמישור המצב. 2. לנתח ברירות, סטאביליזביליות, צפיות ודטקטאביליות של מערכות MIMO. 3. עבור מערכות לא בקירות ולא צפיות, לחשב את אפסי המערכת. 4. לפתח מימוש מזערי ומאוזן של מערכת. 5. לבחון מוגדרות של מערכת משוב. 6. לבחון יציבות פנימית של מערכת משוב. 7. לשרטט את ההגברים הראשיים של מערכת MIMO ולנתח את תכונותיה. 8. לתכנן בקר MIMO תוך שימוש בגישות של הצבת קטבים ו-LQR.',
                    n: 0.082,
                },
            },
        },
        {
            i: 455,
            $: {
                '0': { v: '086290', n: 1 },
                '1': { v: 'בקרת מסלולי לוויינים', n: 0.577 },
                '2': {
                    v: 'נושאים: יסודות מסלולים, אלמנטי המסלול, הפרעות, תמרונים בסיסיים, ניסוח בעיית בקרת המסלול, בקרת מערכות לינאריות ולא לינאריות, משוואות גאוס. בקרה אופטימלית של לווינים: דחף רציף ופולסים, בקרת זמן החצייה של מסלולים מסונכרני שמש, בקרת הנתיב הקרקעי, בקרת מערכי לווינים, בקרה אוטונומית של מקבץ לווינים, יירוט ומפגש, הנחיית למברט.',
                    n: 0.144,
                },
            },
        },
        {
            i: 456,
            $: {
                '0': { v: '086312', n: 1 },
                '1': { v: 'בקרה לא לינארית', n: 0.577 },
                '2': {
                    v: 'אלמנטים לא ליניאריים, תכונות, קשיים, אתגרים. מערכות מסדר ראשון ושני: ניתוח גאומטרי, מישור הפאזה, נקודות שיווי משקל ויציבותן, ביפורקציה, כאוס. שיטות ליאפונוב לניתוח יציבות: ישירה ועקיפה, יציבות מקומית וגלובאלית, אזור משיכה, חסימות הפתרון, יציבות כניסה למצב, יציבות כניסה- יציאה, יציבות של מערכות משוב: קריטריונים, ייצוגים קנוניים, דרגה יחסית, צורה נורמלית, דינמיקת אפס, שיטות תכן: ליניארזציה מקומית ומיתוג בקרים, ליניאריזציה משוב מלא וחלקי, תכן מדורג BACKSTEPPING, בקרה על משטח החלקה.\nתוצאות למידה: עם סיום הקורס הסטודנטים יוכלו:\n1. לנתח יציבות של מערכות מסדר ראשון ושני בשיטות גרפיות של שדות וקטוריים, מישור הפאזה ודיאגרמות ביפורקציה.\n2. לנתח יציבות של מערכות לא לינארית בשיטות ליאפונוב השונות: יציבות מקומית וגלובאלית, חישוב אזורי משיכה, חסימות פתרון, יציבות בזמן סופי.\n3. לתכנן בקרים לא ליניאריים בשיטות של ליניארזצית משוב מלאה וחלקית, תכן מדורג ובקרה על משטח החלקה.',
                    n: 0.089,
                },
            },
        },
        {
            i: 457,
            $: {
                '0': { v: '086320', n: 1 },
                '1': { v: 'מעבר חום בהנדסת אוירונוטיקה וחלל', n: 0.447 },
                '2': {
                    v: 'נושאים: משוואות מעבר חום. חוק פורייה ובעיות מתקדמות בהולכת חום. עקרונות ההסעה המאולצת. משוואות המומנטום והאנרגיה בשכבות גבול. מעבר חום בזרימה חיצונית ופנימית. משוואות מעבר חום בשכבות גבול דחיסות. הסעה במספרי מאך גבוהים. חימום אווירודינמי. עקרונות הקרינה. מעבר חום בגופים בחלל. הגנה תרמית על טילים בליסטיים כולל אבלציה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 458,
            $: {
                '0': { v: '086325', n: 1 },
                '1': { v: 'דינמיקה ויציבות זרימות רב-פאזיות', n: 0.5 },
                '2': {
                    v: 'אנרגיית פני שטח ומתח פנים, מאמצי מרנגוני, אי-יציבות פלאטו-ריילי, יציבות סילונים ומשטחי זרימה, היווצרות טיפות ובועות, הדינמיקה של זרימות רבודות, אי-יציבות קלוין-הלמהולץ, השפעות תרמו-קפילריות וכימיות, זרימות פאזה פזורה, יציבות זרימות עם חלקיקים.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים: 1. להבין את עקרון אנרגיית פני השטח, מתח פנים ולחץ כתוצאה מעקמומיות. 2. לנסח משוואות זרימה עבור זרימות הנשלטות על ידי פני שטח. 3. לבצע אנליזת מימדים ולהבין את הפרמטרים חסרי הממד המאפיינים בעית זרימה רב-פאזית. 4. לנתח יציבות של סילונים, משטחי זרימה וזרימות רבודות. 5. להבין את המנגנונים העומדים מאחורי הווצרות טיפות ותהליכי ריסוס ולנתח את הדינמיקה של חלקיקים וטיפות בזרימה.',
                    n: 0.1,
                },
            },
        },
        {
            i: 459,
            $: {
                '0': { v: '086380', n: 1 },
                '1': { v: 'מבוא לשכבות גבול', n: 0.577 },
                '2': {
                    v: 'המשוואות השליטות , סוגי שכבות גבול, סימילריות בשכבות גבול, זרימה צמיגה חד מימדית, שכבות גבול בלתי דחיסות, זרימות פלקנר-סקאן, שכבות גבול טורבולנטיות. זרימות צינור ותעלה, ושכבות גבול דחיסות. טרנספורמציות פון-מיזס, מנגלר, הוורט, דורודניטצין סילונים ושובלים.',
                    n: 0.169,
                },
            },
        },
        {
            i: 460,
            $: {
                '0': { v: '086395', n: 1 },
                '1': { v: 'אוירואקוסטיקה של כלי טיס', n: 0.5 },
                '2': {
                    v: 'מושגים בסיסיים באקוסטיקה, מבוא לאנלוגיות אוירואקוסטיות, פיזור של גלי קול ע"י שפות חדות, רעש שפת ההתקפה ושפת הזרימה של כנף, רעש של כנף סובבת, אפקטים של סיבוב (רעש רחב סרט ורעש טונאלי), התקדמות גלי קול בצינור (גל מישורי ומודים אקוסטיים), רעש מדחף עם שרוול, התפשטות גלי קול בזרימה לא אחידה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: להבין את המנגנונים הפיסיקליים של תופעות אווירוקוסטיות. להשתמש באנלוגיות אוירואקוסטיות',
                    n: 0.122,
                },
            },
        },
        {
            i: 461,
            $: {
                '0': { v: '086401', n: 1 },
                '1': { v: 'מער. הנעה לכלי טייס המונעים במדחף', n: 0.408 },
                '2': {
                    v: 'עקרונות של מנועי שריפה פנימית (בוכנה קווית וסובבת, 4 ו-2 פעימות) שיטות שונות של אגירת אנרגיה (סיווג דלקים, מצברים, מערכת פניאומטית, אלסטומרים מפותלים, גלגלי תנופה, קפיצים, חומרים משני פאזה) ניתוח מחזורים אידיאלים ואמתיים, תהליך החלפת גזים וגדישת יתר, הזרקת דלק, הצתה ותהליך הבעירה, אופייני המנוע והתאמתו לאופייני המדחף, השפעת תנאי הגובה על ביצועי המנוע.תוצאות למידה: בסיום הקורס הסטודנט ידע: 1. את הכלים הבסיסיים עבור תכנון מערכת הנעה לכלי טייס המונעים בפרופלור 2. התאמת מערכת הנעה לקבלת ביצועי כלי טייס דרושים .\n3. מדידת מפת הביצועים של מערכת ההנעה. 4. בחירת מערכת טורבו מגדש. 5. הערכת ביצועי כלי טייס בתנאי רום.\n6. בחינת מערכות הזרקת דלק.\n7. בחירת רכיבים להפחתת פליטת תוצרי הפליטה.',
                    n: 0.096,
                },
            },
        },
        {
            i: 462,
            $: {
                '0': { v: '086403', n: 1 },
                '1': { v: 'הנעה רקטית בהודף מוצק', n: 0.5 },
                '2': {
                    v: 'מבוא ועקרונות ההנעה המוצקה, ההודף, חומרי מבנה ובידוד, מעטפת, נחיר, ויסות דחף, הצתה, ייזום וסיום פעולה. תכן מטען ההודף, תכן מבנה ובליסטיקה פנימית. תכן המנוע, הרכב, תכונות וביצועים של הודפים הומוגניים ומרוכבים, שיטות ייצור, בחירת חומרים, בדיקת הודפים, טיפול ואחסון. בעירה ארוזיבית. ויסות וקטור הדחף. מתקני ניסוי. הודפים מוצקים לחלל.\nתוצאות למידה:\nהסטודנטים ירכשו ידע והבנה בכל מה שקשור להנעה רקטית בהודף מוצק, דהיינו: 1. הרכבים שונים של ההודף. 2. גיאומטריות שונות של מטען ההודף, המבנה והבליסטיקה הפנימית. 3. תהליכי ייצור ההודפים, אחסון וטיפול ומתקני ניסוי. 4. מרכיבי המנוע, מעטפת, נחיר, מצתים ועוד. 5. דרכים לוויסות הדחף.',
                    n: 0.103,
                },
            },
        },
        {
            i: 463,
            $: {
                '0': { v: '086520', n: 1 },
                '1': { v: 'בעיות מצומדות בחומרים פונקציונלי', n: 0.5 },
                '2': {
                    v: 'מבוא לסימון טנסורי, יסודות של מכניקה של רצף (מוצק), קינמטיקה של דפורמציות סופיות, חוקים קונסטיטוטיביים עבור חומרים אקטיביים, יסודות של מגנטו-אלסטיות, יסודות של אלקטרו-אלסטיות לא לינארית, מאמץ מקסוול, שילוב לא לינארי בחומרים אקטיביים, יציבות וביפורקציות בחומרים אקטיביים עם מקרו-מבנה (חומרים מרוכבים) תוצאות למידה: בסיום הקורס הסטודנט ידע:\n1. לבצע אנליזה טנסורית 2. ליישם תיאוריות אלסטיות לינאריות בדוגמאות של חומרים פעילים 3. לקרוא ולהבין פרסומים מדעיים מתקדמים על חומרים פעילים 4. ליישם ולהעריך מדדים שונים של מאמצים, עיוותים ועיבורים שונים\n5. למדל ולחזות את התנהגותם של חומרים פעילים 6. להבין שיטות שונות למידול חומרים פעילים 7. כיצד להציג ממצאים מדעיים\n8. להעריך את התגובה המגנטו-מכנית והאלקטרו-מכנית של חומרים פעילים 9. להבין את המשמעות הפיזיקאלית של אי יציבות של חומרים בבעיות מצומדות 10. להכיר את הניסוח המתמטי של ניתוח יציבות של חומרים בבעיות מצומדות',
                    n: 0.088,
                },
            },
        },
        {
            i: 464,
            $: {
                '0': { v: '086574', n: 1 },
                '1': { v: 'אלמנטים סופיים בהנדסה אוירונוטית', n: 0.5 },
                '2': {
                    v: 'שיטת האלמנטים הסופיים לבעיות לינאריות סטטיות במבנים ובמעבר חום. ניסוח ואריאציוני ועבודה וירטואלית, ניסוח גלובלי וברמת האלמנט, פעולות במטריצות, משפחות של אלמנטים סופיים, אינטגרציה נומרית, התכנסות, אספקטים תכנותיים, בעיות ערכים עצמיים - תנודות וקריסה של מבנים. תוצאות למידה: לאחר סיום של הקורס הסטודטים ידעו: 1. להכיר ביתרונות ובחסרונות של שיטת האלמנטים הסופיים יחסית לשיטות נומריות אחרות. 2. להכיר את הבסיס המתמטי של שיטת האלמנטים הסופיים, כך שיוכל להיות משתמש חכם בתוכנת אלמנטים סופיים מסחרית. 3. להכיר מבנה של תוכנית אלמנטים סופיים, כך שיוכל לתכנת קטעי תוכנית בעצמו. 4. להכיר את המקרים בהם השיטה נתקלת בקשיים, ולדעת איך להתגבר על קשיים אלו. 5. להסתכל בצורה ביקורתית על תוצאות של תוכנת אלמנטים הסופיים, ולהבדיל בין שגיאות נומריות לבין שגיאות וטעויות מסוגים שונים. 6. להעריך כמותית את שגיאת האלמנטים הסופיים ואת קצב ההתכנסות.',
                    n: 0.088,
                },
            },
        },
        {
            i: 465,
            $: {
                '0': { v: '086576', n: 1 },
                '1': { v: 'תורת האלסטיות', n: 0.707 },
                '2': {
                    v: 'שיווי משקל, קינמטיקה, אלסטיות לא איזוטרופית, תנאי שפה, בעיות מישוריות בקואורדינטות קרטזיות ופולריות, כוחות מרוכזים, פונקציות עצמיות, בעיות מגע, ניסוח בעיות תרמואלסטיות, אלסטיות תלת-מימדית, סופרפוזיציה, הדדיות, יחודיות, פתרונות כלליים. משפטי אנרגיה, יישומים בתרמואלסטיות, בעיות מאמצים טרמיים בקורות ובטבלות, אלסטודינמיקה ומעבר גלים.',
                    n: 0.156,
                },
            },
        },
        {
            i: 466,
            $: {
                '0': { v: '086733', n: 1 },
                '1': { v: 'תהליכים אקראיים במערכות אויר-חלל', n: 0.5 },
                '2': {
                    v: 'פונקציה אופיינית. וקטור גאוסי. תהליכים אקראיים בזמן בדיד (תהליך IID, ברנולי, מניה בינומי) ובזמן רציף (תהליך פואסון, תהליך וינר) פונקציות אוטוקורלציה וקווריאנס. תהליכי סכום. תהליך גאוסי. תהליכי מרקוב. סטציונריות. פעולות מתמטיות על תהליכים אקראיים: גזירה, אינטגרציה. יחסי קלט-פלט של מערכות לינאריות בתחומי הזמן והתדר ובמרחב המצב. ארגודיות. מבוא לעיבוד אותות אקראיים.',
                    n: 0.14,
                },
            },
        },
        {
            i: 467,
            $: {
                '0': { v: '086761', n: 1 },
                '1': { v: 'ניווט נעזר ראיה ממוחשבת', n: 0.5 },
                '2': {
                    v: 'ניווט אינרציאלי, היתוך מידע הסתברותי ממגוון חיישנים, ניווט מבוסס ראייה ממוחשבת ( VAN ), לוקליזציה ומיפוי ( SLAM ), סיכום מדידות IMU ( IMU PRE-INTEGRATION ), אופטימיזציית BUNDLE ADJUSTMENT תוך שימוש במדידים אינרציאליים ותמונות, ניווט ו-SLAM מרובה פלטפורמות, שיערוך מצב אקטיבי ותכנון תנועה במרחב הסתברותי ( BELIEF SPACE PLANNING ). תוצאות למידה: בסיום הקורס הסטודנט ידע: 1. לפתח ולממש אלגוריתמים בניווט מבוסס ראייה ממוחשבת ו- SLAM 2. לפתח ולממש גישות הסתברותיות להיתוך מידע, ניווט מבוסס ראייה ממוחשבת ו- SLAM בבעיות מרובות פלטפורמה. 3. לממש ולפתור אופטימיזציית BUNDLE ADJUSTMENT תוך שימוש בתמונות אמיתיות. 4. לפתח אלגוריתמים לתכנון במרחב הסתברותי. ) BELIEF SPACE PLANNING (',
                    n: 0.099,
                },
            },
        },
        {
            i: 468,
            $: {
                '0': { v: '086923', n: 1 },
                '1': { v: 'אסטרודינמיקה', n: 1 },
                '2': {
                    v: "מערכות צירים. זמן ותאריך. מכניקה קפלריאנית. משוואות לגארנז'. משוואות גאוס. הסוגריים של לגראנז' ופואסון. המשפט הבסיסי של המיצוע. בקירות ובקרת משוב של מעברי מסלול רציפים. הפרעות כבידה מסדר גבוה. מסלולי הילה. מעברים מכדור הארץ למסלולי הילה. מכניקה אנליטית ויישומיה בחלל. משוואות אוילר-לגראנז' והמילטון. יישומים למכניקת מסלולים ודינמיקה של לווין קשיח.",
                    n: 0.141,
                },
            },
        },
        {
            i: 469,
            $: {
                '0': { v: '088221', n: 1 },
                '1': { v: 'סמינר בהנדסת אוירונוטיקה וחלל 1', n: 0.447 },
                '2': {
                    v: 'השתתפות בסמינרים שבועיים בהם ניתנות הרצאות של חוקרים ומהנדסים בתחומים השונים של הנדסת אוירונוטיקה וחלל. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להרחיב את אופקיום בזכות החשיפה לנושאים רבים ומגוונים בהנדסת אוירונוטיקה וחלל המוצגים ע"י אנשי תעשייה ואקדמיה בארץ ובעולם.\n2. להכיר את נושאי מחקר עכשוויים בדיסציפלינות השונות של הנדסת אוירונוטיקה וחלל. 3. לפתור בעיות פתוחות שעומדות כיום בפני חוקרים ומהנדסים בהנדסת אוירונוטיקה וחלל. 4. להכיר בחשיבות של הצגה נכונה של תוצאות מחקר, ויקבלו מושג על האופן שבו יש לתת הרצאה אפקטיבית. 5. לרכוש רעיונות חדשים שיעזרו במחקר לקראת תואר גבוה. 6. לדעת כיצד להפיק תועלת ועניין מהרצאה גם בנושאים שאינם קרובים לתחומי מחקרם.',
                    n: 0.098,
                },
            },
        },
        {
            i: 470,
            $: {
                '0': { v: '088222', n: 1 },
                '1': { v: 'סמינר בהנדסת אוירונוטיקה וחלל 2', n: 0.447 },
                '2': {
                    v: 'השתתפות בסמינרים שבועיים בהם ניתנות הרצאות של חוקרים ומהנדסים בתחומים השונים של הנדסת אוירונוטיקה וחלל. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להרחיב את אופקיו בזכות החשיפה לנושאים רבים ומגוונים בהנדסת אוירונוטיקה וחלל המוצגים ע"י אנשי תעשייה ואקדמיה בארץ ובעולם.\n2. להכיר את נושאי המחקר עכשוויים בדיסציפלינות השונות של הנדסת אוירונוטיקה וחלל. 3. לפתור בעיות פתוחות שעומדות כיום בפני חוקרים ומהנדסים בהנדסת אוירונוטיקה וחלל. 4. להכיר בחשיבות של הצגה נכונה של תוצאות מחקר, ולקבל מושג על האופן שבו יש לתת הרצאה אפקטיבית.\n5. לרכוש רעיונות חדשים שיעזרו במחקר לקראת תואר גבוה. 6. לדעת כיצד להפיק תועלת ועניין מהרצאה גם בנושאים שאינם קרובים לתחומי מחקרם.',
                    n: 0.099,
                },
            },
        },
        {
            i: 471,
            $: {
                '0': { v: '088223', n: 1 },
                '1': { v: 'סמינר בהנדסת אוירונוטיקה וחלל 3', n: 0.447 },
                '2': {
                    v: 'השתתפות בסמינרים שבועיים בהם ניתנות הרצאות של חוקרים ומהנדסים בתחומים השונים של הנדסת אוירונוטיקה וחלל. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להרחיב את אופקיו בזכות החשיפה לנושאים רבים ומגוונים בהנדסת אוירונוטיקה וחלל המוצגים ע"י אנשי תעשייה ואקדמיה בארץ ובעולם.\n2. להכיר נושאי מחקר עכשוויים בדיסציפלינות השונות של הנדסת אוירונוטיקה וחלל. 3. לפתור בעיות פתוחות שעומדות כיום בפני חוקרים ומהנדסים בהנדסת אוירונוטיקה וחלל. 4. להכיר בחשיבות של הצגה נכונה של תוצאות מחקר, ולקבל מושג על האופן שבו יש לתת הרצאה אפקטיבית. 5. לרכוש רעיונות חדשים שיעזרו במחקר לקראת תואר גבוה. 6. לדעת כיצד להפיק תועלת ועניין מהרצאה גם בנושאים שאינם קרובים לתחומי מחקרם.',
                    n: 0.099,
                },
            },
        },
        {
            i: 472,
            $: {
                '0': { v: '088224', n: 1 },
                '1': { v: 'סמינר בהנדסת אוירונוטיקה וחלל 4', n: 0.447 },
                '2': {
                    v: 'השתתפות בסמינרים שבועיים בהם ניתנות הרצאות של חוקרים ומהנדסים בתחומים השונים של הנדסת אוירונוטיקה וחלל. תוצאות הלמידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להרחיב את אופקיו בזכות החשיפה לנושאים רבים ומגוונים בהנדסת אוירונוטיקה וחלל המוצגים ע"י אנשי תעשייה ואקדמיה בארץ ובעולם.\n2. להכיר נושאי מחקר עכשוויים בדיסציפלינות השונות של הנדסת אוירונוטיקה וחלל. 3. לפתור בעיות פתוחות שעומדות כיום בפני חוקרים ומהנדסים בהנדסת אוירונוטיקה וחלל. 4. להכיר בחשיבות של הצגה נכונה של תוצאות מחקר, ויקבלו מושג על האופן שבו יש לתת הרצאה אפקטיבית.\n5. לרכוש רעיונות חדשים שיעזרו להם במחקר לקראת תואר גבוה. 6. לדעת כיצד להפיק תועלת ועניין מהרצאה גם בנושאים שאינם קרובים לתחומי מחקרם.',
                    n: 0.099,
                },
            },
        },
        {
            i: 473,
            $: {
                '0': { v: '088320', n: 1 },
                '1': { v: 'אוירו-והדרו-דינאמיקה של הנעה בטבע', n: 0.5 },
                '2': {
                    v: 'שחיה בעזרת סנפיר זנב: מגבלת מהירות, נצילות. שחיה על ידי תנועת גוף. יציבות אורכית בציפה ניטרלית, סידור סנפירים. שחיה בעזרת סנפירי חזה. חתירה. אוירודינמיקה של מפרש. הפלגה עם מפרשים: זויות הפלגה מיטביות ביחס לרוח, הפלגה של אוניית מלחמה ספרדית. טיסה עם כנף מנפנפת, מעטפת טיסה לציפור.',
                    n: 0.147,
                },
            },
        },
        {
            i: 474,
            $: {
                '0': { v: '088794', n: 1 },
                '1': { v: 'יסודות בהנדסת מערכות', n: 0.577 },
                '2': {
                    v: 'מבוא להנדסת מערכת, כלי יסוד בהנדסת מערכות. מידול וסימולצית מונטה-קרלו של מערכות. הנדסת מערכת במחזור חיי מוצר. הנדסות תומכות: אמינות ותחזוקתיות.',
                    n: 0.218,
                },
            },
        },
        {
            i: 475,
            $: {
                '0': { v: '088796', n: 1 },
                '1': { v: 'פרויקט סיום בהנדסת מערכות', n: 0.5 },
                '2': {
                    v: 'ביצוע פרויקט סיום למסלול ME בהנדסת מערכות. הפרויקט כולל עבודת צוות להנדסת מערכת של המוצר ולימוד החומר הדרוש לביצועו.',
                    n: 0.229,
                },
            },
        },
        {
            i: 476,
            $: {
                '0': { v: '094101', n: 1 },
                '1': { v: 'מבוא להנדסת תעשייה וניהול', n: 0.5 },
                '2': {
                    v: 'הקורס מציג את מכלול הנושאים בהם מטפל מהנדס תעשיה וניהול תוך הדגשת הנושא של שילוב מערכות בתחומי תכון מוצרים ושירותים, תכון מערכי ייצור ושירות, תכון מערכות מידע, ניהול של שרשרות אספקה, מערכי שירות ועוד. יסקרו שיטות ומודלים בסיסיים כלים לקבלת החלטות וכלי תוכנה התומכים ביישום. לקורס יהיה פרויקט מלווה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 477,
            $: {
                '0': { v: '094142', n: 1 },
                '1': { v: "תפעול מער' ייצור ושרות", n: 0.5 },
                '2': {
                    v: 'סווג מערכות ייצור, מודלים גרפיים ומתמטיים לייצוג מערכות. עקרונות השיבוץ במשטרי FLOW SHOP ו- JOB SHOP. מערכות ייצור המוני ומערכות הרכבה. הדינמיקה של מערכות הייצור: מלאי קריטי וקצב צוואר בקבוק, יחסי הגומלין בין מלאי, קצב תפוקה ומשך שהייה בתהליך. משטר PUSH לעומת PULL - MRP ו- DBR, CONWIP, KANBAN, MRP II.',
                    n: 0.14,
                },
            },
        },
        {
            i: 478,
            $: {
                '0': { v: '094170', n: 1 },
                '1': { v: 'שיטות בהנדסת תעשייה', n: 0.577 },
                '2': {
                    v: 'הקורס דן במגוון שיטות בהנדסת תעשיה. ילמדו טכניקות לחקר תהליכים והצגתם, מדידת עבודה, ניהול רזה, שש סיגמא, פיתוח זריז של תוכנה, ארגונומיה ועקרונות תכנון מוצר. ינתן דגש על יישום השיטות השונות בעזרת אמצעים מתקדמים הכוללים איסוף נתונים אוטומטי בעזרת חיישנים ושימוש באלגוריתמים ומערכות לומדות לצורך ניתוח הנתונים.',
                    n: 0.146,
                },
            },
        },
        {
            i: 479,
            $: {
                '0': { v: '094189', n: 1 },
                '1': { v: 'קדם פרויקט תכן, הנדסת תעו"נ', n: 0.447 },
                '2': {
                    v: 'קבוצות של סטודנטים יכינו הצעות לפרויקט התכן שמטרתו הכנה ליישום ידע וטכניקות שנילמדו במקצועות השונים בפקולטה. הסטודנטים יכינו הצעות פרויקטים שיכללו: סקר ספרות, תיאור המצב הקיים, הגדרת הבעיה, תיאור שיטת העבודה המוצעת לפרויקט, אופציות לפתרון הבעיה והתועלת הפוטנציאלית הצפויה מכך.',
                    n: 0.158,
                },
            },
        },
        {
            i: 480,
            $: {
                '0': { v: '094195', n: 1 },
                '1': { v: 'פרויקט תכן 1, הנ. תעו"נ', n: 0.447 },
                '2': {
                    v: 'סטודנטים יישמו את הידע והטכניקות הנילמדים בקורסים הפקולטיים על בסיס ההצעה שהוכנה בקורס קדם פרוייקט (094189) לשם פתרון בעיה מעשית. הסטודנטים ישובצו לצוותים שיבצעו פרוייקטים אינטגרטיביים שיכללו תכן של מערכת חדשה (או הצעה לשינוי מערכת קיימת) וניתוח כלכלי של עלויות ותועלות של המערכת המוצעת. הציון ייקבע על פי איכות הפיתרון וצורת היישום של הידע והכלים כדי לפתור את הבעיה שהועלתה.',
                    n: 0.129,
                },
            },
        },
        {
            i: 481,
            $: {
                '0': { v: '094197', n: 1 },
                '1': { v: 'פרויקט מחקר סמסטריאלי', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע פרויקט מחקרי בהנחיה של חבר סגל. המנחה יגדיר, ביחד עם הסטודנט ובהתייעצות עם מרצה הקורס, את נושא הפרויקט וכן את היעדים והתוצרים הנדרשים מהסטודנט בסיום הקורס ואשר על בסיסם יקבע ציונו. בסיום הקורס הסטודנט יציג את עבודתו. הערה: ההרשמה פתוחה רק לסטודנטים אשר השלימו 108 נקודות לתואר ודורשת אישור מוקדם של האחראי על המקצוע.',
                    n: 0.134,
                },
            },
        },
        {
            i: 482,
            $: {
                '0': { v: '094198', n: 1 },
                '1': { v: 'אירועים בהנדסת תעשייה', n: 0.577 },
                '2': {
                    v: 'ניתוח ארועים בשטחי הנדסת תעשיה תוך כדי שימוש בטכניקות השונות המקובלות בשטחים אלה. הארועים יוצגו בשני שלבים: א. הצגת הבעיה וניתוחה. ב. סקירת הדרכים האפשריות לפתרון. הסטודנטים יצטרכו לבחור את דרך הפתרון ולהגיש לכל ארוע דו"ח מפורט הכולל את ניתוח הבעייה, דרך תקיפתה והמלצות.',
                    n: 0.151,
                },
            },
        },
        {
            i: 483,
            $: {
                '0': { v: '094219', n: 1 },
                '1': { v: 'הנדסת תוכנה', n: 0.707 },
                '2': {
                    v: 'שיטות תכנות במערכות תוכנה גדולות, מבוא לתכנון ותכנות מונחה עצמים ולימוד שפת תכנות מונחית עצמים. בקורס נלמד שפת JAVA.',
                    n: 0.229,
                },
            },
        },
        {
            i: 484,
            $: {
                '0': { v: '094222', n: 1 },
                '1': { v: 'הנדסת מערכות מבוססת מודלים', n: 0.5 },
                '2': {
                    v: 'הקורס מציג עקרונות ויישומים של הנדסת מערכות מבוססת מודלים, הגישה המודרנית לארכיטקטורה של מערכות המורכבות מאנשים, חומרה ותוכנה מתוך שימוש בתקן OPM ISO-19450 למידול ותכן של מערכות. נושאים מרכזיים: אוביקט, תהליך, מצב, מבנה, התנהגות ופונקציה של מערכת, נהנה, סביבה, ניהול סיבוכיות, ייצוג גרפי וטקסטואלי, יחסים מבניים ותהליכיים, סוכן, מכשיר, הפשטה-עידון.',
                    n: 0.141,
                },
            },
        },
        {
            i: 485,
            $: {
                '0': { v: '094224', n: 1 },
                '1': { v: 'מבני נתונים ואלגוריתמים', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק במושגי יסוד בפיתוח וניתוח של אלגוריתמים ומבני נתונים. נושאים: אלגוריתמי מיון, מבני נתונים יסודיים: מחסנית, תור, עץ חיפוש בינארי, עצים מאוזנים, ערימה, טבלאות גיבוב,שיטות הסתברותיות בתכנון מבני נתונים כולל פונקציות גיבוב אוניברסליות, אלגוריתמים בסיסיים בגרפים: סריקות, מסלולים קצרים ביותר, עץ פורש מינימום, תכנות דינמי.',
                    n: 0.147,
                },
            },
        },
        {
            i: 486,
            $: {
                '0': { v: '094241', n: 1 },
                '1': { v: 'ניהול מסדי נתונים', n: 0.577 },
                '2': {
                    v: 'בקורס נלמדים נושאים בסיסיים בניהול מסדי נתונים יחסיים, כולל תיכון באמצעות ERD ונירמול, שאילתות בשפת SQL ומבוא לניהול תנועות. הסטודנט יתנסה בפיתוח ובניית מסד נתונים.',
                    n: 0.2,
                },
            },
        },
        {
            i: 487,
            $: {
                '0': { v: '094290', n: 1 },
                '1': { v: 'מעבדה באיסוף וניהול נתונים', n: 0.5 },
                '2': {
                    v: 'קביעת הציון על פי מעקב במהלך הסמסטר והגשת דו"חות דו-שבועית. המעבדה מכסה את הנושאים הבאים: איסוף נתונים מסנסורים, השמטת נתונים מושכלת, קריאת קובץ פלט ופיצולו לזרמי מאורעות, ניקוי נתונים, שמירת נתונים בענן, שמירת ואחזור נתונים ממסד NOSQL, MAP-REDUCE, ו-HADOOP.',
                    n: 0.16,
                },
            },
        },
        {
            i: 488,
            $: {
                '0': { v: '094313', n: 1 },
                '1': { v: 'מודלים דטרמיניסטים בחקר ביצועים', n: 0.5 },
                '2': {
                    v: 'מתודולוגיה של חקר ביצועים. תכנון לינארי. ניסוח בעיות שונות כבעיות בתכנון לינארי. אלגוריתמים לפתרון בעיות ת"ל, דואליות וניתוח פוסט-אופטימלי. תכנון בשלמים ושיטות סיעוף וחתכים. זרימה ברשתות, תורת המשחקים. תכנון דינמי. הערה: סך כל שעות הרצאה בשבוע - 2.5 שעות.',
                    n: 0.16,
                },
            },
        },
        {
            i: 489,
            $: {
                '0': { v: '094314', n: 1 },
                '1': { v: 'מודלים סטוכסטיים בחקר בצועים', n: 0.5 },
                '2': {
                    v: "קורס זה עוסק בבנית מודלים מתמטיים של מערכות סטוכסטיות וכולל את מושגי היסוד של תורת התהליכים הסטוכסטיים. הקורס מתרכז בנושאים הבאים: שרשרות מרקוב, תהליכי פואסון והכללותיהם ותהליכי קפיצה מרקוביים (תהליכי לידה ומוות, תהליכי תורים מרקובים וכו').",
                    n: 0.167,
                },
            },
        },
        {
            i: 490,
            $: {
                '0': { v: '094333', n: 1 },
                '1': { v: 'מודלים דינמיים בחקר ביצועים', n: 0.5 },
                '2': {
                    v: 'הערה: סך כל שעות הרצאה בשבוע - 2.5 שעות. משוואות הפרשים לינאריות עם מקדמים קבועים. מערכות משואות הפרשים לינאריות עם מקדמים קבועים. משואות ומערכות דיפרנציאליות לינאריות עם מקדמים קבועים. מבוא לתכנות דינמי. מבוא לתכנות בשלמים. מערכות יונימודולריות ושימושיהן. שיטת חתכי גומורי. שיטת סעף וחסום ויישומים.',
                    n: 0.149,
                },
            },
        },
        {
            i: 491,
            $: {
                '0': { v: '094334', n: 1 },
                '1': { v: 'סימולציה-מידול, ניתוח ויישומים', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד בסימולציה, הגרלת משתנים, נתוח הקלט, תהליך ניתוח סימולטיבי, גישות למידול, בעיות סימולציה דינמית, שיטות להקטנת השונות, תכנון ריצות סימולציה, שיטות ניקוד ואופטימיזציה בעזרת סימולציה. המעבדה ניתנת במרוכז (5+3 ש"ש) בשלושה שבועות הראשונים בכל סמסטר.',
                    n: 0.167,
                },
            },
        },
        {
            i: 492,
            $: {
                '0': { v: '094345', n: 1 },
                '1': { v: "מתמטיקה דיסקרטית ת'", n: 0.577 },
                '2': {
                    v: 'מושגי יסוד בלוגיקה ושיטות הוכחה מתמטיות. תורת הקבוצות: הגדרות בסיסיות, יחסים, יחס שקילות, יחס סדר, פונקציות עוצמת קבוצות ומספרים קרדינליים, שיטת הליכסון של קנטור. קומבינטוריקה: עקרונות ספירה בסיסיים, הבינום של ניוטון, עיקרון ההכלה וההפרדה, משוואות נסיגה.',
                    n: 0.167,
                },
            },
        },
        {
            i: 493,
            $: {
                '0': { v: '094395', n: 1 },
                '1': { v: 'קדם פרויקט תכן, הנדסת מ"מ', n: 0.447 },
                '2': {
                    v: 'קבוצות של סטודנטים יכינו הצעות לפרויקט התכן שמטרתו יישום ידע, טכניקות ויכולות שנלמדו ופותחו במקצועות התואר (כולל היכולת ללמידה עצמית, לעבודה בקבוצות). הצעות הפרויקט תכלולנה בין השאר סקר ספרות, תיאור המצב הקיים, הגדרת הבעיה, תיאור שיטת העבודה המוצעת לפרויקט, הכלים שידרשו, הקשיים, השוואה בין אופציות לפתרון הבעיה והתועלת הפוטנציאלית הצפויה מהפתרון.',
                    n: 0.14,
                },
            },
        },
        {
            i: 494,
            $: {
                '0': { v: '094411', n: 1 },
                '1': { v: "הסתברות ת'", n: 0.707 },
                '2': {
                    v: 'תורת ההסתברות כמודל מתמטי לתופעות מקריות, מרחבי הסתברות, הסתברות מותנית, אי תלות, משתנים מקריים ופונקציות התפלגות, התפלגויות נפוצות בשימושים: בינומית, גיאומטרית פואסונית, אחידה, אקספוננציאלית, גאמא, נורמלית ובאטא. תוחלת ומומנטים. התפלגויות רב ממדיות, קוויריאנס, סטטיסטי הסדר, פונקציות של משתנים מקריים, ההתפלגות הנורמלית הרב מימדית, התמרות ושימושיהן בתורת ההסתברות, סכום של משתנים מקריים, חוק המספרים הגדולים, משפט הגבול המרכזי ושימושו לקרובים.',
                    n: 0.13,
                },
            },
        },
        {
            i: 495,
            $: {
                '0': { v: '094412', n: 1 },
                '1': { v: 'הסתברות מ', n: 0.707 },
                '2': {
                    v: 'תורת ההסתברות כמודל מתמטי לתופעות מקריות, מרחבי הסתברות, הסתברות מותנית, אי תלות, משתנים מקריים ופונקציות התפלגות, התפלגויות נפוצות בשימושים: בינומית, גיאומטרית, פואסונית, אחידה, אקספוננציאלית, גאמא, נורמלית ובאטא. תוחלת ומומנטים. התפלגויות רב ממדיות, קוויריאנס, סטטיסטי הסדר, פונקציות של משתנים מקריים, ההתפלגות הנורמלית הרב מימדית, התמרות ושימושיהן בתורת ההסתברות, סכום של משתנים מקריים, חוק המספרים הגדולים, משפט הגבול המרכזי ושימושו לקרובים.',
                    n: 0.13,
                },
            },
        },
        {
            i: 496,
            $: {
                '0': { v: '094423', n: 1 },
                '1': { v: 'מבוא לסטטיסטיקה', n: 0.707 },
                '2': {
                    v: 'סטטיסטיקה תיאורית ושיטות גרפיות. יסודות דגימה. אמידה נקודתית, רווחי סמך ובדיקת השערות. בדיקת טיב התאמה ואי תלות. רגרסיה לינארית פשוטה ומרובה.',
                    n: 0.218,
                },
            },
        },
        {
            i: 497,
            $: {
                '0': { v: '094424', n: 1 },
                '1': { v: 'סטטיסטיקה 1', n: 0.707 },
                '2': {
                    v: 'סטטיסטיקה תיאורית ושיטות גרפיות. אמידה נקודתית, רווחי סמך ובדיקת השערות. מבחן חי בקיבוע לבדיקת טיב התאמה ואי תלות. רגרסיה לינארית פשוטה. ניתוח סטטיסטי באמצעות R או פיתון.',
                    n: 0.192,
                },
            },
        },
        {
            i: 498,
            $: {
                '0': { v: '094481', n: 1 },
                '1': { v: 'מבוא להסתברות וסטטיסטיקה', n: 0.577 },
                '2': {
                    v: 'החלק הראשון של הקורס מציג מושגים בסיסיים מתורת ההסתברות: חוקי הסתברות בסיסיים, קומבינטוריקה, הסתברות מותנה, משתנים מקריים בדידים ורציפים והתפלגויותיהם, משפט הגבול המרכזי. חלקו השני של הקורס מתמקד בהסקה סטטיסטית וכולל סטטיסטיקה תיאורית, התפלגויות דגימה, אמידה נקודתית ורווחי סמך, בדיקת השערות, מבחני טיב התאמה ואי-תלות, רגרסיה לינארית פשוטה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 499,
            $: {
                '0': { v: '094504', n: 1 },
                '1': { v: 'מיקרו כלכלה 2', n: 0.577 },
                '2': {
                    v: 'תורת הייצור והוצאות הייצור. התנהגות הפירמה בתחרות משוכללת. שווי משקל כללי בתנאי תחרות משוכללת ותכונותיו: שו"מ בתחרות לא משוכללת. מוצרים ציבוריים והשפעות חיצוניות.',
                    n: 0.209,
                },
            },
        },
        {
            i: 500,
            $: {
                '0': { v: '094513', n: 1 },
                '1': { v: 'מאקרו כלכלה', n: 0.707 },
                '2': {
                    v: 'מדידת הפעילות הכלכלית במשק. הביקוש המצרפי על מרכיביו: שוק הסחורות ושוק הכסף, בנית הביקוש המצרפי, שוק העבודה ובנית ההיצע המצרפי. שיווי משקל במשק סגור, הבקוש וההיצע המצרפיים במשק פתוח, שיווי משקל במשק פתוח עם שער חליפין נייד וקבוע.',
                    n: 0.162,
                },
            },
        },
        {
            i: 501,
            $: {
                '0': { v: '094564', n: 1 },
                '1': { v: 'מבוא לניהול פיננסי', n: 0.577 },
                '2': {
                    v: 'חישובים פיננסיים, שימושים פשוטים בהערכת מניות ואג"ח, חישובי הלוואות והצמדה, קריטריונים להערכת השקעות, כדאיות פרויקטים בתנאי וודאות, מבוא למודל CAPM, קביעת מחיר ההון של הפירמה, מבוא לניתוח השקעות בתנאי אי-וודאות. ארביטרז\'.',
                    n: 0.18,
                },
            },
        },
        {
            i: 502,
            $: {
                '0': { v: '094569', n: 1 },
                '1': { v: 'שוק ההון וההשקעות', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק בשווקי ניירות ערך, מודלי תמחור, תיקי השקעות וניהול סיכונים. הקורס מתחיל בשוקי מניות, ניתוח תוחלת-שונות של תיקים, מודל ה- CAPM וה- APT. אחרי כן סוקר הקורס שוקי נגזרים ואג"ח עם הדגשה על ניהול סיכונים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 503,
            $: {
                '0': { v: '094591', n: 1 },
                '1': { v: 'מבוא לכלכלה', n: 0.707 },
                '2': {
                    v: 'בקוש והצע: שווי המשקל בשוק, מדיניות הממשלה בתחום המיקרו והשפעתה על שווי המשקל. פונקצית העלויות וגזירת עקומת ההצע. התנהגות בתנאי שוק שונים: מונופול ותחרות בלתי משוכללת. המשק הלאומי: החשבונות הלאומיים. קביעת התוצר המקומי במשק. שער הריבית והשפעתו על ההשקעה. הבקוש לכסף. הבנקים המסחריים, הבנק המרכזי והצע הכסף. שווי משקל בשוק הכסף ושווי משקל כללי. מדיניות הממשלה בתחום המאקרו והשפעתה על התוצר, שער הריבית ושעור האינפלציה.',
                    n: 0.124,
                },
            },
        },
        {
            i: 504,
            $: {
                '0': { v: '094594', n: 1 },
                '1': { v: 'עקרונות הכלכלה למהנדסים', n: 0.577 },
                '2': {
                    v: 'הקורס מכסה נושאים נבחרים במיקרו ומאקרו כלכלה. בתחום המיקרו נלמד את תורת הצרכן והיצרן, שיווי משקל בשוק משוכלל ובמונופול, התערבות ממשלתית וסחר בינלאומי. בתחום המאקרו נלמד מושגי היסוד בחשבונאות לאומית, תוצר מקומי גולמי (תמ"ג), המודל הקיינסיאני, שוק הכסף ומודל IS-LM.',
                    n: 0.158,
                },
            },
        },
        {
            i: 505,
            $: {
                '0': { v: '094701', n: 1 },
                '1': { v: 'פרויקט מחקרי 1', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע פרויקט מחקרי בהנחיה של חבר סגל. המנחה יגדיר, ביחד עם הסטודנט ובהתייעצות עם מרצה הקורס, את נושא הפרויקט וכן את היעדים והתוצרים הנדרשים מהסטודנט בסיום הקורס ואשר על בסיסם יקבע ציונו. הרשמה פתוחה רק לסטודנטים בתוכנית המצטיינים ובאישור מרצה הקורס. בסיום הקורס הסטודנט יציג את עבודתו.',
                    n: 0.144,
                },
            },
        },
        {
            i: 506,
            $: {
                '0': { v: '094702', n: 1 },
                '1': { v: 'פרויקט מחקרי 2', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע פרויקט מחקרי בהנחיה של חבר סגל. המנחה יגדיר, ביחד עם הסטודנט ובהתייעצות עם מרצה הקורס, את נושא הפרויקט וכן את היעדים והתוצרים הנדרשים מהסטודנט בסיום הקורס ואשר על בסיסם יקבע ציונו. הרשמה פתוחה רק לסטודנטים בתוכנית המצטיינים ובאישור מרצה הקורס. בסיום הקורס הסטודנט יציג את עבודתו.',
                    n: 0.144,
                },
            },
        },
        {
            i: 507,
            $: {
                '0': { v: '094703', n: 1 },
                '1': { v: 'פרויקט מחקרי 3', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע פרויקט מחקרי בהנחיה של חבר סגל. המנחה יגדיר, ביחד עם הסטודנט ובהתייעצות עם מרצה הקורס, את נושא הפרויקט וכן את היעדים והתוצרים הנדרשים מהסטודנט בסיום הקורס ואשר על בסיסם יקבע ציונו. הרשמה פתוחה רק לסטודנטים בתוכנית המצטיינים ובאישור מרצה הקורס. בסיום הקורס הסטודנט יציג את עבודתו.',
                    n: 0.144,
                },
            },
        },
        {
            i: 508,
            $: {
                '0': { v: '094704', n: 1 },
                '1': { v: 'סדנת תכנות בשפת סי', n: 0.5 },
                '2': {
                    v: 'תכנות בשפת סי לאלו שלמדו לתכנת בפייתון. משתנים וטיפוסים. מבני בקרה. פונקציות. מערכים. מצביעים. ניהול זיכרון דינאמי. קלט פלט. מבנים. קריאות למערכת ההפעלה.',
                    n: 0.209,
                },
            },
        },
        {
            i: 509,
            $: {
                '0': { v: '095140', n: 1 },
                '1': { v: 'תכנון פרויקטים וניהולם', n: 0.577 },
                '2': {
                    v: 'בקורס יילמדו מודלים של ייזום, תכנון, ניהול ובקרת פרויקטים בתנאים דטרמיניסטיים או סטוכסטיים ובתוספת של אילוצים ותנאים מיוחדים. הקורס יעסוק בניסוח ופתרון בעיות בשיטות וכלים שונים כגון תכנות מתמטי ליניארי ובשלמים, תכנות דינמי, עצי החלטה הסתברותיים וסימולציה.',
                    n: 0.164,
                },
            },
        },
        {
            i: 510,
            $: {
                '0': { v: '095280', n: 1 },
                '1': { v: 'פרויקט תכן בלמידה חישובית', n: 0.5 },
                '2': {
                    v: 'סקירה של מחקר בנושא נבחר בלמידה חישובית עם דגש על נושאים רלוונטיים למידע מובנה)למשל: למידה עם מבנה, מודלים גרפיים הסתברותיים, רשתות נוירונים ובמיוחד רשתות קונוולוציה ורשתות נשנות). איתור בעית מחקר בהיקף שיכול להוליך למאמר קצר. רשתות קונוולוציה ורשתות נשנות(. איתור בעית מחקר בהיקף שיכול להוליך פיתוח ומימוש אלגוריתמים לפתרון הבעיה. תכנון והרצת ניסויים עם דאטא אמיתי. ניתוח התוצאות וכתיבת דו"ח מסכם.',
                    n: 0.128,
                },
            },
        },
        {
            i: 511,
            $: {
                '0': { v: '095295', n: 1 },
                '1': { v: 'שיטות אלגבריות בהנדסת נתונים', n: 0.5 },
                '2': {
                    v: 'השלמות באלגברה ליניארית )מרחבי מכפלה פנימית, נורמות, בסיסים אורתונורמלים, ערכים), פירוקי מטריצות (משפט הפירוק הספקטרלי), מערכות משוואות ליניאריות (אלמינצית גאוס), ריבועים פחותים, שיטות איטרטיביות (שיטת החזקה), תכנות ליניארי (שיטת הסימפלקס, דואליות, שימושים לסיווג ומציאת פתרונות דלילים למערכות משוואות), משפטי פרטרובציה של פירוקי מטריצות, מבוא לטנזורים.',
                    n: 0.149,
                },
            },
        },
        {
            i: 512,
            $: {
                '0': { v: '095605', n: 1 },
                '1': { v: 'מבוא לפסיכולוגיה', n: 0.707 },
                '2': {
                    v: 'הערה: קביעת הציון עפ"י מעקב , תרגילי בית, בחינת אמצע סמסטר ובחינה סופית. המטרה המרכזית של הקורס היא לבדוק האם ייתכן לבנות מודל הנדסי המאפשר ניבוי של התנהגות אנושית בסביבות עבודה ובמסגרות למידה. לצורך זה הקורס סוקר את הדישות המחקריות הבסיסיות, הממצאים הניסויים הקלאסיים והגישות התיאורטיות המקובלות במדעי ההתנהגות והחברה. נסקור מודלים שמנבאים התנהגויות ברמת הקבוצה והפרט. נדון גם באפשרות של שינוי התנהגות אנושית באמצעות אימון ותמריצים הציון יקבע על בסיס מבחן סיום ופרוייקט.',
                    n: 0.116,
                },
            },
        },
        {
            i: 513,
            $: {
                '0': { v: '096120', n: 1 },
                '1': { v: 'הנדסת איכות', n: 0.707 },
                '2': {
                    v: 'אבטחת איכות ומערכות תומכות: נהלים, תקנים מדריכים, מערכות מידע, דירוג ספקים, אמינות ואחזקתיות, ייחוס פונקציות האיכות ( QFD ), אמינות ואיכות בתיכנון ובבקרת תצורה, חריגות, טעויות אנוש נפוצות וטיפולן, מטרולוגיה, מבחני סביבה ומבחני קבלה, כלכלת האיכות, דוגמאות ואירועים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 514,
            $: {
                '0': { v: '096200', n: 1 },
                '1': { v: 'כלים מתמטיים למדעי הנתונים', n: 0.5 },
                '2': {
                    v: 'תורת הקבוצות: קרדינליות של קבוצות. טופולוגיה: קבוצות פתוחות וסגורות. פנים ושפה של קבוצות, קמירות, קמור של קבוצה, קומפקטיות, טופולוגיה חלשה. מרחבים מטריים: קומפקטיות מטרית, סדרות קושי ושלמות. תורת המידה ואנאליזה פונקציונלית: סיגמא אלגבראות, קבוצות בורל, מידת לבג ואינטגרל לבג, אי שוויון ינסן, נגזרת רדון ניקודים ותוחלת מותנה, סוגי התכנסות, מרחבי LP, מרחבי הילברט, טרנספורם פורייה ופונקציה אופיינית.\nתוצאות למידה: בסיום הקורס הסטודנט:\n1. יוכל להשתמש בכלים של תורת המידה לפתרון בעיות במדעי הנתונים כגון הסתברות וסטטיסטיקה רבת ממדים, אופטימיזציה קמורה ומטריצות אקראיות._\n2. יוכל למדל התניה בנתונים מקריים. _',
                    n: 0.108,
                },
            },
        },
        {
            i: 515,
            $: {
                '0': { v: '096210', n: 1 },
                '1': { v: 'יסודות בינה מלאכותית ויישומיה', n: 0.5 },
                '2': {
                    v: 'סקירת טכנולוגיות בסיסיות בבינה מלאכותי ושימושיהם בתעשיה. מערכות היסק ממוחשבות, יצוג ידע, מבוא לתכנון רובוטי וראיה ממוחשבת.',
                    n: 0.243,
                },
            },
        },
        {
            i: 516,
            $: {
                '0': { v: '096211', n: 1 },
                '1': { v: 'מודלים למסחר אלקטרוני', n: 0.577 },
                '2': {
                    v: 'יישום טכנולוגיות מידע (במיוחד של האינטרנט) למודלים של מסחר אלקטרוני. המודלים כוללים שווי-משקל בייביאני, מכרזים קומבינטוריים, שיטות מסחר אחרות, מכרז כפול, משא ומתן עם סוכני-תכנה, חוזים בזמן אמת. ניתוח של חברות מסחר אלקטרוני. בניית אתר בשיטת מסחר מסוימת.',
                    n: 0.162,
                },
            },
        },
        {
            i: 517,
            $: {
                '0': { v: '096222', n: 1 },
                '1': { v: 'שפה, חישוביות וקוגניציה', n: 0.577 },
                '2': {
                    v: 'הקורס יסקור תחומי מחקר ושאלות מרכזיות בפסיכובלשנות חישובית, תחום המשלב את חקר עיבוד השפה בבני אדם עם בלשנות חישובית. הקורס יציג מחקר בעיבוד ורכישת שפה בבני אדם ומכונות, תוך שילוב גישות סימבוליות והסתברותיות. הקורס יעסוק בנושאים כגון דיקדוקים פורמאליים של שפות טבעיות, מודלי שפה, שיטות מחקר אמפירי, תיאוריה קוגניטיבית של עיבוד שפה, ושפה ומח._\nתוצאות למידהה: בתום הקורס הסטודנטים והסטודנטיות יוכלו:\n- להסביר את השאלות, התיאוריות, ושיטות המחקר העיקריות בתחומי עיבוד השפה והקוגניציה.\n- לפרט על ממצאים אמפיריים מרכזיים בחקר עיבוד השפה אצל בני אדם והאופן בו ניתן למדל אותם חישובית.\n- לנסח דיקדוקים לשפה טבעית ולהשתמש בכלים חישוביים כדוגמת מודלי שפה ויצוגים סמנטיים של מילים ומשפטים.\n- לתכנן ולממש ניסויים הבוחנים את היכולת של כלים אלו למדל תופעות לשוניות, זמני קריאה, ופעילות מוחית בזמן עיבוד שפה._',
                    n: 0.091,
                },
            },
        },
        {
            i: 518,
            $: {
                '0': { v: '096235', n: 1 },
                '1': { v: 'מערכות נבונות אינטראקטיביות', n: 0.577 },
                '2': {
                    v: 'הקורס יסקור תאוריות ושיטות מבינה מלאכותית וממשקי אדם מחשב אשר מהוות את הבסיס לפיתוח מערכות נבונות, ויציג דוגמאות למערכות נבונות התומכות באנשים בתחומים שונים כגון יצירתיות, רפואה ועוד. נלמד מגוון אלגוריתמים המשמשים להסקה על משתמשי המערכת ועקרונות לעיצוב והערכת ממשקים המשלבים בינה מלאכותית. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין וליישם ייצוגים ואלגוריתמים מבינה מלאכותית כגון תהליכי קבלת החלטות מרקוביים, ניתוח רשתות, אופטימיזציה, ניתוח שפה טבעית. 2. להבין את האתגרים בפיתוח מערכות נבונות שמשתמשות באלגוריתמים מבינה מלאכותית כדי לעזור למשתמשים, ובפרט את האתגרים בפיתוח ממשקים המשלבים אוטונומיה מצד המערכת. 3. לתכנן ניסויים על מנת להעריך ולמדוד את היעילות והשימושיות של מערכות נבונות אינטראקטיביות. 4. לנתח בעיות מהעולם האמיתי ולמדל בצורה פורמלית בעיות חישוביות שעולות מהן.',
                    n: 0.092,
                },
            },
        },
        {
            i: 519,
            $: {
                '0': { v: '096250', n: 1 },
                '1': { v: 'מערכות מידע מבוזרות', n: 0.577 },
                '2': {
                    v: 'ריכוז וביזור ברמות הארגון ומערכות המידע. ארכיטקטורות של מערכות מידע מבוזרות. מסדי נתונים מבוזרים. היבטי תקשורת מודל שרת/לקוח ויישומיו. ניתוחי אירועים שבמרכזם מערכות מידע. טכניקות ואלגוריתמים.',
                    n: 0.196,
                },
            },
        },
        {
            i: 520,
            $: {
                '0': { v: '096265', n: 1 },
                '1': { v: 'אלגוריתמים בלוגיקה', n: 0.707 },
                '2': {
                    v: 'הקורס עוסק במידול בעיות הכרעה בעזרת לוגיקות שונות ובאלגוריתמים הנקראים "פרוצדורות הכרעה" ( DECISION PROCEDURES ), לפתרון בעיות אלה. הבעיות בהן הקורס עוסק כוללות בעיות NP קלאסיות וכן בעיות העולות באימות פורמלי של תוכניות מחשב. בין השאר נלמדים אלגוריתמים לפתרון בעיית הספיקות של נוסחאות פסוקיות ( SAT ) ושל מערכות אילוצים ליניאריות. הקורס מתחיל מלימוד של לוגיקה פסוקית ולוגיקה מסדר ראשון.',
                    n: 0.128,
                },
            },
        },
        {
            i: 521,
            $: {
                '0': { v: '096275', n: 1 },
                '1': { v: 'הגורם האנושי באיסוף נתונים', n: 0.5 },
                '2': {
                    v: 'הקנית עקרונות ושיקולים באיסוף מידע מבני אדם בדגש על שיקולים מנקודת מבט של הנשאל, כולל יכולות ומוגבלויות קוגנטיביות המשפיעות על עיצוב המשימות ומוטיבציה למתן תגובות וסוגיות אתיות. תכנון בדיקות איכות לנתונים. הקורס מרכז תכנים רלוונטים מתוך מבוא לפסיכולוגיה, הנדסת גורמי אנוש, שיווק וניתוח נתוני עתק. תוצאות למידה: בסיום הקורס הסטודנט: 1. יכיר שיטות לאיסוף נתוני עתק מאנשים 2. יבין את מגבלות הקוגניציה האנושית באספקת נתונים 3. ידע כיצד בוחרים קהל יעד למניעה הטיה באיסוף נתונים. 4. יכיר סוגיות אתיות באיסוף נתונים.',
                    n: 0.111,
                },
            },
        },
        {
            i: 522,
            $: {
                '0': { v: '096290', n: 1 },
                '1': { v: 'נושאים נבחרים בהנדסת נתונים ומידע', n: 0.447 },
                '2': {
                    v: 'נושאים נבחרים ובעיות מאתגרות בהן מתמקד המחקר בהנדסת נתונים ומידע אשר אינם נלמדים בקורסים האחרים. הקורס יוקדש בכל סמסטר לנושא אחר. תוצאות למידה: בסיום הקורס הסטודנט ייחשף לנושאי מחקר שונים בהנדסת נתונים ומידע או להתמודדות עם סוג נתונים שונה. הערה: סילבוס מפורט יוגש לאישור ביה"ס כתנאי לפתיחת הקורס בכל סמסטר. סמסטר א\' תשע"ט: שילוב נתונים בסביבת אי ודאות. סמסטר א\' תש"פ: שיטות חיזוי בפיננסים. סמסטר א\' תשפ"א: שיטות להסבר מודלים והחלטות בבינה מלאכותית ולמידת מכונה.',
                    n: 0.115,
                },
            },
        },
        {
            i: 523,
            $: {
                '0': { v: '096324', n: 1 },
                '1': { v: 'הנדסת מערכות שירות', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק במערכות שירות עתירות תורים. דוגמאות למערכות כאלה כוללות: משרדי ממשלה ורשויות מקומיות, בתי חולים, בנקים, תחבורה ואינפורמציה. דוגמאות לתורים כוללות: תורי אנשים, שיחות טלפון, טפסים, מכתבים. בקורס ילמדו מודלים של תורים (בעיקר אנליטיים ואמפיריים) שנמצאו שימושיים לצורך תכנון, ניתוח, בקרה ותפעול של מערכות שירות. בנוסף לתיאוריה, יסקרו מאמרים המיישמים אותה וארועים המאשרים את תקיפותה.',
                    n: 0.134,
                },
            },
        },
        {
            i: 524,
            $: {
                '0': { v: '096400', n: 1 },
                '1': { v: 'נושאים נבחרים בסטטיסטיקה והסתברות', n: 0.5 },
                '2': {
                    v: 'הבעיות בהן מתמקד המחקר בסטטיסטיקה ובהסתברות כיום והתרומות בשטחים אלה. נושאי הקורס ייקבעו ע"י המורה האחראי. סמסטר ב\' תשע"ט: הסקה סטטיסטית. סמסטר א\' תש"ף: נושאים נבחרים בסטטיסטיקה מתקדמ לדוקטורנטים במדעי החברה.',
                    n: 0.18,
                },
            },
        },
        {
            i: 525,
            $: {
                '0': { v: '096411', n: 1 },
                '1': { v: 'למידה חישובית 1', n: 0.577 },
                '2': {
                    v: 'שיטות מתקדמות לניתוח נתונים ושילוב כלים סטטיסטיים וכלים של למידת מכונה לצורך ניתוח נתונים, הצגתם באופן ויזואלי ובניית מערכות סיווג וחיזוי. בין הנושאים בקורס יילמדו: חיזוי ורגרסיה לינארית, מערכות סיווג, למידת SUPPORT VECTOR, PAC, RESAMPLING, MACHINE, בחירת מודלים ורגולריזציה, עצי החלטה ורגרסיה, ניתוח אשכולות. תוצאות למידה: הבנה תיאורטית של השיטות השונות ויכולת יישום על נתונים אמיתיים.',
                    n: 0.134,
                },
            },
        },
        {
            i: 526,
            $: {
                '0': { v: '096414', n: 1 },
                '1': { v: 'סטטיסטיקה תעשייתית', n: 0.707 },
                '2': {
                    v: 'בקרת איכות סטטיסטית. תרשימי בקרה לתכונות ולמשתנים. יכולת תהליך CP, CPK . דגימת קבלה: לפי תכונות ומשתנים, תקנים. רגרסיה: ליניארית פשוטה, מרובה, בצעדים, משתני דמי ואינטראקציות. מושגים ומטרות של תכנון ניסויים. ניסויים עם גורם אחד ועם שני גורמים, ניתוח שונות ( ANOVA ) ניסויים בסדרה 2N ו-N-K2, גושים.',
                    n: 0.144,
                },
            },
        },
        {
            i: 527,
            $: {
                '0': { v: '096470', n: 1 },
                '1': { v: 'מודלים סמי-פרמטריים', n: 0.707 },
                '2': {
                    v: 'הקורס מציג את התיאוריה של מודלים סמי-פרמטרים ומראה כיצד ליישם תיאוריה זו כדי לפתור בעיות סטטיסטיות. החלק הראשון של הקורס עוסק בהגדרת המודלים הסמי-פרמטריים ופיתוח התיאורטי לאמידת הפרמטרים במודלים אלו וידון בנושאים:\nמודלים סטטיסטיים, מרחבי הילברט, מרחבים משיקים, פונקציות הסקור וההשפעה. אומדי M והכלם למודלים סמי-פרמטריים. החלק השני של הקורס יתמקד בשימוש בכלים סמי-פרמטריים לבעיו חסרים. בפרט ילמדו רגרסיה עם מומנטים חסומם. רגסיית קוקס, אומדים חסינים.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להגדיר את המודל הסטטיסטי בבעיות סמי-פרמטריות.\n2. להגדיר מרחבי הילברט של פונקציות.\n3. לפתח אומדים סמי-פרמטרים ולנתח את התכונות התיאורטיות שלהם.',
                    n: 0.105,
                },
            },
        },
        {
            i: 528,
            $: {
                '0': { v: '096501', n: 1 },
                '1': { v: 'כלכלה למהנדסי מערכות', n: 0.577 },
                '2': {
                    v: 'ביקוש והיצע:שיווי המשקל בשוק, מדיניות הממשלה בתחום המיקרו והשפעתה על שיווי המשקל. פונקצית ההוצאות וגזירת עקומת ההיצע. התנהגות בתנאי שוק שונים: מונופול ותחרות בלתי משוכללת. המשק הלאומי: החשבונות הלאומיים. קביעת התוצר הלאומי במשק. שער הריבית והשפעתו על ההשקעה. הביקוש לכסף. הבנקים המסחריים, הבנק המרכזי והיצע הכסף. שיווי משקל בשוק הכסף ושיווי משקל כללי. מדיניות הממשלה בתחום המאקרו והשפעתה על התוצר, שער הריבית ושיעור האינפלציה. מושגים בסיסיים בניהול פיננסי.',
                    n: 0.121,
                },
            },
        },
        {
            i: 529,
            $: {
                '0': { v: '096570', n: 1 },
                '1': { v: 'תורת המשחקים והתנהגות כלכלית', n: 0.5 },
                '2': {
                    v: 'הנושאים: משחקים חד-שלביים: איסטרטגיות נשלטות, רמות בטחון ושיווי משקל. משחקים עם מידע לא מלא ותכנון מנגנונים. תורת תוחלת התועלת והיחס לסיכון ולשיווי משקל באיסטרטגיות מעורבות. משחקים רב-שלביים: משחקים עם מידע מלא, משחקים עם מידע כמעט מלא ומשחקים חוזרים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 530,
            $: {
                '0': { v: '096578', n: 1 },
                '1': { v: 'בחירה חברתית והחלטות משותפות', n: 0.5 },
                '2': {
                    v: "אקסיומות של בחירה חברתית, משפט מיי, שיטות בחירה נפוצות, PAGERANK, פרדוקס קונדורסה ומשפט ארוו. בחירות כאומד MAXIMUM-LIKELIHOOD. מבנה העדפות: SINGLE-PEAKED והעדפות קומבינטוריות, מודלים גנרטיביים עם אמת בסיס (PLACKET-LUCE) וללא אמת (כדורים וכדים). הצבעה אסטרטגית: משפט גיברד-סטרת'וויט, סיבוכיות חישובית, VCG, מודלים של שיווי משקל, היוריסטיקות, הצבעה בתורות והתכנסות. תרגילי בית יהיו בשפת תכנון פיתון.\nתוצאות למידה:\nבסיום הקורס הסטודנטים יהיו מסוגלים: 1. להבין את האתגרים העקרוניים, החישוביים, והאסטרטגים של שקלול העדפות חברתיות. 2. לאתר בעיות והנחות הכרחיות לשימוש במנגנוני בחירה קיימים וחדשים. 3. לבחור ו\\או לתכנן מנגנון מתאים לשקלול העדפות בתחומים שונים.",
                    n: 0.106,
                },
            },
        },
        {
            i: 531,
            $: {
                '0': { v: '096606', n: 1 },
                '1': { v: 'כלכלה התנהגותית בסביבה טכנולוגית', n: 0.5 },
                '2': {
                    v: 'הקורס יסקור בעין ביקורתית תאוריות ושיטות מרכזיות בכלכלה התנהגותית, בדגש על שיטות יישומיות המיועדות להשפעה על התנהגות בסביבות עתירות טכנולוגיה. ננתח יישומי כלכלה התנהגותית מוצלחים יותר ופחות, נבין את ההזדמנויות והאתגרים שעולים כתוצאה מנטיות התנהגותיות אנושיות ונפתח עקרונות לשימוש אפקטיבי בכלכלה התנהגותית בתכנון מנגנונים מבוססי משתמש ובפיתוחים טכנולוגיים. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לתאר שיטות מרכזיות להשפעה על התנהגות מעולם הכלכלה ההתנהגותית, להסביר את הרעיונות התאורטיים העומדים מאחוריהן ולדון ביתרונותיהן ובחסרונותיהן היחסיים. 2. לנבא, ברמת דיוק סבירה, האם ועד כמה התערבות מסוימת מעולם הכלכלה ההתנהגותית תהיה אפקטיבית והאם היא עלולה לגרום לתוצאות לוואי לא מתוכננות, במחקר וביישומים בעולם האמיתי. 3. לתכנן התערבויות התנהגותיות אפקטיביות שיגדילו את סיכויי ההצלחה של מנגנונים ופיתוחים טכנולוגיים המבוססים על התנהגות המשתמשים. 4. ליישם התערבויות מעולם הכלכלה ההתנהגותית בחיי היום יום שלהם ובפיתוח מוצרים טכנולוגיים.',
                    n: 0.087,
                },
            },
        },
        {
            i: 532,
            $: {
                '0': { v: '096609', n: 1 },
                '1': { v: 'מודלים כמותיים במדעי ההתנהגות', n: 0.5 },
                '2': {
                    v: 'שימושים מרכזיים של מודלים כמותיים וחישוביים במדעי ההתנהגות: תהליך פיתוח המודלים הקלאסים, חוקי סטיבנס, פכנר וובר, תיאוריית הפרוספקט ומודל רסקולה-וגנר. פיתוח לומדות תוך השענות על המודל של התלמיד.',
                    n: 0.189,
                },
            },
        },
        {
            i: 533,
            $: {
                '0': { v: '096620', n: 1 },
                '1': { v: 'הנדסת גורמי אנוש', n: 0.577 },
                '2': {
                    v: 'נושאים: ניתוח צרכי המשתמשים במוצרים טכנולוגיים קיימים ותכנון מוצרים חדשים. שיקולים הנגזרים מיכולת עיבוד המידע, הלמידה והתגובה של המפעיל האנושי וטעויות אנוש נפוצות. שיקולים בתהליך התכנון לשימוש יעיל במוצרים ידידותיים ובטוחים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 534,
            $: {
                '0': { v: '096622', n: 1 },
                '1': { v: 'זהות ותהליכים קבוצתיים', n: 0.577 },
                '2': {
                    v: 'הקורס יסקור תחומי מחקר מרכזיים הקשורים לקבוצות חברתיות. הוא יתמקד בשלושה נושאים מרכזיים: השלכות של שיוך קבוצתי על מושג העצמי, השלכות של שיוך קבוצתי על תהליכים תוך-קבוצתיים, והשלכות של שיוך קבוצתי על תהליכים בין-קבוצתיים. תוצאות למידה: בתום הקורס הסטודנטים והסטודנטיות יהיו מסוגלים:\n- ליישם פרספקטיבה קבוצתית בניתוח תהליכים בסיסיים ברמת הפרט.\n- לבצע ניתוח תיאורטי של תופעות חברתיות מורכבות._\n- לפתח התערבויות על מנת למתן קונפליקטים בין-קבוצתיים.',
                    n: 0.125,
                },
            },
        },
        {
            i: 535,
            $: {
                '0': { v: '096807', n: 1 },
                '1': { v: 'יזמות חברתית', n: 0.707 },
                '2': {
                    v: 'שיטות וכלים לפיתוח וליישום של אסטרטגיות ומודלים עסקיים המובילים ל- WIN-WIN, תוך התחשבות ב: בעלי המניות, TRIPLE BOTTOM LINE. תוצאות למידה: עם סיום הקורס הסטודנט 1. יכיר מודלים עסקיים חדשים המכוונים לרווחתם של בעלי הענין השונים של הארגון. 2. יכיר ויבין את המורכבות ביישום מודלים אלה. 3. יכיר מיזמים חברתיים שיפותחו במהלך הקורס. 4. יכיר מושגי מפתח וכלים (כגון: THE THREE BOTTOM LINE, THE FOURTH SECTOR, THE NEW COOPERATIVE THE LEAN STARTUP METHODOLOGY, LEAN CANVAS, THE SERVICE PROFIT CHAIN AND BENCHMARKING.',
                    n: 0.111,
                },
            },
        },
        {
            i: 536,
            $: {
                '0': { v: '097140', n: 1 },
                '1': { v: 'שיטות מתקדמות בניהול פרויקטים', n: 0.5 },
                '2': {
                    v: 'טכניקות חדשניות בניהול פרויקטים המבוססות תהליכים. תהליכים לקביעת התכולה, לתזמון, לטיפול במשאבים ובעלויות, לניהול סיכונים, רכש, תקשורת ובקרת פרוייקטים. תהליכים המתאימים לסביבת טכנולוגית המידע המודרנית.',
                    n: 0.2,
                },
            },
        },
        {
            i: 537,
            $: {
                '0': { v: '097200', n: 1 },
                '1': { v: 'למידה עמוקה, תיאוריה ומעשה', n: 0.5 },
                '2': {
                    v: 'הקורס יכסה מגוון מודלים חישוביים ואלגוריתמים מתחום הלמידה העמוקה בדגש על האפליקציה לראייה ממחושבת, ועיבוד שפה. בפרט יכוסו נושאים כמו: רשתות שטוחות, עמוקות, קונבולוציה ויכולות ההכללה שלהן. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להריץ אלגוריתמי למידה עמוקה. 2. לנתח את תכונות ההכללה של אלגוריתמי למידה עמוקה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 538,
            $: {
                '0': { v: '097209', n: 1 },
                '1': { v: 'למידה חישובית 2', n: 0.577 },
                '2': {
                    v: 'הקורס יציג נושאים מתמקדמים בלמידת מכונה שמתארים את ארכיטקטורות עכשוויות של למידה עמוקה, ומדגישים את היכולת להתאים למדגם האימון תוך כדי הכללה, ולמידה שמייצרת דוגמאות מתוך התפלגות.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. לפתח ולהריץ רשתות נוירונים.\n2. לפתח ולהרי רשתות קונבולוציה.\n3. להריץ תהליך אימון/וולידציה/בחינה שכולל מבחני א/ב. 4. לשערך התאמת יתר.\n5. להתמודד עם התאמת יתר ולזהות הכללה.',
                    n: 0.131,
                },
            },
        },
        {
            i: 539,
            $: {
                '0': { v: '097215', n: 1 },
                '1': { v: 'שיטות בעיבוד שפה טבעית', n: 0.5 },
                '2': {
                    v: 'הקורס יכסה מגוון מודלים חישוביים ואלגוריתמים, בעיקר מתחום הלמידה החישובית, להבנת טקסטים הכתובים בשפה אנושית. בפרט יכוסו נושאים כמו: זיהוי חלקי דיבר, זיהוי ישויות, ניתוח תחבירי וסמנטיקה. הקורס יתמקד הן במשימות עיבוד השפה והן באלגוריתמי למידה חישובית רלוונטיים בפרט בתחום של למידת מבנה ומודלים גרפיים הסתברותיים. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1.לנסח את המשימות השונות שעל אלגוריתם לפתור בכדי להבין טקסט. 2.לתכנן ולממש בתוכנה אלגוריתמים ללמידת מודלי שפה מרקוביים. 3.לתכנן ולממש בתוכנה אלגוריתמים למשימות תיוג סדרתי כמו זיהוי חלקי דיבר וזיהוי ישויות. 4.לתכנן ולממש בתוכנה אלגוריתמים למשימות למידת מבנה מורכב (למשל עץ) לשם פתרון בעיות כמו ניתוח תחבירי סטטיסטי (ניתוח תלויות וניתוח ביטויים) 5.לתכנן ולממש אלגוריתמים ללמידת משמעות של מילים, ביטויים ומשפטים בשיטות וקטוריות. 6.לתכנן ולממש אלגוריתמי תכנון דינאמי, אלגוריתמי הסקה במודלים גרפיים ואלגוריתמי שערוך פרמטרים לשם פתרון בעיות של למידת מבנה של משפטים ומסמכים.',
                    n: 0.085,
                },
            },
        },
        {
            i: 540,
            $: {
                '0': { v: '097217', n: 1 },
                '1': { v: 'סמינר בעיבוד שפה טבעית', n: 0.5 },
                '2': {
                    v: 'נושאים עדכניים בעיבוד שפה ממגוון זויות: הנתונים, השערות המחקר, המודלים החישוביים, ניסויים, ניתוח התוצאות ודיון ביקורתי. הקורס יתמקד בבעיות כמו: למידת שפה בנסיבות של ריבוי סביבות שפתיות, שפות, ותמונות, הסקה סיבתית בלמידת שפה, שיטות להבנת מודלים ואפליקציות למדעי החברה ולרפואה. יושם דגש על אתיקה ועל ההשלכות החברתיות של המחקר._\nתוצאות למידה: בסיום הקורס הסטודנטים והסטודנטיות יהיו מסוגלים:\n- לבצע פרויקט מחקר בהיקף קטן על בעיה עדכנית בתחום של עיבוד שפה טבעית.\n- לזהות את הסיפרות המרכזית על בעיה עכשוית בעיבוד שפה טבעית ולסכם אותה באופן ביקורתי._',
                    n: 0.11,
                },
            },
        },
        {
            i: 541,
            $: {
                '0': { v: '097222', n: 1 },
                '1': { v: 'ראייה ממוחשבת ויישומיה בחדר ניתוח', n: 0.447 },
                '2': {
                    v: 'הקורס ידון בדרכים לניתוח נתונים מתחום הכירורגיה, עם דגש על נתונים מחדר הניתוח. הנתונים יכללו וידאו, אודיו, נתונים של המוניטור של החולה וחיישנים נוספים. נלמד אלגוריתמים מרכזיים בראייה ממוחשבת וסגמנטציה של וידאו: זיהוי אובייקטים (YOLO,AGNET) , סגמנטציה זמנית של וידאו וזיהוי פעולות (LSTM,MS-TCN++,ASFORMER), ומיפוי אוטומטי של תהליכים. נלמד ליישם את האלגוריתמים האלה בתחום הכירורגיה, לדוגמא: זיהוי כלים כירורגיים, זיהוי ידי המנתח ומעקב תנועה, זיהוי אוטומטי של פעולות כירורגיות, מיפוי אוטומטי של השלבים במהלך הניתוח._ תוצאות למידה:\nבסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:____\n1) לזהות גישות כירורגיות שונות ואת הנתונים שלהם.\n2) לפתור בעיות של סיווג וזיהוי אובייקטים בעזרת למידה עמוקה_.: 3) לתכנת רשתות זמניות לצורך אנליזה של רצף העבודה הכירורגי.\n4) לפתור בעיות של זיהוי אוטומטי של מחוות.\n5) שילוב נתוני תנועה ווידאו.',
                    n: 0.092,
                },
            },
        },
        {
            i: 542,
            $: {
                '0': { v: '097244', n: 1 },
                '1': { v: 'רובוטים קוגניטיביים', n: 0.707 },
                '2': {
                    v: 'טכניקות בסיס בבינה מלאכותית עם נגיעה לרובוטיקה, וכן טכניקות בסיס ברובוטיקה. התנסות בשילוב טכניקות של בינה מלאכותית ברובוטים ע"י תכנות ועבודה מול רובוטים מסומלצים ואמיתיים. נושאים: תכנון קלאסי, תכנון עם זמנים, תכנון תנועה, שילוב של תכנון עם תכנון תנועה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל לתכנת רובוט לבצע משימה מורכבת, ע"י שימוש בטכניקות מתחום הבינה המלאכותית.',
                    n: 0.132,
                },
            },
        },
        {
            i: 543,
            $: {
                '0': { v: '097245', n: 1 },
                '1': { v: 'תכנון מנגנונים למדעי הנתונים', n: 0.5 },
                '2': {
                    v: 'הקורס יציג את המדע והטכנולוגיה העומדים מאחורי מנגנוני הפרסום וקידום המכירות באינטרנט, המהווים את החמצן ההכרחי לקיומו. יילמדו נושאי פרסום מקוון, פרסום במנועי חיפוש, פרסום על ידי עמיתים, מערכות כיוון לקוחות, עקרונות אסטרטגיים במערכות אופטימיזצית-חיפוש, ומערכות המלצה עם משתתפים אסטרטגיים. תוצאות למידה: בסיום הקורס הסטודנט ידע: ליישם מנגנונים אלגוריתמיים לפרסום מקוון לצורותיו השונות.\nלהשתמש בסודות של טכנולוגיית קידום תוכן באינטרנט.\nליישם כלי אנליזה אסטרטגית למדעי הנתונים בהקשר תחרותי.',
                    n: 0.123,
                },
            },
        },
        {
            i: 544,
            $: {
                '0': { v: '097260', n: 1 },
                '1': { v: 'נושאים נבחרים בטכנולוגיות מידע', n: 0.5 },
                '2': {
                    v: 'הקורס יתמקד, בכל סמסטר בו יינתן, בנושא מסויים בתחום טכנולוגיות המידע. הדינמיקה העצומה בתחום זה מחייבת עדכון שוטף ומתמיד בחידושים ובטכנולוגיות שבחזית הפיתוח והמימוש של מערכות מידע.',
                    n: 0.192,
                },
            },
        },
        {
            i: 545,
            $: {
                '0': { v: '097317', n: 1 },
                '1': { v: 'תורת המשחקים השיתופיים', n: 0.577 },
                '2': {
                    v: 'משחקי זווגים. משחקים בצורת פונקציה אופיינית. משחקים בצורה אסטרטגית. תורת התועלת. משחקי מקוח. פונקצית רווחה חברתית ומשפט ARROW.',
                    n: 0.236,
                },
            },
        },
        {
            i: 546,
            $: {
                '0': { v: '097325', n: 1 },
                '1': { v: 'תיאוריה ושיטות באופטימיזציה דלילה', n: 0.5 },
                '2': {
                    v: 'מציאת פתרונות לבעיות שמכילים מעט משתנים השונים מאפס. יישומים נרחבים במגוון תחומים, כגון עיבוד אותות ותמונות, וסטטיסטיקה. הקורס ילמד תיאוריה ושיטות לאופטימיזציה דלילה החל מתוצאות קלאסיות לבעיות לא מאולצות, ועד שיטות מתקדמות לבעיות עם אילוצים, רגולריזציה ומבני דלילות של קבוצות. הכללה למבנה של דלילות של קבוצות או מטריצות. תוצאות למידה:\nבסיום הקורס הסטודנטים יוכלו ליישם ולנתח שיטות לאופטימיזציה דלילה. בפרט: שיטות היטל הגרדיאנט, שיטות פרוקסימל גראדינט ושיטות בלוקיות.',
                    n: 0.122,
                },
            },
        },
        {
            i: 547,
            $: {
                '0': { v: '097334', n: 1 },
                '1': { v: 'שיטות אלגבריות לתכנות בשלמים', n: 0.5 },
                '2': {
                    v: 'שיטות לפתרון יעיל של בעיות תכנות בשלמים לינאריות ולא לינאריות במספר משתנים רב, ושימושיהן, כלהלן. מערכות יונימודולריות. שיטות איטרטיביות. אופטימיזציה של פונקציות קמורות. מערכות עם מבנה בלוקים. שיטות של פולינומים. רשתות וזרימה מרובת מוצרים. טבלאות סטטיסטיות רב ממדיות ופרטיות במאגרי נתונים. בעיות חלוקה. אופטימיזציה מרובת קריטריונים. אופטימיזציה בתנאי אי וודאות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל לפתור ביעילות בעיות תכנות בשלמים ויהיה בקיא במגוון שימושים של תכנות בשלמים.',
                    n: 0.12,
                },
            },
        },
        {
            i: 548,
            $: {
                '0': { v: '097400', n: 1 },
                '1': { v: 'הסקה סיבתית', n: 0.707 },
                '2': {
                    v: 'נסקור נושאים בסיסיים ומתקדמים בהסקה סיבתית: אילו בעיות דורשות הסקה סיבתית,למה הסקה סיבתית קשה מחיזוי רגיל של SUPERVISED LEARNING, כיצד ניתן ללמוד קשרים סיבתיים מנתונים, נלמד את הבסיס הרעיוני של התחום לפי PEARL ו-RUBIN, כולל CAUSAL GRAPHS. נביא דוגמאות מרפואה, כלכלה ומדיניות ציבורית, מדיה חברתית, שיווק ומכירות, ובריאות הציבור. תוצאות למידה: בסיום הקורס הסטודנטים יהיו מסוגלים: 1. לזהות בעיות שדורשות שימוש בכלים של הסקה סיבתית 2. להסביר למה ובאילו תנאים כלים של למידת מכונה אינם מספיקים עבור הסקה סיבתית 3. לזהות את ההבדל בין ניסוי אקראי מבוקר, מחקר תצפיתי ללא משתנים מתערבים חבויים, ומחקר תצפיתי עם משתנים מתערבים חבויים 4. להגדיר תנאים מספיקים לביצוע של הסקה סיבתית תקפה הן בשפה של POTENTIAL OUTCOMES והן בשפה של גרפים סיבתיים 5. להשתמש בשיטות של COVARIATE ADJUSTMENT, MATCHING ו-PROPENSITY SCORE על מנת לשערך אפקטים סיבתיים מנתונים 6. לשרטט גרף סיבתי שמתאים ל-DATA GENERATING PROCESS נתון 7. לזהות תנאים בהם מתקיים ניסוי טבעי, בפרט מצבים בהם קיים INSTRUMENTAL VARIABLE',
                    n: 0.08,
                },
            },
        },
        {
            i: 549,
            $: {
                '0': { v: '097414', n: 1 },
                '1': { v: 'סטטיסטיקה 2', n: 0.707 },
                '2': {
                    v: 'הקורס יעסוק במגוון נושאים של תאוריה סטטיסטית בשילוב עם ניתוח נתונים. נושאי הקורס כוללים רגרסיה מרובת משתנים, רגרסיה מוכללת, סטטיסטיקה לא פרמטרית ושיטות דגימה מחדש, תורת ההחלטות, סטטיסטיקה בייסיאנית ושיטות לטיפול בנתונים החסרים.\nתוצאות למידה: בסיום הקורס התלמידים ידעו: 1. להפעיל שיטות רגרסיה שונות. 2. לבצע הסקה סטטיסטית על מאגרי נתונים מסוגים שונים כולל טיפול בנתונים חסרים.',
                    n: 0.134,
                },
            },
        },
        {
            i: 550,
            $: {
                '0': { v: '097449', n: 1 },
                '1': { v: 'סטטיסטיקה אי פרמטרית', n: 0.577 },
                '2': {
                    v: 'נתונים קטגורים: (לוחות סמיכות) השוואת מדגמים ב"ת, מדדי קשר, השוואת מדגמים תלויים. נתוני דרגות: השוואת מדגמים ב"ת, מדדי קשר. מבחני טיב התאמה. רגרסיה אי-פרמטרית.',
                    n: 0.204,
                },
            },
        },
        {
            i: 551,
            $: {
                '0': { v: '097622', n: 1 },
                '1': { v: 'מבוא למדעי הקוגניציה', n: 0.577 },
                '2': {
                    v: 'הקורס יסקור תחומי מחקר, תיאוריות, מודלים וממצאים אמפיריים מרכזיים בחק הקוגניציה האנושית. בין הנושאים שילמדו: היסודות הפילוסופיים של מדעי הקוגניציה, ייצוגים מנטליים, למידה, שפה, ראייה, קשב וזיכרון. דגש מיוחד יינתן על מודלים חישוביים בקוגניציה, והקשרים בין מדעי הקוגניציה לבינה מלאכותית. תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יוכלו:\n- לאפיין את התחומים והשאלות המרכזיות בחקר הקוגניציה.\n- להסביר שיטות מחקר, ממצאים אמפיריים, מודלים ותיאוריות מרכזיות בתחומי הקוגניציה.\n- לאפיין קשרים מרכזיים בין בינה אנושית לבינה מלאכותית.',
                    n: 0.118,
                },
            },
        },
        {
            i: 552,
            $: {
                '0': { v: '098123', n: 1 },
                '1': { v: 'ניהול פרויקטים להנדסת מערכות', n: 0.5 },
                '2': {
                    v: 'הנושא נדון מהשלב ההתחלתי של ההחלטה הניהולית ועד לשלבי הסיום הממשי של הפרוייקט. הקורס מטפל בניהול פרוייקט בעסקים, עם הדגשה מיוחדת של שימושים בתעשיה. הקורס מחולק לשלושה חלקים: טבעו וארגונו של ניהול פרוייקט, תכנון ופיקוח על פרוייקט, ביצוע פרוייקט.',
                    n: 0.16,
                },
            },
        },
        {
            i: 553,
            $: {
                '0': { v: '098291', n: 1 },
                '1': { v: 'פרקטיקום (התנסות מעשית) בארגונים', n: 0.5 },
                '2': {
                    v: 'הקורס דורש ביצוע פרויקט ארגוני, כפרקטיקום בפסיכולוגיה. הפרויקט מקנה התנסות באיתור ופתרון בעיות של תהליכים ארגוניים וניהול המשאב האנושי. הפרויקט ילווה במנחה מהארגון ומנחה אקדמי. בסיום הפרקטיקום הסטודנט יכיר תהליכי ארגוניים ושיטות לטיפול במשאב האנושי, יכתוב דו"ח מסכם של הבעיה, הפתרון ותהליך הלמידה לאור תיאוריות, שיטות וכלים מחקריים.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להכיר תהליכים ארגוניים דרך עבודה מעשית בארגון.\n2. לדעת לנתח תהליכים ניהוליים המשפיעים על המשאב האנושי לאור תאוריות ומתודות בארגונים. 3. לדעת לנתח קשרים בין מבנה ארגוני, תרבות ארגונית, פרקטיקות ניהוליות והתנהגות עובדים, תוך שימוש בכלים סטטיסטיים.\n4. להבין את המורכבות הארגונית שמשפיעה על התנהגות מנהלים ועובדים והקשר להצלחת הארגון.',
                    n: 0.099,
                },
            },
        },
        {
            i: 554,
            $: {
                '0': { v: '098292', n: 1 },
                '1': { v: 'יצירתיות: קוגניציה, מוח וארגון', n: 0.5 },
                '2': {
                    v: 'קורס זה יתמקד בדיון מעמיק במחקר בתחום היצירתיות בהיבטים קוגניטיביים, מוחיים וארגוניים. נושאים שיסקרו במהלך הקורס: התהליך, תוצרים, סביבה, אישיות ותחומים (אמני ומדענים) היצירתיים וכן יצירתיות בארגונים. סטודנטים יסקרו באופן ביקורתי וידונו במחקר עכשווי ביצירתיות, ויגישו עבודת סמינר סופית בנושא זה.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. לזהות מגמות מחקר עדכניות בתחום חקר היצירתיות, וכיצד מגמות אלו נפרשות מהאדם ועד הארגון._\n2. לקרוא באופן ביקורתי מאמרים בתחום היצירתיות.\n3. להציג מאמרים בתחום חקר היצירתיות בצורה ברורה ואפקטיבית. 4. לנתח ולזהות בעיות קיימות בחדר יצירתיות ולהציע שאלות מחקר ומתודולוגיות מחקר לפתוח בעיות אלו.',
                    n: 0.105,
                },
            },
        },
        {
            i: 555,
            $: {
                '0': { v: '098310', n: 1 },
                '1': { v: 'חקר ביצועים ואופטימיזציה', n: 0.577 },
                '2': {
                    v: 'הקורס יסקור באמצעות דוגמאות ואירועים את המתודולוגיות השונות של חקר ביצועים לניתוח ולמיטוב של מערכות כלכליות, הנדסיות, לוגיסטיות וכיו"ב. יושם דגש על בניית מודלים כמותיים מתימטיים כבסיס לפתרון בעיות מורכבות רב-מימדיות ומאולצות.',
                    n: 0.177,
                },
            },
        },
        {
            i: 556,
            $: {
                '0': { v: '098311', n: 1 },
                '1': { v: 'אופטמיזציה 1', n: 0.707 },
                '2': {
                    v: "יסודות באנליזת קמירות. תכנות קמור. תנאי אופטימליות, ניתוח רגישות, דוגמאות ספציפיות, תכנות לינארי, ריבועי, גיאומטרי: אי שויונות. משפטי מינימכס ושימושים לתורת המשחקים. מבוא לבעיות רב קריטריוניות, פתרונות פרטו ומושגי פתרון אחרים, תכונות לא-קמור: תנאי אופטימליות, דואליות על-ידי לגרנז'יאנים מוכללים.",
                    n: 0.16,
                },
            },
        },
        {
            i: 557,
            $: {
                '0': { v: '098331', n: 1 },
                '1': { v: 'תכנות לינארי וקומבינטורי', n: 0.577 },
                '2': {
                    v: 'חזרה קצרה על תכנון ליניארי, מושגי יסוד בתורת הגרפים, אלגוריתמים יעילים לבעיות בגרפים כגון, זיווג, זרימה ברשתות ועצים פורשים. מטרואידים, ניתוח אלגוריתמים על בסיס תכנון לינארי, אופטימיזציה פוליהדרלית, מושגי יסוד בחישוביות, אלגוריתמי קרוב.__\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים: 1. להשתמש באלגוריתמים ידועים למגוון רחב של בעיות אופטימיזציה קומבינטורית.____\n2. להשתמש בכוח המידול של מטרואידים ובתכונותיהם._\n3. לתכנן אלגוריתם לבעית אופטימיזציה קומבינטורית חדשה ולנתח אותו תוך שימוש בתכונות של ניסוח תוכנית לינארית מתאימה.__\n4. לתכנן אלגוריתם לבעיות מבוסס על שיטת הכיול לבעיות אופטימיזציה קומבינטורית._\n5. לבחור בין שיטות שונות לפתרון בעיות אופטימיזציה קומבינטורית.__\n6. להפריד בין בעיות אופטימיזציה קומבינטורית שלהן קיים אלגוריתם יעיל לבין בעיות קשות ב-NP.',
                    n: 0.099,
                },
            },
        },
        {
            i: 558,
            $: {
                '0': { v: '098409', n: 1 },
                '1': { v: 'סמינר משתלמים 1', n: 0.577 },
                '2': {
                    v: 'הסמינר כולל הרצאות של סטודנטים לתארים גבוהים שבהן יוצגו עבודות המחקר שלהם וכן מספר הרצאות של חברי הסגל. תוצאות למידה: בסיום הקורס, הסטודנט יכיר את נושאי המחקר הנחקרים בפקולטה על ידי חברי סגל והמשתלמים.',
                    n: 0.171,
                },
            },
        },
        {
            i: 559,
            $: {
                '0': { v: '098418', n: 1 },
                '1': { v: 'הסתברות ותהליכים סטוכסטיים', n: 0.577 },
                '2': {
                    v: 'תוחלת מותנית, מרטינגיילים, תהליכים סטציונריים וגאוסיים, משפטים ארגודיים, תהליכי לוי, תנועת בראון ותהליכי דיפוזיה, התכנסות חלשה.',
                    n: 0.25,
                },
            },
        },
        {
            i: 560,
            $: {
                '0': { v: '098602', n: 1 },
                '1': { v: 'התנהגות בארגונים', n: 0.707 },
                '2': {
                    v: 'הקורס יסקור נושאים ותחומי מחקר מרכזיים בפסיכולוגיה ארגונית במטרה להקנות כלים אנליטיים לניתוח ועיצוב של התנהגות אנושית בהקשר הארגוני. תכני הקורס יתמקדו בשלוש רמות שונות: רמת הפרט - האופן בו תהליכים תוך-אישיים ובינ-אישיים באים לידי ביטוי בעולם העבודה, רמת הקבוצה/ארגון - האופן בו סביבת עבודה משפיעה על העובדים, רמת החברה/תרבות - האופן בו הקשר חברתי רחב משפיע על תפקוד הארגון והעובדים. תוצאות למידה:בסיום הקורס הסטודנטיות והסטודנטים יוכלו: - להעלות שאלות מחקר תיאורטיות ומעשיות הרלוונטיות להקשר הארגוני._\n- לזהות קונפליקטים, דילמות ואתגרים שאיתם מתמודדים עובדים וארגונים ולנתח אותם מפרספקטיבות מגוונות._\n- ליישם מסקנות תיאורטיות ולשלבן בפרקטיקות ארגוניות.\n- לפתח התערבויות מעשיות להתמודדות עם אתגרים ודילמות ארגוניים.',
                    n: 0.099,
                },
            },
        },
        {
            i: 561,
            $: {
                '0': { v: '098603', n: 1 },
                '1': { v: 'איסוף נתונים ומחקר במדעי ההתנהגות', n: 0.447 },
                '2': {
                    v: 'טכניקות ניתוח במדעי החברה. הנושאים שידונו כוללים: תכנון הניתוח. ניתוח אינדוקטיבי ודדוקטיבי, פרופורציות ושכיחויות, ניתוח מיתאמים, ההגיון של ניתוח סקרים, סילום מורכב, שימוש בטכניקות של הקבצה, טכניקות להערכת תכניות חברתיות.',
                    n: 0.183,
                },
            },
        },
        {
            i: 562,
            $: {
                '0': { v: '098617', n: 1 },
                '1': { v: 'ארגונים מורכבים 1', n: 0.577 },
                '2': {
                    v: 'סקירה בקורתית על התיאוריות הארגוניות - תאורית הנהול הקלאסית, יחסי אנוש, התיאוריה הביורוקרטית, תאוריה מערכתית, אקולוגית. מטרות אירגוניות, אפיוני הסביבה והשפעותיה, תכונות מבניות, עצמה, קבלת החלטות, יעילות אירגונית, מחזור החיים הארגוני, תרבות אירגונית, חדשנות.',
                    n: 0.171,
                },
            },
        },
        {
            i: 563,
            $: {
                '0': { v: '098618', n: 1 },
                '1': { v: 'נושאים בארגונים מורכבים', n: 0.577 },
                '2': {
                    v: 'בקורס יוצעו נושאים נבחרים במתכונת סמינריונית. בין הנושאים יידונו: עצמה, חדשנות, ריבוד, נשים בארגונים, קבוצות קטנות, ארגונים ולונטריים, תקשורת, למידה ארגונית ונושאים נוספים.',
                    n: 0.209,
                },
            },
        },
        {
            i: 564,
            $: {
                '0': { v: '098722', n: 1 },
                '1': { v: 'נושאים נבחרים בניהול מ"מ למנהלים', n: 0.447 },
                '2': {
                    v: 'הקורס מתמקד בלימודי נושאים מתקדמים וחדשניים בניהול מערכות מידע, אשר אינם נלמדים בקורסים הרגילים. כל סמסטר יוקדש הקורס לנושא אחר.',
                    n: 0.224,
                },
            },
        },
        {
            i: 565,
            $: {
                '0': { v: '098724', n: 1 },
                '1': { v: "קניין רוחני-ההגנה המש' על מש' ידע", n: 0.408 },
                '2': {
                    v: 'מטרת הקורס היא להקנות את המושגים, העקרונות והכללים המשפטיים של קניין רוחני - התחום המשפטי העוסק בהגנה על משאבי ידע. במסגרת זו ידונו הקטגוריות המשפטיות של זכות יוצרים, פטנטים, סימני מסחר, מדגמים וסודות מסחריים תוך בחינת ההקשרים הטכנולוגיים של קניין רוחני - ההגנות המשפטיות על תוכנה, חומרה ומאגרי מידע, והסוגיות המשפטיות העכשוויות של קניין רוחני באינטרנט.',
                    n: 0.134,
                },
            },
        },
        {
            i: 566,
            $: {
                '0': { v: '098738', n: 1 },
                '1': { v: 'נושאים נבחרים בניהול תחרותי', n: 0.5 },
                '2': {
                    v: 'השנויים והשבושים שחלו לאחרונה בשרשראות אספקה העלו מחדש את הדילמה בין שרשראות אספקה רזות LEAN) ) או גמישות (RESILIENCE). הקורס הוא רב דיסיפלינרי, תוך שמוש בשיטות כמותיות למדידת יחסי התמורה בין ניהול רזה לניהול גמיש של שרשראות אספקה ופיתוח פתרונות למודלים עסקיים המצמצמים את יחסי התמורה ביניהם. הקורס עוסק בפתרונות שהם מעבר לשיקולי יעילות בלבד, תוך דגש על שביעות רצון הצרכן והגנת הסביבה. הקורס עוסק בבניית שרשראות אספקה שנותנות ערך כלכלי לגורמים השונים בשרשרת האספקה תוך בניית בסיס אמון וערך סביבתי .\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים ירכשו ידע על מורכבות הגורמים בשרשרת האספקה, שיש לקחת בחשבון בבניית מודל משולב שמביא ערך לצדדים. הקורס מקנה שיטות וכלים להתמודדות עם מצבים של חוסר איזון בין היצע וביקוש.\n* מדידה וכימות של האפקט השלילי של אופטימיזציה מקומית.___\n* פיתוח ויישום שיטות לבניית שיתופי פעולה לטווח ארוך. . * מדידת יחסי התמורה בין עלות לשרות.\n* תכנון מערכת אספקה שתומכת באסטרטגיה הארגונית.',
                    n: 0.083,
                },
            },
        },
        {
            i: 567,
            $: {
                '0': { v: '098740', n: 1 },
                '1': { v: 'סטטיסטיקה למנהלים', n: 0.707 },
                '2': {
                    v: 'סוגי המחקרים (רטרוספקטיבי, פרוספקטיבי, ניסויים), סוגי משתנים, הצגות גרפיות, עקרונות מבחני השערות (מבחן פרמטרי ומבחן אי-פרמטרי), השוואות של שני מדגמים בלתי תלויים ותלויים לנתונים רציפים וקטגוריים, רווחי סמך, ניתוח טבלאות סמיכות, מתאם ורגרסיה ליניארית פשוטה.',
                    n: 0.169,
                },
            },
        },
        {
            i: 568,
            $: {
                '0': { v: '098748', n: 1 },
                '1': { v: 'כלכלה התנהגותית ואתיקה', n: 0.577 },
                '2': {
                    v: 'כלכלה התנהגותית היא הניסיון לבחון הנחות כלכליות תיאורטיות ע"י ביצוע ניסויים בהן נחקרת התנהגות של אנשים בפועל. החלק הראשון יעסוק בממצאים מתחום הכלכלה ההתנהגותית הכוללים הטיות בשיפוט וקבלת החלטות. החלק השני יוקדש לחקר התנהגויות שאינן אתיות בראי הגישה של תחום הכלכלה ההתנהגותית הכוללים הטיות בשיפוט וקבלת החלטות.החלק השני יוקדש לחקר התנהגויות שאינן אתיות בראי הגישה של תחום הכלכלה ההתנהגותית. תוצאות למידה : הסטודנט יהיה מסוגל:א. לזהות הטיות רווחות בשיפוט וקבלת החלטות ב. להבין מתי (תחת אילו תנאים) מתרחשות הטיות בשיפוט וקבלת החלטות כמו גם התנהגויות שאינן אתיות. ג. להכיר התערבויות שיכולות להקטין את ההטיות כמו גם התערבויות למיגור התנהגויות שאינן אתיות.',
                    n: 0.1,
                },
            },
        },
        {
            i: 569,
            $: {
                '0': { v: '098749', n: 1 },
                '1': { v: 'נושאים נבחרים במנהל עסקים', n: 0.5 },
                '2': {
                    v: 'הקורס יעסוק בבעיות שונות בתחום של מנהל עסקים אשר אינן נדונות בקורסים האחרים. הנושאים ייקבעו מדי פעם ע"י המורה האחראי.\nסמסטר ב\' תשע"ז: גלובאליזציה\nסמסטר א\' תשע"ח: זיהוי וניתוח הזדמנויות שוק לחדשנות.\nסמססטר א\' תשע"ט: זיהוי וניתוח הזדמנויות שוק לחדשנות טכנולוגית ._',
                    n: 0.16,
                },
            },
        },
        {
            i: 570,
            $: {
                '0': { v: '098754', n: 1 },
                '1': { v: 'נושאים נבחרים ביזמות ורגולציה', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס היא להעניק היכרות עם היבטים שונים של רגולציה ותחומי משפט המשפיעי ם על יזמות, בדגש על חברות הזנק. אנו רגילים לחשוב על רגולציה בתור חסם ליזמות, אולם רגולציה יכולה גם לייצר הזדמנויות עסקיות, ויזמים מתוחכמים יכולים לפתח מודלים עסקיים שבבסיסם שינוי של הרגולציה. הלימוד יעשה תוך היעזרות במקרי מבחן של חברות מישראל ומארה"ב שהצליחו לאתגר את הרגולציה הקיימת או שהתעלמו ממנה וכתוצאה מכך נקלעו לקשיים.בנוסף, נכיר את מערכת הדינים שהיזמים יוצרים לעצמם באמצעות הסכם המייסדים ותקנון החברה ונבחן את התפתחות המשל התאגידי של חברות הזנק לאורך שלבי הצמיחה שלהן. הקורס מקנה את השפה, דרכי החשיבה וההבנה מתי לפנות לייעוץ משפטי. כמו גם את היכולת למקד את הבעיות העומדות בפני יזמים ויזמיו ולשאול שאלות ביקורתית כלפיהמסגרות המשפטיות. הקורס משלב למידה מעשית וקבוצתית ומלווה בהרצאות אורח של מומחים מובילים בתחום. תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים ירכשו ידע והיכרות עם מושגי יסוד הרלוונטיים ליזמות והשקעות הון סיכון. * ניהול מו"מ על הסכם מייסדים תוך יישום הידע הנרכש.\n* ניהול מו"מ על טיוטת הסכם השקעה תוך יישום הידע הנרכש.\n* ניתוח הצעות תגמול הוני והשוואה בין הצעות מתחרות.\n* ניתוח האתגרים העומדים בפני חברות בצמיחה וכיצד אתרים אלו עלולים להשפיע על הממשל התאגידי בחברות הזנק. המחשת אתגרים אלו באמצעות דוגמאות מחברות קונקרטיות.\n* ניתוח סיכונים והזדמנויות הנובעים מרגולציה או היעדרה בתחומי פעילות שונים.\n* בחירה באסטסרטגיות מתאימותת להתמודדות עם אתגרים והזדמנויות רגולטוריים',
                    n: 0.068,
                },
            },
        },
        {
            i: 571,
            $: {
                '0': { v: '098759', n: 1 },
                '1': { v: 'נושאים נבחרים בכלכלה סביבתית', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס לבחון את המגמה הכלל עולמית בנושא קיימות, שיקולים להשקעה בקיימות ומדדים להערכת השקעות בקיימות ברמת החברה, המשקיעים וקובעי המדיניות. הקורס יציג את הדרישות לעמידה בתקני קיימות וכן אלטרנטיבות שונות לזהום סביבתי, תמריצי השקעה, כלכלה מעגלית וכ"ו. זאת במטרה להקנות תודעה והבנה לא רק של חשיבות הנושא אלא גם של יישומו. הקורס נותן כלים לסטודנטים ליישום קיימות והקטנת זהום סביבתי על היבטיו השונים בארגונים שלהם. _\nתוצאות למידה:\nבסיום הקורס הסטודנטיות והסטודנטים ירכשו ידע והבנה של המגמה הגלובלית לקיימות והשפעתה על החברות. הם יקבלו כלים מעשיים להחלטות ומדדים להשקעה בקיימות ברמת הארגון. הסטודנטים יפתחו תכנית השקעה בקיימות ברמת הארגון שלהם.',
                    n: 0.101,
                },
            },
        },
        {
            i: 572,
            $: {
                '0': { v: '098760', n: 1 },
                '1': { v: 'התנהגות אירגונית', n: 0.707 },
                '2': {
                    v: 'איסוף נתונים לגבי התנהגות אנושית, מאפיינים של תפיסה אנושית, מאפיינים של חשיבה וקבלת החלטות, מבנה מערכת הזכרון האנושית, מודלים של למידה וקוגניציה, שביעות רצון בעבודה, מוטיבציה לעבודה, לחץ ושחיקה בעבודה, עבודה בצוותים, מנהיגות ותהליכים קבוצתיים, תקשורת בין-אישית, קבלת החלטות בקבוצות, עזרה לעומת קונפליקט, יחסי-כוח בקבוצות, תרבות אירגונית ואקלים אירגוני.',
                    n: 0.143,
                },
            },
        },
        {
            i: 573,
            $: {
                '0': { v: '098763', n: 1 },
                '1': { v: 'ניהול בינתרבותי', n: 0.707 },
                '2': {
                    v: 'מאפיינים של ניהול גלובלי בסביבה בין-תרבותית, כולל: מאפייני תרבות והשפעותיהם של שיטות הנעה, תקשורת בארגונים, מו"מ, הכנסת שינויים ומיזוג חברות בין-תרבותיות. ההוראה תשלב ניתוח אירועים ולימוד תוך התנסות.',
                    n: 0.189,
                },
            },
        },
        {
            i: 574,
            $: {
                '0': { v: '098770', n: 1 },
                '1': { v: 'מימון מיזמים טכנולוגיים', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק במימון חברות הזנק טכנולוגיות בשלבים הראשונים של הפיכתן לחברה ובפרט בסוגיות כגון: כמה כסף ניתן וצריך לגייס, מתי יש לגייס את הכסף וממי, מהו הערך המוערך של החברה ומהו מבנה ההון הנכון.',
                    n: 0.171,
                },
            },
        },
        {
            i: 575,
            $: {
                '0': { v: '098771', n: 1 },
                '1': { v: 'שוק ההון והשקעות', n: 0.577 },
                '2': {
                    v: 'הקורס סוקר שווקים לניירות ערך וניירות הערך הנסחרים בהם. הקורס מתמקד ביישומי ניתוח שונות בניהול תיקי השקעות, מודל תמחיר ( CAMP ), יעילות שוק ומדדי ביצוע.',
                    n: 0.196,
                },
            },
        },
        {
            i: 576,
            $: {
                '0': { v: '098782', n: 1 },
                '1': { v: 'אסטרטגיה תחרותית', n: 0.707 },
                '2': {
                    v: 'הקורס מתמקד בנושאים האסטרטגיים העומדים בפני המנהל וההנהלה הבכירה של ארגונים המתמודדים בתחרות העולמית: יכולות אסטרטגיות והמרחב התחרותי, הסביבה והמתחרים העולמיים, קביעת גבולות עיסקיים של הארגון וניהול סינרגטי של יחידותיו השונות, ניהול תחרותי דינמי ואסטרטגיה של שינויים אסטרטגיים, יישום אסטרטגי ותיפקודה של מועצת המנהלים.',
                    n: 0.151,
                },
            },
        },
        {
            i: 577,
            $: {
                '0': { v: '098788', n: 1 },
                '1': { v: 'יזמות ופיתוח עסקי', n: 0.577 },
                '2': {
                    v: 'תהליך זיהוי ופיתוח של רעיון עיסקי עד לגיבושו לנייר עבודה. בקורס יידונו המידע והנתונים הדרושים, וכן יוגדרו הכלים לעיבודם להכנת דו"ח קדם פרוייקט ( PRE-FEASIBILITY REPORT ). החומר התיאורטי והשיטות הטכניות ייושמו בפרוייקט מעשי ברמה התואמת את הדרישות המקובלות של מועצות מנהלים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 578,
            $: {
                '0': { v: '099101', n: 1 },
                '1': { v: 'ויזואליזציה של המידע', n: 0.577 },
                '2': {
                    v: 'ויזואליזציה של המידע )INFORMATION VISUALIZATION( הוא תחום שעוסק בשימוש בשיטות גרפיות שונות על מנת לעזור לאנשים להציג ולנתח מידע. המטרה של הויזואליזציה היא חשיפת המבנה הבסיסי של מערכי נתונים גדולים בעזרת ייצוג חזותי. הקורס מקנה התנסות בשיטות ויזואליזציה שונות באופן שיטתי, תוך ביסוס תיאורטי ומדעי. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל לדעת את העקרונות הבסיסיים הקשורים בויזואליזציה תוך ניתוח והצגה של מידע. להשתמש במגוון שיטות קיימות של ויזואליזציה של המידע. לנתח ולהעריך את איכות הכלים והמערכות המשמשים לייצוג מידע. להשתמש בשיטות ויזואליזציה קיימות של ויזואליזציה של מידע. לנתח ולהעריך את איכות הכלים והמערכות המשמשים לייצוג מידע. להשתמש בשיטות ויזואליזציה קיימות וחדשות לייצוג מידע של מגוון סוגי נתונים.',
                    n: 0.096,
                },
            },
        },
        {
            i: 579,
            $: {
                '0': { v: '099103', n: 1 },
                '1': { v: 'מרשתת הדברים,טכנולוגיה ושימושים', n: 0.577 },
                '2': {
                    v: 'הקורס מקנה ידע כולל ומקיף בנושא IOT ומכיל מבוא ל- IOT, מבוא ל- BIG DATA במערכות IOT, פרקים נבחרים בתקשורת מחשבים, מחשוב ענן והגנת מערכות IOT. בנוסף הקורס מציג נושאים נבחרים ב- INDUSTRIAL IOT, ניהול ערים חכמות ו- SOCIAL IOT. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל להבין את הסביבה הטכנולוגית שבה פועלים מוצרי IOT, להבין כיצד עובדות מערכות BIG DATA ותקשורת נתונים במערכות IOT, להבין בעיות אבטחה בחישוביות ענן, לדעת כיצד ניתן להביא ערך לתעשייה מסורתית ולנהל מערכות שונות באמצעות מערכות IOT, בבית חכם, ערים חכמות ועוד, ע"י שימוש בשירותי ענן.',
                    n: 0.104,
                },
            },
        },
        {
            i: 580,
            $: {
                '0': { v: '099104', n: 1 },
                '1': { v: 'סדנא בניהול צוותים', n: 0.577 },
                '2': {
                    v: 'בקורס זה נלמד כיצד לנהל צוותים בצורה אפקטיבית, תוך הבנת תהליכים צוותיים וגורמים המשפיעים על ביצועי הצוות. נלמד אודות מאפייני צוות (כגון תמהיל הצוות והמגוון שבו), תהליכי צוות (כגון פיתוח הצוות, תקשורת ותהליכי קבלת החלטות) והשפעתם על תוצרי הצוות (כגון שיתוף פעולה, פרודוקטיביות, יצירתיות). תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל לזהות ולהבין צרכים, מאפיינים ודפוסי עבודה של צוותים מסוגים שונים. להבין מרכיבים חיוניים בתהליכי קבלת החלטות ויישומן. להבין וליישם גישות ניהוליות שונות של צוותים. לזהות ולהבין דפוסי תקשורת וקונפליקטים בצוותים תוך יישום פתרונות מתאימים. להבין את מורכבות תפקודם של צוותים גלובליים ודרכי',
                    n: 0.104,
                },
            },
        },
        {
            i: 581,
            $: {
                '0': { v: '099105', n: 1 },
                '1': { v: 'נושאים נבחרים במימון מיזמים', n: 0.5 },
                '2': {
                    v: 'קידום מיזם חדש דורש משאבים, בין שמדובר בהקמת מיזם חדש או בקידום מוצר חדש בתוך ארגון קיים. הקורס מקנה כלים לתכנון המימון של מיזם חדש, מזהה את צרכי המימון ומחשב את הערך של המיזם. הכלים משמשים הן את היזמים והם את המשקיעים ששוקלים להשקיע במיזם. הסטודנטים מצופים לפתח רעיון שלהם למיזם חדש במהלך הקורס. תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים ירכשו:\n1. ידע במימון יזמי ויישום המושגים לפתרון בעיות של מיזם חדש .\n.2.1יכולת להשתמש בשיטות כמותיות לפתרון בעיות מיזם חדש.\n2. מיומנויות תקשורת וידע בתחום המימון.\n1.2 הצגת מילולית של ניתוח מימון המיזם_\n2.2 מיומנויות חיפוש בבסיסי נתונים וזהוי מידע רלבנטי לבעייה_.\n3. בניית צוות וניהול הצוות לפיתוח תכנית עסקית 4. מיומנויות טכנולוגיות.\n1.4 שימוש באקסל לפתרונות מורכבים.',
                    n: 0.094,
                },
            },
        },
        {
            i: 582,
            $: {
                '0': { v: '099601', n: 1 },
                '1': { v: 'סמינר מתקדם במחקר פסיכולוגי', n: 0.5 },
                '2': {
                    v: 'בסמינר יידונו בבעיות בהן עוסקת הפסיכולוגיה התעשייתית המודרנית: חלוקת העבודה בין אדם ומכונה אספקטים פסיכולוגיים של תמריצים כספיים. מודל התעוררות. מהות היצירתיות ומדדי הדרכה מתוכננת, רכישת מיומנות בתעשיה. גישות חדשות להנעה בתעשיה, גורמים סביבתיים המשפיעים על תהליך העבודה, עמדות של מנהלים.',
                    n: 0.156,
                },
            },
        },
        {
            i: 583,
            $: {
                '0': { v: '099624', n: 1 },
                '1': { v: 'סמינר מחקר אישי', n: 0.577 },
                '2': {
                    v: 'צבירת 8 נקודות מוסמכים לפחות. התלמיד יבצע עבודת מחקר אינדיבידואלית על נושא לפי בחירתו, באישור ובהנחית אחד ממורי המגמה. העבודה יכולה להתייחס לניתוח נתונים קיימים, לעבודה ביבליוגרפית, לפיתוח מתודולוגיה חדשה וכיו"ב.',
                    n: 0.18,
                },
            },
        },
        {
            i: 584,
            $: {
                '0': { v: '099745', n: 1 },
                '1': { v: 'נושאים נבחרים ביזמות', n: 0.577 },
                '2': {
                    v: 'הקורס ידון בנושאים שונים בתחום היזמות ויהיה מוקדש מפעם לפעם לסדרת נושאים על פי קביעתו של המורה האחראי. סמסטרא\' תשע"ח: לין סטרטאפ.',
                    n: 0.213,
                },
            },
        },
        {
            i: 585,
            $: {
                '0': { v: '099746', n: 1 },
                '1': { v: 'נושאים נבחרים בניהול אסטרטגי', n: 0.5 },
                '2': {
                    v: 'הקורס ירחיב נושאים במינהל עסקים אשר אינם נדונים בקורסים אחרים ויהיה מוקדש לפעם לפעם לנושא נבחר לפי קביעתו של המורה האחראי. סמסטר ב\' תשע"ז: יזמות בינלאומית סמסטר א\' תשע"ח: ניהול הטאלנט.',
                    n: 0.18,
                },
            },
        },
        {
            i: 586,
            $: {
                '0': { v: '099772', n: 1 },
                '1': { v: 'נושאים נבחרים בחשבונאות', n: 0.577 },
                '2': {
                    v: 'נושאים מתקדמים בחשבונאות אשר אינם נלמדים בקורסים האחרים. כל סמסטר יוקדש לנושא אחר. סמסטר א\' תשע"ט: אמינות הדוחות הכספיים וחיזוי קשיים פיננסיים. סמסטר א\' תש"ף: אמינות הדוחות הכספיים וחיזוי קשיים פיננסיים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 587,
            $: {
                '0': { v: '099787', n: 1 },
                '1': { v: 'נושאים נבחרים בשיווק 1', n: 0.5 },
                '2': {
                    v: 'הקנית ידע עיוני ומעשי בנושאים שונים בתחום השיווק, כפי שיקבעו על ידי המורה האחראי. הקורס מתמקד בנושאים עדכניים ומרכזיים בשיווק הכוללים תחומים כגון, התנהגות צרכנים, שיווק בינלאומי, החדרת מוצרים חדשים, שיווק שירותים ומודלים כמותיים בשיווק.',
                    n: 0.169,
                },
            },
        },
        {
            i: 588,
            $: {
                '0': { v: '099792', n: 1 },
                '1': { v: 'נהול תהליך החדשנות', n: 0.577 },
                '2': {
                    v: 'איפיון ניהול תהליכי החדשנות לגבי חברות, יזמים וקרנות הון-סיכון. תעשייה בטחונית וציבורית, אקדמיה, שיטות לעידוד החדשנות, להערכה ולבחירה של מוצרים חדשניים, להכנת הצעה טכנית למוצר והתארגנות ניהולית.',
                    n: 0.192,
                },
            },
        },
        {
            i: 589,
            $: {
                '0': { v: '099793', n: 1 },
                '1': { v: 'הזדמנות שוק לחדשנות טכנולוגית', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק באחת השאלות המהותיות עבור יזמים טכנולוגים:באיזה שוק כדאי להתמקד. הסטודנטים ילמדו כיצד לזהות, להעריך ולתעדף הזדמנויות שוק שונות עבור חדשנות טכנולוגית, ויישמו את הנלמד על מיזמים אמיתיים בכדי לקבוע עבורם אסטרטגיית מיקוד מנצחת. הקורס מבוסס על מתודולוגיה מובנית בת שלושה שלבים המבוססת על מאות מקרי בוחן. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל לזהות יישומים וקהלי יעד שונים לחדשנות טכנולוגית. לנתח את הפוטנציאל הטמון בכל הזדמנות שוק. לנתח את האתגרים ביישום הזדמנויות שוק שונות. לקבוע אסטרטגיית מיקוד מיטבית לחברה. להבין כיצד אפשר לאזן בין מיקוד וגמישות בחברות סטארט-אפ. להבין כיצד הכלים הנלמדים בקורס מתחברים ומוסיפים ערך לכלים אסטרטגיים נוספים הנלמדים בקורסים אחרים.',
                    n: 0.098,
                },
            },
        },
        {
            i: 590,
            $: {
                '0': { v: '099794', n: 1 },
                '1': { v: 'סוגיות בשיווק עכשווי', n: 0.577 },
                '2': {
                    v: 'השיווק הופך למרכיב מכריע בפעילות של כל ארגון. במהלך הקורס נבחן שינויים ומגמות בתחום השיווק בדגש על תחום השיווק הדיגיטלי. ננתח שימוש בכלים הדיגיטליים על ידי המותגים הגדולים בעולם ונלמד כיצד מתמודדים מול אתגרים בתחום תוך ניצול ההזדמנויות החדשות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל לתכנן פעילות בתחום השיווק הדיגיטלי. למדוד אפקטיביות של קמפיינים ברשת. לאפיין אתגרים בתחומי הפעילות הדיגיטליים. לזהות הזדמנויות בתחומים כגון קידום אורגני וקידום ממומן. להבין כיצד פועלים בצורה נכונה ברשתות החברתיות. למצוא מקורות להמשך עדכון ולמידת התחום בעתיד.',
                    n: 0.11,
                },
            },
        },
        {
            i: 591,
            $: {
                '0': { v: '103015', n: 1 },
                '1': { v: 'השלמות מתמטיקה', n: 0.707 },
                '2': {
                    v: 'חשבון בסיסי וטכניקה אלגברית. סדרות חשבוניות וגיאומטריות, אינדוקציה מתמטית. משוואות ואי שוויוניות. פונקציות וגרפים. משוואות ריבועיות והפונקציה הריבועית. פולינומים, שורשים ופונקציות רציונאליות. פונקציות מעריכיות ולוגריתמיות. טריגונומטריה. וקטורים. גיאומטריה אנליטית במישור ובמרחב. מספרים מרוכבים. גבולות ונגזרות. חקירת פונקציות. אינטגרלים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 592,
            $: {
                '0': { v: '104000', n: 1 },
                '1': { v: 'מוכנות מתמטית לפיזיקה', n: 0.577 },
                '2': {
                    v: 'מבוא מזורז של אינטגרציה במשתנה אחד ובמספר משתנים. פתרון משוואות דיפרנציאליות רגילות עם מקדמים קבועים. כלל השרשרת במספר משתנים. אינטגרלים קוויים ומשטחיים מסוג ראשון ושני. משפטי גרין, גאוס וסטוקס. שדות וקטוריים משמרים. (הקורס מיועד למסלול מתמטיקה-פיסיקה בלבד ומטרתו לתת לסטודנטים את הרקע המתמטי הנדרש למקצועות הלימוד בפיסיקה של שנה א).',
                    n: 0.141,
                },
            },
        },
        {
            i: 593,
            $: {
                '0': { v: '104002', n: 1 },
                '1': { v: 'מושגי יסוד במתמטיקה', n: 0.577 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. לוחות אמת, טאוטולוגיות, קבוצות, פעולות בין קבוצות, הקשר לפעולות הלוגיות, קבוצת החזקה, יחסים, פונקציות - תכונות, הרכב, פונקציות הפוכות, תמורות - זוגיות ואיזוגיות, יחסי שקילות, יחסי סדר סופיים ואינסופיים, קבוצות ניתנות להימנות, משפט קנטור, מספרים רציונליים ואי רציונליים, פיתוח עשרוני אינסופי כדוגמה לגבול, אינדוקציה, משפט הול, עקרון שובך היונים.',
                    n: 0.113,
                },
            },
        },
        {
            i: 594,
            $: {
                '0': { v: '104003', n: 1 },
                '1': { v: 'חשבון דיפרנציאלי ואינטגרלי 1', n: 0.5 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. המספרים הממשיים. פונקציה ממשית של משתנה ממשי יחיד: גבולות ורציפות, רציפות על קטע סגור, פונקציות מונוטוניות ופונקציות הפוכות. גזירות והמשפטים היסודיים של החשבון הדיפרנציאלי. משפט טיילור, כלל לופיטל, חקירת פונקציה. פונקציה קדומה ושיטות אינטגרציה - אינטגרל מסוים ותכונותיו, פונקציות אינטגרביליות, משפטים יסודיים של החשבון האינטגרלי, אינטגרל מוכלל. סדרות וטורים אינסופיים של מספרים ממשיים. טורי חזקות.',
                    n: 0.108,
                },
            },
        },
        {
            i: 595,
            $: {
                '0': { v: '104004', n: 1 },
                '1': { v: 'חשבון דיפרנציאלי ואינטגרלי 2', n: 0.5 },
                '2': {
                    v: 'וקטורים, מכפלה סקלרית ווקטורית. גיאומטריה במרחב. תכונות יסודיות של פונקציות ממשיות של כמה משתנים. חקירת פונקציות של כמה משתנים. פונקציות סתומות. אינטגרלים מרובים ותכונות יסודיות. שיטות אינטגרציה ונוסחת החלפת המשתנים באינטגרלים מרובים. אנליזה וקטורית. אינטגרלים קוויים ואינטגרלים משטחיים מסוגים שונים. נוסחאות גרין, סטוקס והדיברגנס. שימושים בגיאומטריה ובפיסיקה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 596,
            $: {
                '0': { v: '104013', n: 1 },
                '1': { v: "חשבון דיפרנציאלי ואינטגרלי 2ת'", n: 0.5 },
                '2': {
                    v: 'וקטורים וגיאומטריה מרחבית. תכונות יסודיות של פונקציות ממשיות של כמה משתנים. הגרדיאנט, דיפרנציאביליות וכלל השרשרת. פונקציות סתומות. הפולינום של טיילור ונקודות קיצון. נקודות קיצון תחת אילוצים. אינטגרלים מרובים. אנליזה וקטורית, אינטגרלים קוויים ומשטחיים, משפטי גרין גאוס וסטוקס.',
                    n: 0.164,
                },
            },
        },
        {
            i: 597,
            $: {
                '0': { v: '104016', n: 1 },
                '1': { v: "אלגברה 1מ'", n: 0.707 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. שדות, מספרים מרוכבים. וקטורים ב-3R מערכות משוואות לינאריות ומטריצות, שיטת החילוץ, מטריצה הפיכה, דטרמיננטים. מרחבים לינאריים, בסיס וממד. טרנספורמציות לינאריות, ייצוג ע"י מטריצות, דמיון. ערכים עצמיים, לכסון, משפט קיילי-המילטון.',
                    n: 0.13,
                },
            },
        },
        {
            i: 598,
            $: {
                '0': { v: '104019', n: 1 },
                '1': { v: "אלגברה ליניארית מ'", n: 0.577 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. הערה: סך כל שעות הרצאה בשבוע - 3.5 שעות. שדות. מספרים מרוכבים. פולינומים ושורשיהם. מערכות משוואות לינאריות ומטריצות. שיטת החילוץ של גאוס. דטרמיננטים. מרחבים וקטוריים. תת-מרחבים. פרישה, תלות לינארית. בסיס ומימד של מרחב וקטורי. דרגה של מטריצה. מטריצה הפיכה. טרנספורמציות לינאריות. גרעין ותמונה. ייצוג אופרטורים לינאריים ע"י מטריצות. דמיון מטריצות. ערכים עצמיים ווקטורים עצמיים. מטריצות הניתנות ללכסון.',
                    n: 0.107,
                },
            },
        },
        {
            i: 599,
            $: {
                '0': { v: '104022', n: 1 },
                '1': { v: "חשבון דיפרנציאלי ואינטגרלי 2מ'", n: 0.5 },
                '2': {
                    v: 'וקטורים וגיאומטריה מרחבית. תכונות יסודיות של פונקציות ממשיות של כמה משתנים. חקירת פונקציות של כמה משתנים. פונקציות סתומות. אינטגרלים מרובים. אנליזה וקטורית. אינטגרלים קוויים ומשטחיים. הקורס נבדל מהקורס 104004 בהעמקה נוספת תיאורטית ויישומית כאחד.',
                    n: 0.171,
                },
            },
        },
        {
            i: 600,
            $: {
                '0': { v: '104030', n: 1 },
                '1': { v: 'מבוא למשוואות דיפרנציאליות חלקיות', n: 0.5 },
                '2': {
                    v: 'משוואות לינאריות וקוואזי-לינאריות מסדר ראשון - פתרון בעית התחלה באמצעות שיטת הקווים האופייניים. משוואת הגלים במקדמים קבועים, המשוואה הלא-הומגנית, הבעיה המעורבת, פתרון בעזרת טורי פוריה, קרקטריסטיקות עבור משוואות קוואזי-לינאריות בשני משתנים, מיון משוואות מסדר שני וצורות קנוניות, מוצגות היטב, משפט קושי-קובלבסקי (ללא הוכחה), הדוגמה של האנס לוי (ללא הוכחה), פונקציות הרמוניות: תכונת הממוצע ועיקרון המכסימום, פונקצית גרין, גרעין פואסון, פתרון בעית דיריכלה באמצעות שיטת PERRON, הפתרון היסודי של משוואת החום, בעית התחלה במרחב כולו, עיקרון המכסימום החלש, יחידות הפתרון החסום לבעית התחלה במרחב כולו, הבעיה המעורבת בפס אינסופי, משוואת הגלים במימד N: שיטת הממוצעים הספריים, הפתרון במימד 3, הפתרון במימד 2.',
                    n: 0.1,
                },
            },
        },
        {
            i: 601,
            $: {
                '0': { v: '104031', n: 1 },
                '1': { v: "חשבון אינפיניטסימלי 1מ'", n: 0.577 },
                '2': {
                    v: 'מקצועות קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. שדה המספרים הממשיים. גבולות של סדרות ושל פונקציות ממשיות של משתנה יחיד. רציפות ורציפות במידה שווה של פונקציות של משתנה יחיד. הנגזרת, המשפטים היסודיים על נגזרות. נוסחת טיילור ושימושיה. חקירת פונקציות.',
                    n: 0.127,
                },
            },
        },
        {
            i: 602,
            $: {
                '0': { v: '104032', n: 1 },
                '1': { v: "חשבון אינפיניטסימלי 2מ'", n: 0.577 },
                '2': {
                    v: 'האינטגרל הלא מסויים: פונקציות קדומות ושיטות אינטגרציה. האינטגרל המסויים של רימן כולל אינטגרל מוכלל: תכונות ושימושים. טורים מספריים אינסופיים: סדרות וטורי פונקציות, התכנסות במידה שווה. פונקציות בכמה משתנים, רציפות, נגזרות חלקיות, גזירות. גזירה תחת סימן האינטגרל. אינטגרל כפול כולל אינטגרל כפול מוכלל, שטח במישור.',
                    n: 0.151,
                },
            },
        },
        {
            i: 603,
            $: {
                '0': { v: '104033', n: 1 },
                '1': { v: 'אנליזה וקטורית', n: 0.707 },
                '2': {
                    v: 'וקטורים, מישורים, ישרים, משטחים ועקומים במרחב. אינטגרלים משולשים, אינטגרלים קוויים ומשפט גרין. שדות משמרים דו ממדיים, לרבות שדות סינגולריים. אינטגרלים משטחיים, משפט גאוס וסטוקס. פונקציות סתומות, משפטי מינימום-מקסימום בכמה משתנים עם ובלי אילוצים.',
                    n: 0.174,
                },
            },
        },
        {
            i: 604,
            $: {
                '0': { v: '104034', n: 1 },
                '1': { v: "מבוא להסתברות ח'", n: 0.577 },
                '2': {
                    v: "מרחבי הסתברות, אקסיומות, הסתברות מותנית. מאורעות בלתי תלויים. ניסויי ברנולי. משתנים מקריים בדידים, רציפים ומעורבים. פונקציות התפלגות, צפיפות והסתברות. התפלגויות חשובות. תוחלת ומומנטים. טרנספורמציות. האי שוויון של ינסן. וקטורים אקראיים. התפלגויות משותפות ומותנות. קורלציה, וקטורים, גאוסים. פונקציה אופיינית. האי שוויון של צ'בישב. חוק המספרים הגדולים. משפט הגבול המרכזי.",
                    n: 0.144,
                },
            },
        },
        {
            i: 605,
            $: {
                '0': { v: '104035', n: 1 },
                '1': { v: "משוואות דיפ' רגילות ואינפי 2ח'", n: 0.447 },
                '2': {
                    v: 'אינטגרלים לא מסויימים ומסויימים. משוואות דיפרנציאליות רגילות מסדר ראשון. משפט הקיום והיחידות. משוואות דיפרנציאליות רגילות לינאריות מסדר גבוה. יציבות. מערכות של משוואות לינאריות. מישור הפאזה. אינטגרלים מוכללים. טורי מספרים. טורי פונקציות והתכנסות במידה שווה. טורי חזקות. פתרון משוואות דיפרנציאליות בעזרת טורי חזקות.',
                    n: 0.154,
                },
            },
        },
        {
            i: 606,
            $: {
                '0': { v: '104036', n: 1 },
                '1': { v: "חשבון דיפרנציאלי ואינטגרלי 1ת'", n: 0.5 },
                '2': {
                    v: 'המספרים הממשיים. סדרות אינסופיות של מספרים ממשיים, תתי סדרות (כולל משפט בולצאנו ויירשטראס). פונקציה ממשית של משתנה יחיד: גבולות ורציפות, פונקציות רציפות על קטע סגור (משפטי ויירשטראס, משפט ערך הביניים), פונקציות מונוטוניות ופונקציות הפוכות. גזירות והמשפטים היסודיים של החשבון הדיפרנציאלי: משפטי פרמה, רול, לגרנז וקושי. כלל לופיטל, משפט טיילור, חקירת פונקציה. פונקציה קדומה ושיטות אינטגרציה, אינטגרל מסוים ותכונותיו, פונקציות אינטגרביליות, המשפט היסודי של החשבון הדיפרנציאלי והאינטגרלי, אינטגרל מוכלל. טורים מספריים. הערה: דרך הוראת הקורס נבדלת מזו של הקורס חדו"א 1מ 104018 בהעמקה נוספת, תיאורטית ויישומית כאחד.',
                    n: 0.108,
                },
            },
        },
        {
            i: 607,
            $: {
                '0': { v: '104038', n: 1 },
                '1': { v: "אלגברה 2מ'", n: 0.707 },
                '2': {
                    v: "שיטות לפתרון מערכות משוואות לינאריות: פירוק LU, נורמות של וקטורים ומטריצות, שיטות איטרטיביות. מרחבי מכפלה פנימית: אי שוויון קושי שוורץ, המשלים הניצב ותהליך גרם-שמידט, הטלות אורתוגונליות, בסיסים אורתונורמליים, אי שוויון בסל, פירוק QR. אופרטורים במרחבי מכפלה פנימית: פונקציונלים לינאריים, משפט ריס והאופרטור הצמוד, אופרטורים נורמליים, צמודים לעצמם, אוניטריים, חיוביים. משפט הפירוק הספקטרלי, לכסון אורתוגונלי, צורת ג'ורדן, משפט הפירוק הפולרי, פירוק SVD ופירוק CHOLESKY. משפט המינ-מקס ומנת ריילי. תבניות בילינאריות וריבועיות, זהות הפולריזציה, מיון תבניות ריבועיות מעל הממשיים: חפיפת מטריצות, משפט ההתמדה של סילבסטר. אלגברה וחשבון של טנזורים",
                    n: 0.107,
                },
            },
        },
        {
            i: 608,
            $: {
                '0': { v: '104041', n: 1 },
                '1': { v: 'חשבון דיפרנציאלי ואינטגרלי 1מ1', n: 0.5 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. המספרים הממשיים. סדרות אינסופיות של מספרים ממשיים. פונקציה ממשית של משתנה יחיד: גבולות ורציפות, רציפות על קטע סגור פונקציות מונוטוניות ופונקציות הפוכות. גזירות והמשפטים היסודיים של החשבון הדיפרנציאלי. כלל לופיטל, משפט טיילור, חקירת פונקציה. פונקציה קדומה ושיטות אינטגרציה - אינטגרל מסויים ותכונותיו, פונקציות אינטגרביליות, משפטים יסודיים של החשבון האינטגרלי, אינטגרל מוכלל. הגדרת פונקציה בצורת אינטגרל. טורים מספריים. סדרות פונקציות, טורי פונקציות וטורי חזקות. הערה: הקורס נבדל מהקורס 104003 בהעמקה נוספת תיאורטית ויישומית כאחד.',
                    n: 0.099,
                },
            },
        },
        {
            i: 609,
            $: {
                '0': { v: '104042', n: 1 },
                '1': { v: 'חשבון דיפרנציאלי ואינטגרלי 1מ2', n: 0.5 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. המספרים הממשיים. סדרות אינסופיות של מספרים ממשיים. פונקציה ממשית של משתנה יחיד: גבולות ורציפות, רציפות על קטע סגור פונקציות מונוטוניות ופונקציות הפוכות. גזירות והמשפטים היסודיים של החשבון הדיפרנציאלי. כלל לופיטל, משפט טיילור, חקירת פונקציה. פונקציה קדומה ושיטות אינטגרציה - אינטגרל מסויים ותכונותיו, פונקציות אינטגרביליות, משפטים יסודיים של החשבון האינטגרלי, אינטגרל מוכלל. הגדרת פונקציה בצורת אינטגרל. טורים מספריים. סדרות פונקציות, טורי פונקציות וטורי חזקות. הערה: הקורס נבדל מהקורס 104003 בהעמקה נוספת תיאורטית ויישומית כאחד.',
                    n: 0.099,
                },
            },
        },
        {
            i: 610,
            $: {
                '0': { v: '104043', n: 1 },
                '1': { v: 'חשבון דיפרנציאלי ואינטגרלי 2מ1', n: 0.5 },
                '2': {
                    v: 'וקטורים וגיאומטריה מרחבית. תכונות יסודיות של פונקציות ממשיות של כמה משתנים. חקירת פונקציות של כמה משתנים. פונקציות סתומות. אינטגרלים מרובים. אנליזה וקטורית. אינטגרלים קוויים ומשטחיים. הקורס נבדל מהקורס 104004 בהעמקה נוספת תיאורטית ויישומית כאחד.',
                    n: 0.171,
                },
            },
        },
        {
            i: 611,
            $: {
                '0': { v: '104066', n: 1 },
                '1': { v: "אלגברה א'", n: 0.707 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. הגדרת המושג שדה ודוגמאות לשדות, בפרט שדות סופיים (מודולו פי ). מספרים מרוכבים ופולינומים במספרים מרוכבים. מטריצות ופעולות חשבון בין מטריצות. פעולות אלמנטריות על שורות מטריצה ומטריצות אלמנטריות, דרוג מטריצות. מערכת משוואות לינאריות. מרחבים ווקטוריים ותתי מרחבים. תת המרחב הנפרש ע י קבוצת וקטורים ואי תלות בין וקטורים. בסיס ומימד של מרחב וקטורי. מטריצות הפיכות. שינוי בסיס ומטריצת מעבר בין בסיסים. העתקות לינאריות. מטריצה מייצגת של אופרטור לינארי ודמיון מטריצות. דטרמיננטות. ערכים עצמיים ווקטורים עצמיים. לכסון אופרטורים ומטריצות.',
                    n: 0.096,
                },
            },
        },
        {
            i: 612,
            $: {
                '0': { v: '104112', n: 1 },
                '1': { v: 'גיאומטריה וסימטריה', n: 0.707 },
                '2': {
                    v: 'שיקופים וסיבובים במישור ובמרחב, חבורת התנועות הצפידות במישור ובמרחב (חבורת האיזומטריות האוקלידיות). מבנה החבורה האורתוגונלית O(3) והחבורה האוניטרית U(2). שדות וקטוריים על הספירה, יוצרים אינפיניטיסימליים, אופרטורי תקיפת הסיבוב, אלגברת לי, הלפלסיאן. פעולות של חבורות. חבורות איזומטריה. מבוא לגיאומטריה ספרית, מבוא לגיאומטריה היפרבולית, נושאים נוספים עפ"י בחירת המרצה.',
                    n: 0.146,
                },
            },
        },
        {
            i: 613,
            $: {
                '0': { v: '104122', n: 1 },
                '1': { v: 'תורת הפונקציות 1', n: 0.577 },
                '2': {
                    v: 'שדה המספרים המרוכבים. המישור המרוכב המורחב (כדור רימן). סדרות וטורים של מספרים מרוכבים. פונקציות אנליטיות. משוואות קושי-רימן. פונקציות הרמוניות. הפונקציות האנליטיות האלמנטריות. ענפים של פונקציות רב-ערכיות. אינטגרלים קוויים של פונקציות מרוכבות. משפט קושי. נוסחת קושי. משפט ליוביל. עקרון המקסימום. טורי טילור וטורי לורן. אפסים ונקודות סינגורליות של פונקציות אנליטיות. משפט השארית ושימושיו. עקרון הארגומנט, העתקות קונפורמיות (כולל משפט רימן ללא הוכחה).',
                    n: 0.128,
                },
            },
        },
        {
            i: 614,
            $: {
                '0': { v: '104131', n: 1 },
                '1': { v: "משוואות דיפרנציאליות רגילות ח'", n: 0.5 },
                '2': {
                    v: 'מקצועות קדם: אחד מהמקצועות (104018, 104003, 104041, 104042) ואחד מהמקצועות (104016, 104019, 104166). מבוא. דוגמאות ושימושים למשוואות דיפרנציאליות. משוואות מסדר ראשון: משוואות ניתנות להפרדה, משוואות לינאריות, שיטות אד-הוק. משפט קיום ויחידות לבעיות התחלה. משוואות לינאריות מסדר שני ומעלה: בסיס, ורונסקיאן, משוואות עם מקדמים קבועים, משוואות אי-הומוגניות, השוואת מקדמים, וריאציה של פרמטרים. פתרון בעזרת טורי חזקות, מערכות של משוואות, מושגי היציבות, מערכות אי-הומוגניות. התמרת לפלס, קיום ושימושים.',
                    n: 0.123,
                },
            },
        },
        {
            i: 615,
            $: {
                '0': { v: '104134', n: 1 },
                '1': { v: "אלגברה מודרנית ח'", n: 0.577 },
                '2': {
                    v: "המספרים השלמים ותכונותיהם. יחסי שקילות. מבוא לתורת החבורות. תתי חבורות: משפט לגרנז' ושימושיו. תת חבורות נורמליות וחבורות מנה. משפט ההומומורפיזם ושימושיו. מבוא לתורת החוגים. חוג השאריות מודולו N ושימושיו להצפנה ציבורית. אידאלים, חוגי מנה וההומומורפיזם של חוגים. חוג הפולינומים במשתנה יחיד מעל שדה ושמושיו לבניית שדות הרחבה. שדות סופיים: קיום, בניות מפורשות והיבטים חישוביים.",
                    n: 0.136,
                },
            },
        },
        {
            i: 616,
            $: {
                '0': { v: '104135', n: 1 },
                '1': { v: "משוואות דפרנציאליות רגילות ת'", n: 0.5 },
                '2': {
                    v: 'מבוא, דוגמאות ושימושים למשוואות דיפרנציאליות. משוואות מסדר ראשון: משוואות ניתנות להפרדה, משוואות לינאריות, שיטות אד-הוק, משפט קיום ויחידות לבעיות התחלה. משוואות ליניאריות מסדר שני ומעלה: בסיס, ורונסקיאן, משוואות עם מקדמים קבועים, משוואות אי-הומוגניות, השוואת מקדמים, וריאציה של פרמטרים. מערכות של משוואות, מערכות אי-הומוגניות. יסודות התיאוריה האיכותית: מושג היציבות, מישור הפאזות. פתרון בעזרת טורי חזקות.',
                    n: 0.136,
                },
            },
        },
        {
            i: 617,
            $: {
                '0': { v: '104142', n: 1 },
                '1': { v: 'מבוא למרחבים מטריים וטופולוגיים', n: 0.5 },
                '2': {
                    v: 'הגדרות ודוגמאות. רציפות. משפט ההשלמה, משפט בייר, משפט נקודת השבת (בנך). קומפקטיות, קומפקטיות סדרתית, מספר לבג וחסימות כליל. קומפקטיות. קומפקטיות במרחבים מטריים מקומית, משפט ארצלה-אסקולי, קומפקטיפיקציה חד-נקודתית. קשירות: קשירות מסילתית, מרכיבים קשירים. משפט טיכונוף. בסיס, למת יוריסון ומשפט טיצה, מרחב האוסדורף קומפקטי. נושאים נוספים למשל: משפט סטון-ויירשטרס, משפט לינדלוף, קומפקטפיקציות.',
                    n: 0.141,
                },
            },
        },
        {
            i: 618,
            $: {
                '0': { v: '104158', n: 1 },
                '1': { v: 'מבוא לחבורות', n: 0.707 },
                '2': {
                    v: '1. חבורות, תתי חבורות, חבורות ציקליות, חבורות תמורות. 2. תתי חבורות נורמליות, הומומורפיזמים, מכפלות ישרות, מכפלות חצי ישרות, חבורות מנה, משפטי האיזומורפיזם. 3. משפט המבנה של חבורות חילופיות נוצרות סופית. 4. פעולה של חבורה על קבוצה: מסלולים ומייצבים, הלמה של ברנסייד, משוואת המחלקות. חבורות-P ומשפטי סילו. 5. חבורות חופשיות, החבורה הסימטרית, חבורות פשוטות וחבורות',
                    n: 0.136,
                },
            },
        },
        {
            i: 619,
            $: {
                '0': { v: '104165', n: 1 },
                '1': { v: 'פונקציות ממשיות', n: 0.707 },
                '2': {
                    v: 'בניית מידת לבג ב- R2. קבוצה לא מדידה. פונקציות מדידות לבג ומדידות בורל, משפט אגורוב, משפט לוסין, פונקצית קנטור-לבג. אינטגרציה על מרחב כללי ביחס למידה 0 - סופית. משפטי התכנסות, הקשר בין איטגרל לבג ואינטגרל רימן ב- R2. משפט פוביני. המרחב ב- L1, תכונות בסיסיות ושלמות. הפונקציה המקסימלית של הרדי- ליטלווד ב-R2 ומשפטי הגזירה. פונקציות רציפות בהחלט ב-R2 והקשר למשפט היסודי של החשבון האינטגרלי.',
                    n: 0.125,
                },
            },
        },
        {
            i: 620,
            $: {
                '0': { v: '104166', n: 1 },
                '1': { v: "אלגברה אמ'", n: 0.707 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. הגדרת המושג שדה ודוגמאות לשדות, בפרט שדות סופיים (מודולו P). מספרים מרוכבים ופולינומים במספרים מרוכבים. מטריצות ופעולות חשבון בין מטריצות. פעולות אלמנטריות על שורות מטריצה ומטריצות אלמנטריות, דרוג מטריצות. מערכות משוואות לינאריות. מרחבים וקטוריים ותתי מרחבים. תת המרחב הנפרש ע"י קבוצת וקטורים ואי תלות בין וקטורים. בסיס ומימד של מרחב וקטורי. מטריצות הפיכות. שינוי בסיס ומטריצת מעבר בין בסיסים. העתקות לינאריות מטריצה מיצגת של אופרטור לינארי ודמיון מטריצות. דטרמיננטים. ערכים עצמיים ווקטורים עצמיים. לכסון אופרטורים ומטריצות.',
                    n: 0.097,
                },
            },
        },
        {
            i: 621,
            $: {
                '0': { v: '104168', n: 1 },
                '1': { v: "אלגברה  ב'", n: 0.707 },
                '2': {
                    v: "תכונות וחישוב הדטרמיננטה. המטריצה הצמודה. סכומים ישרים והטלות. תתי מרחבים אינווריאנטים, מרחבי מנה. חוג הפולינומים: שורשים ופריקות, אלגוריתם אוקלידס. הפולינומים המינימלי והאופייני ומשפט קיילי המילטון. הפרוק הפרימרי. קיום יחידות צורת ג'ורדן. מכפלה פנימית ואי שוויון קושי שוורץ. ניצבות, בסיס אורתונורמלי ותהליך גרם-שמידט. דואליות, משפט ריס, האופרטור הצמוד. אופרטורים צמודים לעצמם, אוניטריים ונורמלים. לכסון והפרוק ספקטרלי. הפרוק הפולרי. תבניות בילינאריות וריבועיות.",
                    n: 0.129,
                },
            },
        },
        {
            i: 622,
            $: {
                '0': { v: '104174', n: 1 },
                '1': { v: "אלגברה במ'", n: 0.707 },
                '2': {
                    v: "חזרה על סכומים ישרים ומטריצה מיצגת. המטריצה הצמודה. תתי מרחבים שמורים וצמצום של אופרטור לינארי. הפולינום המינימלי והוכחת משפט קיילי המילטון. משפט הפרוק הפרימרי. אופרטורים נילפוטנטיים ואינדקס הנילפוטנטיות. צורת ג'ורדן ודמיון מטריצות מעל C. מרחבי מכפלה פנימית. המשלים הניצב ותהליך גרם - שמידט. האופרטור הצמוד. אופרטורים צמודים לעצמם. הטלות אורתוגונליות. אופרטורים אוניטריים ואיזומטריות. אופרטורים נורמליים. משפט הפרוק הספקטרלי ולכסון אורתוגונלי. אופרטורים חיוביים ומשפט הפרוק הפולרי. פונקציונליים לינאריים והמרחב הדואלי. תבניות בילינאריות ותבניות ריבועיות. חפיפה מטריצות. הדטרמיננטה כתבנית נפח. נושאים נוספים ככל שירשה הזמן.",
                    n: 0.11,
                },
            },
        },
        {
            i: 623,
            $: {
                '0': { v: '104177', n: 1 },
                '1': { v: 'גיאומטריה דיפרנציאלית', n: 0.707 },
                '2': {
                    v: 'איזומטריות של RN האקלידי. עקומים ב- R2 ו- R3. נוסחאות פרנה. משטחים ב- R3, תבניות יסודיות, משפט אוילר, איזומטריות של משטחים, עקמומיות גאוס, המשפט הנפלא של גאוס. גאודטים, קואורדינטות גאודזיות, למת גאוס. עקמומיות גאודזית, משפט גאוס-בונה.',
                    n: 0.167,
                },
            },
        },
        {
            i: 624,
            $: {
                '0': { v: '104181', n: 1 },
                '1': { v: 'סמינר באנליזה להסמכה 1', n: 0.5 },
                '2': { v: 'לימוד פרקים נבחרים באנליזה.', n: 0.5 },
            },
        },
        {
            i: 625,
            $: {
                '0': { v: '104183', n: 1 },
                '1': { v: 'סמינר באלגברה להסמכה 1', n: 0.5 },
                '2': { v: 'לימוד פרקים נבחרים באלגברה.', n: 0.5 },
            },
        },
        {
            i: 626,
            $: {
                '0': { v: '104185', n: 1 },
                '1': { v: 'סמינר לסטודנ.בהסמכה1', n: 0.707 },
                '2': { v: 'דיון בבעיות מכל שטחי המתמטיקה.', n: 0.447 },
            },
        },
        {
            i: 627,
            $: {
                '0': { v: '104192', n: 1 },
                '1': { v: 'מבוא למתמטיקה שימושית', n: 0.577 },
                '2': {
                    v: 'בנית המודלים. אנליזת מימדים. שיטות דמיות. מבוא לתורת ההפרעות. מבוא לתורה האיכותית של משוואות דיפרנציאליות רגילות. יציבות של מערכות לינאריות. מערכות לא לינאריות מסדר שני. מישור פאזה. יציבות של שיווי משקל. פתרונות מחזוריים. (הסתעפויות. מבוא לטורי פורייה. טורי פורייה בדידים. התמרת פורייה מהירה. מבוא לשיטות ספקטרליות בעיבוד אותות).',
                    n: 0.144,
                },
            },
        },
        {
            i: 628,
            $: {
                '0': { v: '104193', n: 1 },
                '1': { v: 'תורת האופטימיזציה', n: 0.707 },
                '2': {
                    v: 'אופטימיזציה בלי אילוצים. קבוצות קמורות ופונקציות קמורות. שיטות איטרטיביות עבור אופטימיזציה בלי אילוצים. אופטימיזציה קמורה עם תנאי קרוש-קון-טקר. שיטות קנס. אופטימיזציה עם אילוצי שויון. תת-דיפרנציאלים של פונקציות קמורות.',
                    n: 0.189,
                },
            },
        },
        {
            i: 629,
            $: {
                '0': { v: '104195', n: 1 },
                '1': { v: 'חשבון אינפיניטסימלי 1', n: 0.577 },
                '2': {
                    v: 'קדם: בגרות במתמטיקה 5 יח"ל עם ציון 70 ומעלה או ציון עובר בבחינת סיווג במתמטיקה. הקדם לא יופעל עבור סטודנטים הלומדים במסגרת אפיק המעבר המקוצר מלימודי חוץ בשנת הלימודים תשפ"ג. שדה המספרים הממשיים. גבולות של סדרות ושל פונקציות ממשיות של משתנה יחיד. רציפות ורציפות במידה שווה של פונקציות של משתנה יחיד. הנגזרת, המשפטים היסודיים על נגזרות. נוסחת טיילור ושימושיה. חקירת פונקציות.',
                    n: 0.128,
                },
            },
        },
        {
            i: 630,
            $: {
                '0': { v: '104215', n: 1 },
                '1': { v: "פונקציות מרוכבות א'", n: 0.577 },
                '2': {
                    v: 'מספרים מרוכבים. פונקציות מרוכבות, גזירות ואנליטיות, משוואות קושי-רימן. פונקציות הרמוניות. המישור הקומפלקסי המורחב, מושג הקונפורמיות. אינטגרל על מסילה של פונקציה קומפלקסית, משפט קושי. משפט ליוביל והמשפט היסודי של האלגברה. נוסחת קושי לפונקציה ונגזרותיה, טורי חזקות, רדיוס התכנסות, טורי לורן. התמרת Z והתמרת Z הפוכה. אפסים, נקודות סינגולאריות ומיונן. משפט השארית וחישוב שאריות. שימוש לחישוב אינטגרלים ממשיים. עקרון הארגומנט ומשפט רושה.',
                    n: 0.129,
                },
            },
        },
        {
            i: 631,
            $: {
                '0': { v: '104221', n: 1 },
                '1': { v: "פונקצ' מרוכבות והתמרות אינטגרליות", n: 0.5 },
                '2': {
                    v: 'מספרים מרוכבים, פונקציות מרוכבות, גזירות ואנליטיות, משוואות קושי-רימן. פונקציות הרמוניות. המישור הקומפלקסי המורחב, מושג הקונפורמיות. אינטגרל על מסילה של פונקציה קומפלקסית, משפט קושי ומשפט ליוביל. נוסחת קושי לפונקציה ונגזרותיה. טורי חזקות, רדיוס התכנסות, טורי לורן. אפסים, נקודות סינגולאריות ומיונן. משפט השארית וחישוב שאריות. שימוש לחישוב אינטגרלים ממשיים. משפט הארגומנט. התמרת פוריה ותכונותיה. התמרה הפוכה, שוויון פרסבל, קונוולוציה ופונקצית דלתא. שימושים למשוואות דיפ. חלקיות. התמרת לפלס, תכונותיה וההתמרה ההפוכה. שימושים לעיבוד אותות. התמרת Z ושימושיה.',
                    n: 0.116,
                },
            },
        },
        {
            i: 632,
            $: {
                '0': { v: '104222', n: 1 },
                '1': { v: 'תורת ההסתברות', n: 0.707 },
                '2': {
                    v: "מרחבי הסתברות, מאורעות, אקסיומות ההסתברות. קומבינטוריקה, מאורעות תלויים ובלתי תלויים. הסתברות מותנית, משפט ביס. משתנה מקרי - המקרה הבדיד והמקרה הרציף. פונקצית התפלגות וצפיפות. תוחלת, שונות ומומנטים יותר גבוהים. ההתפלגויות הקלסיות, אי-שיוויונות צ'בישף וינסן. סכומים של משתנים מקריים בלתי תלויים, החוק החלש של המספרים הגדולים ויישום למשפט קירוב של ווירשטרס, ווקטורים אקראיים, תוחלת מותנית וקו התסוגה, פונקציות יוצרות. משפט הגבול המרכזי, הילוכים מקריים.",
                    n: 0.126,
                },
            },
        },
        {
            i: 633,
            $: {
                '0': { v: '104223', n: 1 },
                '1': { v: 'מד"ח וטורי פוריה', n: 0.577 },
                '2': {
                    v: 'דרישות קדם: (104013 או 104022 או 104281 או 104043 או 104044 או 104032) ו- (104016) ו- (104131 או 104135 או 104285 או 104035). דיון כללי על משוואות דיפרנציאליות חלקיות (מד"ח) ותנאים מצורפים. התרת משוואות מסדר ראשון. בעיית קושי וקווים אופייניים. מיון מד"ח מסדר שני והבאתם לצורה קנונית. בעיה מוצגת היטב. משוואת הגלים החד- ממדית, שיטת ד\'למבר. בעיית שטרם-ליוביל, מרחבי מכפלה פנימית ומערכות אורתונורמליות. התכנסות טורי פורייה הקלסיים, משפט דיריכלה, משפטי גזירה ואינטגרציה. שיטת הפרדת משתנים, משוואת החום והגלים בקטע סופי. משוואת לפלס ופואסון. עקרון המקסימום ותכונות פונקציות הרמוניות.',
                    n: 0.107,
                },
            },
        },
        {
            i: 634,
            $: {
                '0': { v: '104228', n: 1 },
                '1': { v: "משוואות דיפרנציאליות חלקיות מ'", n: 0.5 },
                '2': {
                    v: 'הערה: דרוש קורס קדם נוסף של תכנות (למשל: 234128 או 234112 או 234127) אפשר גם ללמוד את קורס התכנות במקביל למקצוע זה. דיון כללי על משוואות דיפרנציאליות חלקיות ותנאים מצורפים. התרת משוואות מסדר ראשון, בעיית קושי ועקומים אופייניים. מיון משוואות דיפרנציאליות חלקיות מסדר שני והבאתם לצורה קנונית. בעיה מוצגת היטב. משוואת הגלים החד-ממדית, שיטת ד\'למבר. טורי פורייה טריגונומטריים, שיטת הפרדת המשתנים ובעיית שטורם-ליוביל. משוואת החום והגלים בקטע סופי, משוואות לפלס ופואסון. עקרון המקסימום והמינימום ותכונות פונקציות הרמוניות. התמרת פורייה ושימושים למד"ר ומד"ח.',
                    n: 0.11,
                },
            },
        },
        {
            i: 635,
            $: {
                '0': { v: '104277', n: 1 },
                '1': { v: 'נושאים במתמטיקה לתלמידי ארכיטקט.', n: 0.5 },
                '2': {
                    v: 'גרפים וגרפים מישוריים. דואליות בגרפים מישוריים. נוסחת אוילר ושימושיה. שילושים, פאונים תלת ממדיים. עקרונות של צפידות. משטחים מגנוס גבוה. יסודות של גיאומטריה פרויקטיבית. סימטריה והרמוניה (במישור ובמרחב). ריצופים במשטחים דו-ממדיים.',
                    n: 0.183,
                },
            },
        },
        {
            i: 636,
            $: {
                '0': { v: '104279', n: 1 },
                '1': { v: 'מבוא לחוגים ושדות', n: 0.577 },
                '2': {
                    v: 'חוגים. מחלקי אפס. תחום שלמות. אידיאלים. אידיאלים ראשיים ומקסימליים. חוג מנה. משפטי ההומומורפיזם. חוג פולינומים מעל שדה. פריקות ושורשים של פולינום. תחומים ראשיים. שדות. שדות ראשוניים. הרחבות אלגבריות וסופיות של שדות. שדות סופיים.',
                    n: 0.174,
                },
            },
        },
        {
            i: 637,
            $: {
                '0': { v: '104280', n: 1 },
                '1': { v: 'מודולים, חוגים וחבורות', n: 0.577 },
                '2': {
                    v: "חוגי שברים, חוגים אוקלידיים. מודולים מעל חוגים, תת-מודולים, מודול מנה. משפט המבנה של מודול סופית מעל חוג אוקלידי. צורת ג'ורדן וצורה קנונית רציונלית של מטריצות. פרוק לתת-מרכיבים ציקליים אינווריאנטיים. משפט הבסיס של חבורות אבליות נוצרות סופית. פעולת חבורה על קבוצה. משפטי סילו. סדרות הרכב.",
                    n: 0.151,
                },
            },
        },
        {
            i: 638,
            $: {
                '0': { v: '104281', n: 1 },
                '1': { v: 'חשבון אינפיניטסימלי 2', n: 0.577 },
                '2': {
                    v: 'האינטגרל הלא מסויים: פונקציות קדומות ושיטות אינטגרציה. האינטגרל המסויים של רימן כולל אינטגרל מוכלל: תכונות ושימושים. טורים מספריים אינסופיים-סדרות וטורי פונקציות, כולל התכנסות במדה שווה. פונקציות בכמה משתנים, רציפות, נגזרות חלקיות, גזירות. גזירה תחת סימן האינטגרל, אינטגרל כפול כולל אינטגרל כפול מוכלל, שטח במישור.',
                    n: 0.151,
                },
            },
        },
        {
            i: 639,
            $: {
                '0': { v: '104283', n: 1 },
                '1': { v: 'מבוא לאנליזה נומרית', n: 0.577 },
                '2': {
                    v: 'הקורס מטפל בנושאים הקלסיים של אנליזה נומרית. הנושאים העיקריים שיילמדו במסגרת הקורס הם: אינטרפולציה של פונקציה של משתנה אחד, גזירה נומרית של פונקציה של משתנה אחד ושל כמה משתנים, אינטגרציה נומרית של פונקציה של משתנה אחד, פתרונות איטרטיביים למשוואות אלגבראיות לא ליניאריות.',
                    n: 0.154,
                },
            },
        },
        {
            i: 640,
            $: {
                '0': { v: '104285', n: 1 },
                '1': { v: "משוואות דיפרנציאליות רגילות א'", n: 0.5 },
                '2': {
                    v: 'משוואות סקלריות מהסדר הראשון - שיטות לפתרון סוגים שונים של משוואות. משפטי קיום ויחידות למשוואות ולמערכות. מערכות ליניאריות N-ממדיות ומשוואות ליניאריות מסדר N. מערכות ומשוואות במקדמים קבועים. משפטי ההפרדה וההשוואה של שטורם, פתרון משוואות בעזרת טורים. בעית שטורם ליוביל למשוואות מסדר שני - קיום ערכים עצמיים ומשפט הפתוח בעזרת פונקציות עצמיות.',
                    n: 0.14,
                },
            },
        },
        {
            i: 641,
            $: {
                '0': { v: '104286', n: 1 },
                '1': { v: 'קומבינטוריקה', n: 1 },
                '2': {
                    v: 'מנייה בסיסית: המקדמים הבינומיים והמולטנומיים ושימושיהם. עקרון ההכלה וההדחה. נוסחאות נסיגה ופונקציות יוצרות. מבוא לתורת הגרפים: עצים ויערות, נוסחת CAYLY, גרפים אוילריאנים, זיווגים בגרפים: משפטי HALL ו- KONIG. זיווגים יציבים ומשפט GALE-SHAPLEY. עקרון שובך היונים ומשפט RAMSEY. משפט TURAN. גרפים מישוריים: נוסחת אוילר ומבחר משימושיה.',
                    n: 0.149,
                },
            },
        },
        {
            i: 642,
            $: {
                '0': { v: '104291', n: 1 },
                '1': { v: 'אלגוריתמים קומבינטוריים', n: 0.707 },
                '2': {
                    v: 'אלגוריתמים לבעיות מיון, מזוג ובחירה במודל עץ ההשוואות. עצים פורשים מינימליים והאלגוריתם החמדן. קדוד חסר רעש ואלגוריתם הופמן. אלגוריתמי חפוש בגרפים. תכנון דינמי ומציאת מרחקים מינימליים בגרף ממושקל. זרימה ברשתות: משפט הזרימה המקסימלית והחתך המינימלי ואלגוריתמי זרימה יעילים. שמושים למשפטי זיווג בגרפים. אלגוריתמים אריתמטיים ושימושים להצפנה ציבורית. מבוא לסיבוכיות חישובים: המחלקות P ו- NP. רדוקציה פולינומיאלית, המחלקה NPC ומשפט COOK.',
                    n: 0.129,
                },
            },
        },
        {
            i: 643,
            $: {
                '0': { v: '104293', n: 1 },
                '1': { v: 'תורת הקבוצות', n: 0.707 },
                '2': {
                    v: 'חזרה על פעולות בין קבוצות, סופרמום של קבוצת קבוצות, עוצמות והסדר ביניהן, משפט קנטור ברנשטיין, משפט קנטור על קבוצת החזקה, משפט קניג (הכללת קנטור), חשבון עוצמות, סדר טוב, סודרים, אינדוקציה טרנספיניטית, אקסיומת הבחירה, משפט הסדר הטוב, למת צורן ושימושים.',
                    n: 0.16,
                },
            },
        },
        {
            i: 644,
            $: {
                '0': { v: '104294', n: 1 },
                '1': { v: 'מבוא לאנליזה נומרית', n: 0.577 },
                '2': {
                    v: '1. אלגברה ליניארית נומרית: פירוק ערכים סינגולריים, קירוב ריבועים מינימליים, פירוק QR, בעיות ערכים-עצמיים ואלגוריתם QR. 2. התמרת פורייה דיסקרטית והתמרת פורייה מהירה שיטות ספקטרליות. 3. שיטות למציאת שורשים של משוואות לא ליניאריות 4. קירוב הפרשים סופיים ושיטות אינטגרציה נומרית 5. קירוב ריבועים מינימליים.',
                    n: 0.151,
                },
            },
        },
        {
            i: 645,
            $: {
                '0': { v: '104295', n: 1 },
                '1': { v: 'חשבון אינפיניטסימלי 3', n: 0.577 },
                '2': {
                    v: "המרחב האוקלידי ה- N ממדי. מושגים מטופולוגיה קבוצתית, קומפקטיות, קשירות, וקשירות מסילתית. העתקות בין מרחבים אוקלידיים, רציפות וגזירות. נוסחת טיילור ומיון נקודות קיצון. משפט הפונקציה הסתומה ומשפט ההעתקה ההפוכה. אקסטרמום עם אילוצים וכופלי לגרנז'. יריעות גזירות ברציפות משוכנות. עקומים, אורך עקום, אינטגרלים קוויים. אינטגרל רימן מרובה, נוסחת החלפת המשתנים, אינטגרל מוכלל. שטח פנים ואינטגרל משטחי. אינטגרל השטף. דיברגנץ ורוטור. משפטי גרין, סטוקס וגאוס. שדות משמרים.",
                    n: 0.124,
                },
            },
        },
        {
            i: 646,
            $: {
                '0': { v: '104814', n: 1 },
                '1': { v: "מבוא למדעי המחשב מ'", n: 0.5 },
                '2': {
                    v: 'מבנה המחשב. גישה אלגוריתמית לפתרון בעיות. מושגי יסוד ותכנות בשפת C. פיתוח תכניות מלמעלה למטה. תכנות מבני. כתיבה ובדיקה מלמטה למעלה. ניפוי שגיאות. תכנון הדפסות ביקורת. הוכחת נכונות חלקית ושלמה של תכניות. מדדים ליעילות האלגוריתם: סיבוכיות זמן וזכרון. סיבוכיות פולינומיאלית ואקספוננציאלית. דוגמאות לאלגוריתמים אקראיים. בעיות שלא ניתנות להכרעה. מחסנית. תור. יצוגים של ביטויים אריתמטיים ומימוש חישובם באמצעות מחסנית. רקורסיה ומימושה. חיפוש לעומק. מיון יעיל.',
                    n: 0.125,
                },
            },
        },
        {
            i: 647,
            $: {
                '0': { v: '104823', n: 1 },
                '1': { v: 'מערכות הפעלה', n: 0.707 },
                '2': {
                    v: 'הקורס מציג את הנושאים המרכזיים של מערכות הפעלה מודרניות, ובפרט: תהליכים וחוטים: זימון והחלפת הקשר, תיאום: בעיית הקטע הקריטי, סמפורים ומשתני תנאי, פסיקות, ניהול זיכרון: דפדוף, זיכרון וירטואלי, מערכת הקבצים. במסגרת התרגול, הסטודנטים יכנסו לעומקה של מערכת הפעלה מתקדמת.',
                    n: 0.16,
                },
            },
        },
        {
            i: 648,
            $: {
                '0': { v: '104824', n: 1 },
                '1': { v: 'מבוא לתכנות מערכות', n: 0.577 },
                '2': {
                    v: 'השלמות שפת C : מצביעים, רשומות, ניהול זיכרון דינמי, רשימות מקושרות, עצים. ניהול גרסאות. הידור, קישור, ושימוש בספריות. פקודות SHELL בסיסיות. פייתון כשפת "דבק" של המערכת. ניפוי שגיאות, בדיקת תוכנה, בדיקה אוטומטית. מבוא ל- C : ++ תכנות מונחה עצמים, טיפוסי נתונים מופשטים, פולימורפיזם דינמי וסטטי.',
                    n: 0.147,
                },
            },
        },
        {
            i: 649,
            $: {
                '0': { v: '104918', n: 1 },
                '1': { v: 'מבני נתונים 1', n: 0.577 },
                '2': {
                    v: 'הקורס יקנה ידע במבני נתונים בסיסיים, באנליזה, ביישומים ובשימושים שונים שלהם. יושם דגש על התאמת מבני הנתונים לצרכי הבעיה הנתונה. סוגי מבנים: חזרה על המבנים הפשוטים (מערכים, רשימות, מחסניות ותורים), רשימות דילוגים, תורי עדיפות, ערמות, עצים דיגיטלים. ( TRIES ) מיון וחיפוש. עצים וגרפים וייצוגיהם. הקצאת זכרון, ערבול, איסוף אשפה.',
                    n: 0.141,
                },
            },
        },
        {
            i: 650,
            $: {
                '0': { v: '104952', n: 1 },
                '1': { v: 'מערכות ספרתיות ומבנה המחשב', n: 0.5 },
                '2': {
                    v: 'אלגברה בוליאנית, המודל הספרתי. פונקציות מיתוג. שערים לוגיים ומערכת שלמה. הטרנזיסטור כמתג. מעגלים צירופיים וסדרתיים. המתודולוגיה הסינכרונית. מכונות מצבים. נקודה צפה. קודים לתיקון שגיאות. שפה לתיאור חומרה. מכונת פון נוימן, סט הפקודות, אופני מיעון, קפיצות. מחסנית וקישור שגרות. פסיקות. מעבד מצונר. זמן פעולה מול תפוקה. תלויות בקרה ותלויות מידע.',
                    n: 0.143,
                },
            },
        },
        {
            i: 651,
            $: {
                '0': { v: '106010', n: 1 },
                '1': { v: 'חשיפה למחקר מתמטי', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס היא חשיפת סטודנטים מסמסטר חמישי ומעלה ללימודיהם וסטודנטים בתחילת התואר השני אשר טרם בחרו מנחה, למגוון תחומי המחקר העכשווי בפקולטה. הקורס יהיה בנוי מהרצאות שבועיות של חברי סגל. הרישום לקורס מותנה באישורו של מרכז הקורס. בקורס קיימת חובת נוכחות ומטלה שבועית. תוצאות למידה: בסיום הקורס הסטודנטים יכירו את תחומי המחקר העכשוויים של חברי סגל בפקולטה.',
                    n: 0.132,
                },
            },
        },
        {
            i: 652,
            $: {
                '0': { v: '106061', n: 1 },
                '1': { v: 'יסודות מתמטיים של למידת מכונה', n: 0.447 },
                '2': {
                    v: 'מודל למידת און-ליין: הגדרה, דוגמאות בסיסיות, פרספטרון, ותיאור באמצעות מימד ליטלסטון. מודל למידת PAC: הגדרה, פונקציות הפסד, עקרון ה-ERM, תיאור באמצעות מימד VC ובוסטינג. תכונות מטריות של מחלקות VC. התכנסות במידה אחידה של מחלקת פונקציות. סכימות דחיסה, דוגמאות, ושקילות ללמידת PAC. למידה אוניברסלית.\nבסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להכיר את הרעיונות הבסיסיים בלמידה סטטיסטית.\n2. להבין את חשיבות ההגדרות ולשנותן בהתאם לשימושים._\n3. להכיר את עקרונות אלגוריתמיים מנחים, כגון דחיסה ובוסטינג.__\n4. להכיר את הקשרים בין תורת הלמידה לתחומים אחרים במתמטיקה, כגון מרחבים מטריים ותורת ההסתברות. _',
                    n: 0.109,
                },
            },
        },
        {
            i: 653,
            $: {
                '0': { v: '106156', n: 1 },
                '1': { v: 'לוגיקה מתמטית', n: 0.707 },
                '2': {
                    v: "הלוגיקה כתיאור של דרך החשיבה המתמטית וההוכחה המתמטית. תחשיב הפסוקים: הגדרת הקשרים, האינפטרפרציה שלהם בלוחות אמת. נוסחאות בנויות היטב. מערכת הוכחה. השלמות של המערכת הזאת. תחשיב היחסים: נוסחאות בנויות היטב. מבנים, השמות, מודלים. מערכת הוכחה. שלמות. משפט השלמות של גדל. אלף-0 ואלף-1 קטגוריות. תורת המספרים: מערכת אקסיומות לתורת המספרים (מערכת פאנו או מערכת אחרת). מודלים לא סטנדרטיים לתורת המספרים. משפט אי השלמות של גדל. כריעות, רקורסיביות, התיזה של צ'רץ'.",
                    n: 0.12,
                },
            },
        },
        {
            i: 654,
            $: {
                '0': { v: '106170', n: 1 },
                '1': { v: 'אלגברה הומולוגית', n: 0.707 },
                '2': {
                    v: 'הומולוגיה של קומפלכסים. קוהומולוגיה של חבורות, לחוגים ואלגבראות. מימד הומולוגי של חוגים ואלגבראות.',
                    n: 0.277,
                },
            },
        },
        {
            i: 655,
            $: {
                '0': { v: '106304', n: 1 },
                '1': { v: 'נושאים בקומבינטוריקה- תורת הגרפים', n: 0.5 },
                '2': {
                    v: 'נושאים נבחרים בתורת הגרפים, בעיקר מבין הבאים: גרפים מקריים, גרפים קוואזי-מקריים, גרפים מרחיבים (אקספנדרים), שאלות אקסטרימליות בגרפים, אלגברות דגלים, למת הרגולריות, גבולות של גרפים._ תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יכירו את החסמים והבניות העיקריים בנושא בעיית טורן, ידע להשתמש בלמת הרגולריות, להראות שקילות בין הגדרות שונות של גרפים קוואזי מקריים, ואת התכונות הבסיסיות של גרפים מרחיבים.',
                    n: 0.132,
                },
            },
        },
        {
            i: 656,
            $: {
                '0': { v: '106380', n: 1 },
                '1': { v: 'אלגברה מודרנית 1', n: 0.577 },
                '2': {
                    v: "חוגים קומוטטיביים: אידיאלים, נילרדיקל ורדיקל ג'ייקובסון, מודולים, סדרות מדויקות, מכפלות טנסוריות, אלגבראות. חוגי שברים ומודולי שברים. פירוק פרימרי. הרחבות שלמות של חוגים, הערכות. תנאי שרשרת. חוגי נתר, חוגי ארטין. חוגי הערכה דיסקרטיים ותחומי דדקינד. השלמות של חוגים. תורת המימד.",
                    n: 0.16,
                },
            },
        },
        {
            i: 657,
            $: {
                '0': { v: '106383', n: 1 },
                '1': { v: 'טופולוגיה אלגברית', n: 0.707 },
                '2': {
                    v: "סימפלכסים וקומפלקסים סימפליציאליים. קרוב סימפליציאלי. הומוטופיה. חבורות הומולוגיה וקוהומולוגיה סימפליציאליות. שימושים: משפטי בראור, ליפשיץ, הופף ואחרים. חבורות הומולוגיה וקוהומולוגיה של צ'ך, הומולוגיה וקוהומולוגיה סינגולריות.",
                    n: 0.204,
                },
            },
        },
        {
            i: 658,
            $: {
                '0': { v: '106393', n: 1 },
                '1': { v: 'תורת המטריצות', n: 0.707 },
                '2': {
                    v: 'מרחבים ואופרטורים ליניאריים. מטריצות. דטרמיננטים ופרמננטים משפטי פיתוח. מטריצה מצורפת, מושרית ומכפלת קרונקר. מרחבים אוניטריים. הפולינום האופייני וערכים עצמיים. אלומות של תבניות ריבועיות ואפיון ערכים עצמיים, בעזרת בעיות אקסטרמום. שדה ערכים. תחומי הכלה עבור ערכים עצמיים, משפטי גרשגורן. נורמות של וקטורים ומטריצות. מטריצות אי-שליליות, משפט פרון- פרוביניוס. מטריצות סטוכסטיות כפולות, משפט קינג-פרוביניוס ומשפט בירקהוף. הוכחת השערת ון-דר-ורדן לפרמננטים.',
                    n: 0.131,
                },
            },
        },
        {
            i: 659,
            $: {
                '0': { v: '106397', n: 1 },
                '1': { v: 'תורת המספרים', n: 0.707 },
                '2': {
                    v: 'פונקציות אריתמטיות. קונגרואנציות, שרשים פרימיטיביים, הדדיות ריבועית. הפונקציה של רימן, פונקציות L של דיריכלה, מספרים ראשוניים בסדרה חשבונית. משוואות דיופנטיות. תורת גאוס של תבניות ריבועיות בינריות.',
                    n: 0.196,
                },
            },
        },
        {
            i: 660,
            $: {
                '0': { v: '106433', n: 1 },
                '1': { v: 'נושאים באנליזה פונקציונלית', n: 0.577 },
                '2': {
                    v: 'פרקים נבחרים באנליזה פונקציונלית ובשימושיה.\nסמסטר ב\' תשע"ז: אלגבראות וון נוימן.\nסמסטר ב\' תשע"ח: אנלזה גיאומטרית קמורה במימד גבוה.\nסמסטר ב\' תשע"ט: אנליזה פונקציונלית.',
                    n: 0.218,
                },
            },
        },
        {
            i: 661,
            $: {
                '0': { v: '106860', n: 1 },
                '1': { v: "תורת הקומפילציה ס'", n: 0.577 },
                '2': {
                    v: 'שפות ודקדוק. מבנה מהדר. שיטות פריסה בסיסיות. תרגום מכוון ע"י תחביר. טבלות סמלים. ארגון בזמן ריצה, יצירת קוד. אופטימיזציה מקומית וגלובלית. תוצרי למידה: הסטודנט יהיה מסוגל: 1. להכיר מושגים בסיסיים עיקריים בהקשר של שפות תכנות עיליות ודקדוקים: פריסת TOP-DOWN/BOTTOM-UP, דקדוקי קדימויות, שפות מובנות בלוקים, סמנטיקה וכו\'. 2. להכיר כלים עיקריים ושיטות בתהליך הקומפילציה: טבלות סמלים, ניהול טפסים, ארגון זכרון, אופטימיזציות ועוד. 3. לדעת לבנות קומפיילר עבור שפה בסיסית נתונה/חדשה ויוכל לממש זאת בקורס המשך (מעבדה/פרויקט) ו/או בחברת תוכנה רלוונטית.',
                    n: 0.113,
                },
            },
        },
        {
            i: 662,
            $: {
                '0': { v: '106927', n: 1 },
                '1': { v: 'נושאים נבחרים בתורת המספרים 2', n: 0.447 },
                '2': {
                    v: 'נושאים מתקדמים בתורת המספרים אשר יקבעו מחדש בכל פעם שהקורס יוצע.',
                    n: 0.302,
                },
            },
        },
        {
            i: 663,
            $: {
                '0': { v: '106930', n: 1 },
                '1': { v: 'נושאים נבחרים באלגבראות 1', n: 0.5 },
                '2': {
                    v: 'נושאים נבחרים אשר יקבעו בכל פעם שהקורס יוצע.',
                    n: 0.354,
                },
            },
        },
        {
            i: 664,
            $: {
                '0': { v: '106933', n: 1 },
                '1': { v: 'נושאים נבחרים בטופולוגיה 2', n: 0.5 },
                '2': {
                    v: 'נושאים מתקדמים בטופולוגיה אשר יקבעו מחדש בכל פעם שהקורס יוצע. סמסטר א\' תשע"ז: קוהומולוגיה חסומה מנקודת מבטן של אלגברה, תורת המידה, טופולוגיה, גיאומטריה ואנליזה פונקציונלית.',
                    n: 0.2,
                },
            },
        },
        {
            i: 665,
            $: {
                '0': { v: '106935', n: 1 },
                '1': { v: 'נושאים נבחרים בהסתברות', n: 0.577 },
                '2': {
                    v: 'נושאים מתקדמים בהסתברות אשר יקבעו מחדש בכל פעם שהקורס יוצע. סמסטר א\' תשע"ז: גבולות מנורמלים, משפטי גבול מרכזי וחריגות גדולות.',
                    n: 0.224,
                },
            },
        },
        {
            i: 666,
            $: {
                '0': { v: '106936', n: 1 },
                '1': { v: 'נושאים נבחרים באנליזה מתמטית 3', n: 0.447 },
                '2': {
                    v: 'נושאים נבחרים באנליזה מתמטית אשר יקבעו מחדש בכל פעם שהקורס יוצע. סמסטר ב\' תשע"ז: גיאומטריה ספקטרלית דרך הלפלסיאן.',
                    n: 0.236,
                },
            },
        },
        {
            i: 667,
            $: {
                '0': { v: '106937', n: 1 },
                '1': { v: 'נושאים נבחרים באנליזה מתמטית 4', n: 0.447 },
                '2': {
                    v: 'נושאים נבחרים באנליזה מתמטית אשר יקבעו בכל פעם שהקורס יוצע. סמסטר א\' תשע"ז: צורות נורמליות בגיאומטריה דיפרנציאלית מקומית ותורת בקרה גיאומטרית. סמסטר ב\' תשע"ח: חברבורות סמסטר א\' תשע"ט: הנפח של גופים קמורים.',
                    n: 0.177,
                },
            },
        },
        {
            i: 668,
            $: {
                '0': { v: '106938', n: 1 },
                '1': { v: 'נ.נ. בטופולוגיה - תורת החבורות', n: 0.447 },
                '2': {
                    v: 'הקדמה כללית: קווזי-איזומטריות בין מחרבים מטרים ובין וחבורות. קצוות של חבורות כאינווריאנט קווזי-איזומטרי. חבורות היפרבוליות: הגדרות שונות ודוגמאות, אינווריאנטיות על ידי קווזי-איזומטריה, קווזי-גיאדטים, שפות של חבורות היפרבוליות ופעילות של חבורת היפרבוליות על שפתם. מרחבי CAT(0): הגדרות ודוגמאות, משפט קרטן-הדמרד, שפות של מרחבי CAT(0).',
                    n: 0.152,
                },
            },
        },
        {
            i: 669,
            $: {
                '0': { v: '106941', n: 1 },
                '1': { v: 'סמינר באנליזה', n: 0.707 },
                '2': {
                    v: 'נושאים באנליזה אשר יקבעו מחדש בכל פעם שהקורס יוצע. סמסטר א\' תשע"ז: שימושים של אנליזה הרמונית בתורה ארגודית. סמסטר ב\' תשע"ט: THE WINDING NUMBER.',
                    n: 0.204,
                },
            },
        },
        {
            i: 670,
            $: {
                '0': { v: '106942', n: 1 },
                '1': { v: 'אנליזה פונקציונלית', n: 0.707 },
                '2': {
                    v: 'מרחבי בנך, המרחב הצמוד, משפט BAIRE ומשפט ההעתקה הפתוחה, משפט אוורבך הלמה של ריס, משפט האן-בנך, רפלכסיביות, התכנסות חלשה, משפט הגרף הסגור. אפיון , ( K )C, משפט אלאוגלו, קריין-מילמן. מטריזביליות של טורולוגיות חלשות, אלגבראות בנך, ספקטרום, אידיאלים, חשבון הולומורפי, אלגברה (X)C אלגבראות בנך אבליות, העתקת גלפנד.',
                    n: 0.146,
                },
            },
        },
        {
            i: 671,
            $: {
                '0': { v: '114020', n: 1 },
                '1': { v: "מעבדה לפיסיקה 1מ'", n: 0.577 },
                '2': {
                    v: 'נסויים בשטח של מכניקה קלסית-תנועה בקו ישר, תנועה סבובית ומחזורית, חוקי שימור, תהודה, תנודות מרוסנות ומאולצות.',
                    n: 0.25,
                },
            },
        },
        {
            i: 672,
            $: {
                '0': { v: '114021', n: 1 },
                '1': { v: 'מעבדה לפיסיקה  2מ', n: 0.577 },
                '2': {
                    v: 'נסויים בשטח של בליסטיקה של אלקטרונים בשדות אלקטרומגנטיים, מעגלים חשמליים בזרם חלופין (תנודות מרוסנות, זמן ריסון, תהודה, איפנון, התנהגות לא-ליניארית).',
                    n: 0.224,
                },
            },
        },
        {
            i: 673,
            $: {
                '0': { v: '114030', n: 1 },
                '1': { v: "מעבדה לפיסיקה 2 מח'", n: 0.5 },
                '2': {
                    v: "נסויים בשטח הבליסטיקה של אלקטרונים בשדות אלקטרומגנטיים. מעגלים חשמליים בזרם חלופין (תנודות מרוסנות, זמן תהודה, אפנון והתנהגות לא לינארית). הקף המעבדה 2/3 מהחומר הנדרש במעבדה לפיסיקה 2מ'.",
                    n: 0.192,
                },
            },
        },
        {
            i: 674,
            $: {
                '0': { v: '114032', n: 1 },
                '1': { v: "מעבדה לפיסיקה 1ח'", n: 0.577 },
                '2': {
                    v: 'הערכת דיוק מדידה וחישוב שגיאות, תנועה קווית, תנועה מחזורית, כח ואנרגיה פוטנציאלית, תנע זויתי ומומנטי התמד.',
                    n: 0.25,
                },
            },
        },
        {
            i: 675,
            $: {
                '0': { v: '114034', n: 1 },
                '1': { v: "מעבדה לפיסיקה 2מפ'", n: 0.577 },
                '2': {
                    v: "הערה: מיועד לסטודנטים מפיזיקה בלבד. ניסויים עם שפופרת קרן קתודה בתנועת אלקטרונים בשדות אלקטרומגנטיים, עקרון עבודה של אוסצילוסקופ. מעגלים חשמליים פשוטים בזרם ישר ובזרם חלופין, מתח צף, שנאי, מסנני תדירות, צורות ליסז'ו, עכבה חשמלית, תנודות חשמליות מרוסנות, תהודה במערכת חשמלית. פרויקט.",
                    n: 0.156,
                },
            },
        },
        {
            i: 676,
            $: {
                '0': { v: '114035', n: 1 },
                '1': { v: 'מעבדה לפיסיקה 3 - גלים', n: 0.447 },
                '2': {
                    v: 'ניסויים בגלים (גלי קול, אור ומיקרו), שימוש בתופעות התאבכות, עקיפה, וקיטוב למדידות ערכים פיזיקאליים שונים. אינטרפרומטר מייכלסון, מאך-זנדר, ניסוי שני סדקים, גל-בו, ספקטרוסקופיה אטומית, פיזור בראג.',
                    n: 0.196,
                },
            },
        },
        {
            i: 677,
            $: {
                '0': { v: '114037', n: 1 },
                '1': { v: "מעבדה לפיסיקה 4מח'", n: 0.577 },
                '2': {
                    v: 'ניסויים בפיסיקה מודרנית, (אפקט פוטו-אלקטרי, ניסוי פרנק-הרץ, תהודה מגנטית גרעינית, תהודה ספין אלקטרוני), ניסויים בפיסיקה של מצב מוצק (הולכה, אפקט הול, פוטו-וולטאי), ניסויים בפיסיקה גרעינית.',
                    n: 0.2,
                },
            },
        },
        {
            i: 678,
            $: {
                '0': { v: '114038', n: 1 },
                '1': { v: "מעבדה לפיזיקה - גלים - 3מפ'", n: 0.408 },
                '2': {
                    v: "ניסויים בגלים (גלי קול, אור ומיקרו), שימוש בתופעות התאבכות, עקיפה, וקיטוב למדידות ערכים פיזיקאליים שונים. אינטרפרומטר מייכלסון, פיז'ו, גזיזה, ניסוי שני סדקים, גל-בו, ספקטרוסקופיה אטומית, אפקט אקוסטי-אופטי. פרויקט.",
                    n: 0.189,
                },
            },
        },
        {
            i: 679,
            $: {
                '0': { v: '114051', n: 1 },
                '1': { v: 'פיסיקה 1', n: 0.707 },
                '2': {
                    v: "*** מקצועות קדם: בחינת סווג בפיסיקה חלק א' - מכניקה או פטור ממנה.*** המקצוע מכיל נושאים במכניקה קלסית. א. מכניקה ניוטונית: הבחנה בין כוחות פנימיים וחצוניים, שימור אנרגיה. תנע ותנע זויתי (למערכת חלקיקים ללא כוחות חיצוניים). דוגמאות של משואות תנועה, טרנספורמצית גלילאי, מערכות מואצות. ב. תורת היחסות הפרטית: מדידת מהירות האור ותכונותיה, עקרון היחסות, טרנספורמצית לורנץ, זמן עצמי, תופעת דופלר יחסותית, אנרגיה ותנע יחסותיים, פיזור, יצירה והתפרקות של חלקיקים.",
                    n: 0.12,
                },
            },
        },
        {
            i: 680,
            $: {
                '0': { v: '114052', n: 1 },
                '1': { v: 'פיסיקה 2', n: 0.707 },
                '2': {
                    v: "***מקצועות קדם: בחינת סווג בפיסיקה חלק ב' - חשמל או פטור ממנה.*** חשמל ומגנטיות: אלקטרוסטטיקה, שדה חשמלי, חוק גאוס, פוטנציאל, קבלים וחומרים דיאלקטריים. חוק אום, מעגלי CR, שדה מגנטי, חוק אמפר, חוק פרדי, השראות, תכונות מגנטיות של חומר, משוואות מקסוול. גלים: גלים מכניים, שרשרת אוסצילטורים, גלי רוחב במיתר, גלים אקוסטיים בנוזל או בגז, תנאי שפה, גלים עומדים: ספקטרום תדרים. גלים מתקדמים: מהירות פאזה ומהירות חבורה, שבירה והחזרה, החזרה מלאה. עקרון הויגנס: עקיפה והתאבכות, פיזור בראג. גלים אלקטרומגנטיים בריק, קיטוב.",
                    n: 0.113,
                },
            },
        },
        {
            i: 681,
            $: {
                '0': { v: '114054', n: 1 },
                '1': { v: 'פיסיקה 3', n: 0.707 },
                '2': {
                    v: 'רקע ויסודות המכניקה הקונטית - תכונות חלקיקיות של אור, תכונות גליות של חומר, קונטיזציה של קרינה ואנרגיה. מודל האטום של בוהר, גילוי הגרעין ע"י רתרפורד, פונקצית גל ומשואות שרדינגר - הגישה ההסתברותית, פתרון משואת שרדינגר לחלקיק חופשי ובנוכחות פוטנציאלים שונים. תאור קונטי של אטום המימן, אטומים רבי אלקטרונים והטבלה המחזורית. מצב מוצק - מבנה המוצק, מודל אלקטרונים חפשיים, מבנה פסים, מוליכים, מבדדים, ומוליכים למחצה. גרעין - מבנה הגרעין, כוחות גרעיניים ואנרגית קשר, רדיואקטיביות, ראקציות גרעיניות, ביקוע, מיזוג ואנרגיה גרעינית. חלקיקים יסודיים - חלקיקים ואנטי חלקיקים, חוקי שימור, מיון חלקיקים, הכוחות הבסיסיים בטבע. אסטרופיסיקה וקוסמולוגיה - התפתחות כוכבים ובריאת היקום.',
                    n: 0.101,
                },
            },
        },
        {
            i: 682,
            $: {
                '0': { v: '114071', n: 1 },
                '1': { v: 'פיסיקה 1מ', n: 0.707 },
                '2': {
                    v: "***מקצועות קדם: בחינת סווג בפיסיקה חלק א' - מכניקה או פטור ממנה.*** מכניקה קלסית- חוקי ניוטון. דינמיקה של חלקיק. טרנספורמצית גליליי. תאור תנועה במערכות לא-אינרציאליות. חוקי השימור של האנרגיה, התנע הקוי והתנע הזויתי. מערכות רבות חלקיקים. דינמיקה של גוף צפיד. אוסצילטור הרמוני. גרביטציה. מכניקה יחסותית - טרנספורמציות לורנץ לוקטורים של מקום-זמן ותנע-אנרגיה טרנספורמציה של וקטור המהירות. דינמיקה יחסותית. חלקיקים עם מסת מנוחה השווה לאפס.",
                    n: 0.125,
                },
            },
        },
        {
            i: 683,
            $: {
                '0': { v: '114073', n: 1 },
                '1': { v: "פיסיקה 3ח'", n: 0.707 },
                '2': {
                    v: 'דואליות גל-חלקיק: אפקט פוטואלקטרי, קרינת X, פיזור בראג, גלי דה-ברולי, עיקרון אי-הוודאות של הייזנברג. מבנה האטום: פיזור רתרפורד, ספקטרום אטומי, מודל האטום לפי בוהר. יסודות תורת הקוונטים: משוואת שרדינגר, בור פוטנציאל חד-מימדי, אוסצילטור הרמוני, בעיות פיזור, מינהור, חלקיק בתיבה, ניוון, הנחות יסוד של תורת הקוונטים, אופרטורים, יחסי חילוף, סימון דיראק, תורת ההפרעות. פיזיקה אטומית: אטום המימן לפי שרדינגר, ספין ונסוי שטרן-גרלך, אפקט זימן, עקרון האיסור של פאולי, אטומים מרובי אלקטרונים והטבלה המחזורית.',
                    n: 0.118,
                },
            },
        },
        {
            i: 684,
            $: {
                '0': { v: '114074', n: 1 },
                '1': { v: "פיסיקה 1פ'", n: 0.707 },
                '2': {
                    v: "מקצוע קדם: בחינת סיווג בפיסיקה חלק א' - מכניקה או פטור ממנה. חוקי ניוטון, טרנספורמציית גליליי. מערכות לא אינרציאליות. שימור אנרגיה, תנע קווי וזוויתי. מערכות רבות חלקיקים. דינמיקה של גוף צפיד. תנועה הרמונית מאולצת ומרוסנת. גרביטציה ותנועה קפלרית. פרצסיה. מכניקה יחסותית-טרנספומציות לורנץ לוקטורים של מקום-זמן ותנע-אנרגיה. טרנספורמציה של וקטור המהירות. דינמיקה יחסותית. פוטונים.",
                    n: 0.137,
                },
            },
        },
        {
            i: 685,
            $: {
                '0': { v: '114075', n: 1 },
                '1': { v: 'פיסיקה 2ממ', n: 0.707 },
                '2': {
                    v: "*** מקצועות קדם: בחינת סווג בפיסיקה חלק ב' - חשמל או פטור ממנה. מקצועות צמודים:(104013 ו- 104035) או 104032. אלקטרוסטטיקה, שדה ופוטנציאל חשמליים, הזרם החשמלי, השדות המלווים מטען נע, שדה מגנטי, השראות, משוואות מקסוול ופתרונם, מעגלי זרם חילופין. מבוא לגלים, נפיצה, שבירה, מהירות פזה וחבורה, תנע ואנרגיה של גל אלקטרומגנטי, קיטוב, התאבכות ועקיפה.",
                    n: 0.137,
                },
            },
        },
        {
            i: 686,
            $: {
                '0': { v: '114077', n: 1 },
                '1': { v: 'פיסיקה 1ל', n: 0.707 },
                '2': {
                    v: 'המקצוע מכיל נושאים במכניקה קלסית. א. מכניקה ניוטונית: הבחנה בין כוחות פנימיים וחיצוניים. שימור אנרגיה. תנע ותנע זויתי (למערכת חלקיקים ללא כוחות חיצוניים). דוגמאות של משואות תנועה, טרנספורמצית גלילאו, מערכות מואצות. ב. תורת היחסות הפרטית: מדידת מהירות האור ותכונותיה, עקרון היחסות, טרנספורמצית לורנץ, זמן עצמי. תופעת דופלר יחסותית. אנרגיה ותנע יחסותיים. יצירה והתפרקות של חלקיקים.',
                    n: 0.135,
                },
            },
        },
        {
            i: 687,
            $: {
                '0': { v: '114078', n: 1 },
                '1': { v: 'פיסיקה 2ל', n: 0.707 },
                '2': {
                    v: 'אלקטרוסטטיקה, שדה חשמלי, חוק גאוס, פוטנציאל, קבלים וחומרים דיאלקטריים, חוקי אום וקירכהוף, מעגלי CR, שדה מגנטי, חוקי אמפר ופרדיי, השראות, תכונות מגנטיות של חומר, משוואות מכסוול. אופטיקה גאומטרית. גלי רוחב במיתר, גלים אקוסטיים. גלים עומדים. גלים מתקדמים: מהירות פאזה וחבורה, שבירה והחזרה, עקיפה והתאבכות, פיזור בראג. גלים אלקטרומגנטיים בריק ובחומר. קיטוב ואנרגיה של גלים.',
                    n: 0.136,
                },
            },
        },
        {
            i: 688,
            $: {
                '0': { v: '114081', n: 1 },
                '1': { v: 'מעבדה לפיסיקה 1', n: 0.577 },
                '2': {
                    v: 'הערכת דיוק מדידה וחישוב שגיאות, תנועה קוית, תנועה מחזורית, כוח ואנרגיה פוטנציאלית, תנע זויתי ומומנטי התמד, תהודה מכנית, פעימות.',
                    n: 0.229,
                },
            },
        },
        {
            i: 689,
            $: {
                '0': { v: '114082', n: 1 },
                '1': { v: 'מעבדה לפיסיקה 2', n: 0.577 },
                '2': {
                    v: 'ניסויים בחשמל, בגלים (אור וקול) ובפיסיקה מודרנית.',
                    n: 0.378,
                },
            },
        },
        {
            i: 690,
            $: {
                '0': { v: '114086', n: 1 },
                '1': { v: 'גלים', n: 1 },
                '2': {
                    v: 'אוסילטור הרמוני, אוסילטורים מצומדיים, מודים עצמיים, מערכות רציפות, סופרפוזיציה, גלים נוסעים ועומדים, יחס נפיצה, חבילת גלים, מהירות פאזה וחבורה, העברה והחזרה, פעימות ומודולציה, גלים ב-2 ו-3 מימדים, גלים אלקטרומגנטיים, קיטוב, התאבכות, עקרון הויגנס, סריג דיפרקציה, קרינה, אינדקס שבירה, חוק סנל, מבוא למכניקת קוונטים.',
                    n: 0.152,
                },
            },
        },
        {
            i: 691,
            $: {
                '0': { v: '114101', n: 1 },
                '1': { v: 'מכניקה אנליטית', n: 0.707 },
                '2': {
                    v: "סקירת המכניקה הניוטונית, עקרונות וריאציה ומשוואת לגרנג', חוקי שימור, כוח מרכזי והתנועה של שני חלקיקים, פיזור, תנועת גוף קשיח, סיבובים, זויות אוילר, טנסור ההתמדה, תנועת הסביבון, תנודות קטנות, מציאת אופני התנודה כבעיה של ערכים עצמיים, הפורמליזם הקנוני, ההמילטוניאן, טרנספורמציות קנוניות, סוגרי פואסון, משפט ליוביל. משואת המילטון יעקובי.",
                    n: 0.146,
                },
            },
        },
        {
            i: 692,
            $: {
                '0': { v: '114229', n: 1 },
                '1': { v: 'פרויקט', n: 1 },
                '2': {
                    v: 'הערה: לאחר הרישום יש לתאם עם המורה האחראי למקצוע. המטרה: לאפשר לסטודנט להשתתף במחקר באחד משטחי המחקר הפעילים בפקולטה. לשם לימוד הקורס על הסטודנט לצבור 90 נקודות.',
                    n: 0.192,
                },
            },
        },
        {
            i: 693,
            $: {
                '0': { v: '114248', n: 1 },
                '1': { v: 'פיסיקה 1 ר', n: 0.577 },
                '2': {
                    v: "מיועד לתלמידי רפואה בלבד. מקצועות קדם: בחינת סווג בפיסיקה חלק א'-מכניקה או פטור ממנה. וקטורים, חוקי התנועה של ניוטון, עבודה ואנרגיה, תנועה סיבובית, מומנט כח, תנועה הרמונית פשוטה, הידרוסטטיקה והידרודינמיקה.",
                    n: 0.183,
                },
            },
        },
        {
            i: 694,
            $: {
                '0': { v: '114250', n: 1 },
                '1': { v: 'מעבדה לפיסיקה 5ת', n: 0.577 },
                '2': {
                    v: '** השתתפות בהרצאת בטיחות בלייזר - תנאי הכרחי להשתתפות במעבדה.** ביצוע 2 ניסויים מתוך השטחים של פיסיקה גרעינית, אופטיקה ומצב מוצק.',
                    n: 0.218,
                },
            },
        },
        {
            i: 695,
            $: {
                '0': { v: '114251', n: 1 },
                '1': { v: 'מעבדה לפיסיקה 6ת', n: 0.577 },
                '2': {
                    v: '** השתתפות בהרצאת בטיחות בלייזר - תנאי הכרחי להשתתפות במעבדה.** ביצוע 2 נסויים מתוך השטחים של פיסיקה גרעינית, אופטיקה ומצב מוצק שלא בוצעו במסגרת מעבדה לפיסיקה 5ת.',
                    n: 0.192,
                },
            },
        },
        {
            i: 696,
            $: {
                '0': { v: '114252', n: 1 },
                '1': { v: 'פרויקט ת', n: 0.707 },
                '2': {
                    v: 'הערה: לאחר הרישום יש לתאם עם המורה האחראי למקצוע. המטרה: לאפשר לסטודנטים להשתתף במחקר באחד משטחי המחקר הפעילים בפקולטה.\nלשם לימוד הקורס על הסטודנט לצבור 90 נקודות.',
                    n: 0.196,
                },
            },
        },
        {
            i: 697,
            $: {
                '0': { v: '115204', n: 1 },
                '1': { v: 'פיסיקה קוונטית 2', n: 0.577 },
                '2': {
                    v: 'ההצגות של הייזנברג ושרדינגר. קשר לדינמיקה קלאסית. תנע זוויתי (צימוד ספין מסילה, המבנה הדק והעל דק, אפקט זימן). המערכה המחזורית (כללי הונד, אכלוס רמות), קשר כימי ומולקולת המימן, אטום ההליום. חלקיקים בשדה מגנטי (רמות לנדאו, אפקט אהרונוב-בוהם). תורת פיזור (כולל גלים חלקיים וקירוב בורן). תורת ההפרעות התלויה בזמן (כולל כלל הזהב של פרמי, בליעה ומעברים קוונטיים). קירוב סמי-קלאסי וכללי בוהר-זומרפלד. יסודות מכניקת הקוונטים (תורת המדידה, BELL , EPR ).',
                    n: 0.12,
                },
            },
        },
        {
            i: 698,
            $: {
                '0': { v: '116029', n: 1 },
                '1': { v: 'מבוא לביופיסיקה', n: 0.707 },
                '2': {
                    v: 'הפיסיקה העומדת בבסיס תאים ביולוגיים, כוחות הבין-מולקולריים והביופיסיקה של אבני הבנין: חלבונים וקרומים. תופעות מעבר במערכות ביולוגיות, קינטיקה של אנזימים ויצירת תבניות מסודרות מאי הסדר המולקולרי. תהליכים חשמליים: מתעלות יונים לתאי עצב ורשתות עצביות.',
                    n: 0.171,
                },
            },
        },
        {
            i: 699,
            $: {
                '0': { v: '116040', n: 1 },
                '1': { v: 'אינפורמציה קוונטית מתקדמת', n: 0.577 },
                '2': {
                    v: 'ערוץ תקשורת קוונטי, דואליות בין ערוץ למצבים, העתקות חיוביות בהחלט, תיקון שגיאות (KNILL-LAFLAMME,STABILIZER,), אנטרופיה ותכונותיה, מצבי מצרר, וחישוב חד סטרי במצבי מצרר, המשפט האדיאבטי, חישוב אדיאבטי, מערכות פתוחות , קראוס, משואת לינדבלט, תיקוני שגיאות טופולוגים, TORIC CODE , הוכחות אבטחה, רשתות טנסוריות, מצבים טופולוגיים, מחלקות סיבוכיות קוונטיות QMA BQP תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לקרוא באופן ביקורתי ספרות עדכנית בנושא. 2. לבנות אלגוריתמים פשוטים לתיקון שגיאות במערכות קוונטיות. 3. להשתמש בארגז הכלים הסטנדרטי של תורת האינפורמציה הקוונטית.',
                    n: 0.112,
                },
            },
        },
        {
            i: 700,
            $: {
                '0': { v: '116041', n: 1 },
                '1': { v: 'פיז. של לייזרים ואופטיקה קוונטית', n: 0.447 },
                '2': {
                    v: 'קוהרנטיות, קרינה וחומר מגביר במשוואות מקסוול, אלומות אור גאוסיות, תנע זויתי אורביטלי של אלומות אור, מהוד פברי-פרוט, מהודים אופטיים, תיאור קוונטי של אינטראקציה של קרינה וחומר, משוואות קצב של תווך אטומי, רווית הגבר, הלייזר, לזירה רב-אופנית, פולסי לייזר קצרים ונעילת אופני לזירה. תוצאות למידה\nבסיום הקורס הסטודנט יהיה מסוגל: 1. לקרוא באופן ביקורתי ספרות עדכנית בנושא.\n2. לתכנן ניסויים פשוטים במערכות של לייזרים.\n3. לחשב תכונות פיזיקליות של לייזרים והקרינה הנפלטת מהם.',
                    n: 0.12,
                },
            },
        },
        {
            i: 701,
            $: {
                '0': { v: '116083', n: 1 },
                '1': { v: 'טכנולוגיות קוונטיות', n: 0.707 },
                '2': {
                    v: 'מבוא לאינפורמציה קוונטית ואינטראקציה של אור וחומר. שימושים של תורת הקוונטים במחשוב, סימולציות, תקשורת והצפנה, ומדידות מדויקות. מימושים פיסיקליים מובילים: מעגלי מוליכות-על, יונים ואטומים קרים, מרכזי צבע, נקודות ובורות קוונטים, פוטונים ומערכות מכאניות. בסיום הקורס הסטודנט יהיה מסוגל: 1. לקרוא באופן ביקורתי ספרות עדכנית בנושא. 2. לתכנן ניסויים פשוטים בקיוביטים קוונטיים אופטיים, של על מוליכים, של יונים ואטומים. 3. לחשב תכונות פיזיקליות בסיסיות של קיוביטים פיזיקליים מסוגים שונים.',
                    n: 0.121,
                },
            },
        },
        {
            i: 702,
            $: {
                '0': { v: '116094', n: 1 },
                '1': { v: 'פיזיקה חישובית', n: 0.707 },
                '2': {
                    v: '2. שימושים בפיסיקה. מערכות דינמיות לא לינאריות. זרימה מערבלית. 1. חזרה על יסודות האנליזה הנומרית. תכנות מדעי. מודלים במכניקה סטטיסטית. מערכות קשיחות. בעיות רב מימדיות. 3. הקדמה לפתרון בעיות על מחשבים וקטוריים ומקביליים.',
                    n: 0.174,
                },
            },
        },
        {
            i: 703,
            $: {
                '0': { v: '116217', n: 1 },
                '1': { v: 'פיסיקה של מצב מוצק', n: 0.5 },
                '2': {
                    v: 'נושאים: שריגים וגבישים, שריג הופכי, עקיפת קרני -X, פונונים,משפט בלוך, קרוב אלקטרונים כמעט חופשיים וקרוב אלקטרונים קשורים, דינמיקה של אלקטרונים, חום סגולי, מתכות, מוליכים למחצה, מגנטיות.',
                    n: 0.196,
                },
            },
        },
        {
            i: 704,
            $: {
                '0': { v: '116354', n: 1 },
                '1': { v: 'אסטרופיסיקה וקוסמולוגיה', n: 0.707 },
                '2': {
                    v: 'מערכת השמש וכוכבי לכת מחוץ למערכת השמש. המשוואות הבסיסיות של מבנה כוכבים. התפתחות כוכבים ויצירת ננסים לבנים, כוכבי ניוטרונים וחורים שחורים. יצירת כוכבים מעננים מולקולאריים. שביל החלב וגלקסיות אחרות. מרכזי גלקסיות פעילים וחורים שחורים מסיביים. צבירי גלקסיות, מסה אפלה ומבנה היקום בסקלה גדולה. תיאורית המפץ הגדול וחידת האנרגיה האפלה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 705,
            $: {
                '0': { v: '117006', n: 1 },
                '1': { v: 'פיסיקה מזוסקופית קוונטית', n: 0.577 },
                '2': {
                    v: 'דיפוזיה קוונטית - דיפוסית קופרון.\nהולכה קוונטית: גישת קובו - לאנדאור - כוהן - תאולס.\nתופעות בסיסיות: שרווין-שרווין, אהרונוב בוהם, פיזור אחורי קוהרנטי.\nלוקליזציה חלשה: פלאקטואציות אוניברסלית בהולכה, התנגדות מגנטית.\nלוקליזצית אנדרסון - אינטראקציות וחוסר סדר: זמן חיים של קוואזי חלקיק, הולכת מינהור אנומליה של צפיפות המצבים. תרמודינמיקה: זירמי התמד במתכות רגילות.',
                    n: 0.144,
                },
            },
        },
        {
            i: 706,
            $: {
                '0': { v: '118076', n: 1 },
                '1': { v: 'מעבדה מתקדמת', n: 0.707 },
                '2': {
                    v: 'מעבדה זו חופפת מעבדה פיסיקלית 7. ביצוע של שני ניסויים, תוך הרחבה ופיתוח מתוך הרשימה המצורפת, בתנאי שהניסוי לא בוצע במסגרת מעבדה פיסיקלית 6: אפקט מוסבאור. זמן מחצית חיים של רמה גרעינית מעוררת. קורלציות זויתיות בקרינה גרעינית. מדידת פרמטרים של לייזר 2CO. ניסויים בהולוגרפיה ואופטיקה מתקדמת. אקטיבציה בנויטרונים. תכונות של גבישי KDP. הכרת המאיץ. עקיפת קרני רנטגן. תכונות גאזים ( PVT ) ספקטרומטר פורייה. נקודה קריטית בנוזלים. הליום 4. ספקטרוסקופיה מולקולרית.',
                    n: 0.119,
                },
            },
        },
        {
            i: 707,
            $: {
                '0': { v: '118085', n: 1 },
                '1': { v: 'פיסיקה גלקטית 1', n: 0.577 },
                '2': {
                    v: 'מבנה ואוכלוסיות הכוכבים בגלקסיות. הדינמיקה של מערכות כוכבים. הדינמיקה של דיסקות והמבנה הספירלי. צבירי כוכבים. חומר בינכוכבי. ההתפתחות הכימית של גלקסיות. יצירת גלקסיות. גלקסיות פעילות.',
                    n: 0.2,
                },
            },
        },
        {
            i: 708,
            $: {
                '0': { v: '118101', n: 1 },
                '1': { v: "מבוא לתורת המיתרים א'", n: 0.5 },
                '2': {
                    v: 'המיתר הבוזוני. תורת שדות קונפורמית, קוונטיזציה של המיתר, תורת ההפרעות, אמפליטודות פיזור, קומפקטיפיקציה, דואליות מרחבית, יריעות דיריכלה.',
                    n: 0.243,
                },
            },
        },
        {
            i: 709,
            $: {
                '0': { v: '118104', n: 1 },
                '1': { v: 'נו. באסטרופיזיקה: פיצוצים קוסמיים', n: 0.5 },
                '2': {
                    v: 'תהליכים פיזיקליים בפיצוצים: פיזיקת נוזלים והלמים. תהליכים גרעיניים. דפלגרציה ודטונציה פיצוצים קוסמיים:. פיצוצים תרמו-גרעיניים וסופרנובות מסוג 1. פיצוצים של קריסת ליבה וסופרנובות מסוג 2. הריסה גיאותית של כוכבים._\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים: 1. להכיר את התהליכים הפיזיקליים המרכזיים בפיצוצים אסטרופיזיקליים אנרגטיים והאופן בו הם משתלבים ליצירת מאפייני הפיצוצים.__\n2. ללמוד על פיצוצי סופרנובות גרעיניות ופיצוצי סופרנובות של קריסת ליבה, וידעו לתאר את מאפייניהם.____\n3. להכיר את המאפיינים התצפיתיים של פיצוצים קוסמיים, וכיצד ניתן להשתמש בתצפיות על סופרנובות, על סביבתן ועל השאריות שלהן כדי ללמוד על הפיצוצים.\n4. לקרוא מאמרים מדעיים בנושאי פיצוצים קוסמיים ולעשות אינטגרציה של מאמרים וסיכומם.',
                    n: 0.101,
                },
            },
        },
        {
            i: 710,
            $: {
                '0': { v: '118111', n: 1 },
                '1': { v: 'נושאים נבחרים באסטרופיסיקה', n: 0.577 },
                '2': {
                    v: 'הסילבוס יקבע לפני תחילת הסמסטר בו ינתן המקצוע. סמסטר א\' תשע"ז: דינמיקה כוכבית וגלקטית. סמסטר א\' תש"פ: תהליכים אטומיים בפלסמות אסטרופיזיקליות. סמסטר א\' תשפ"א: מקורות גלי כבידה.',
                    n: 0.192,
                },
            },
        },
        {
            i: 711,
            $: {
                '0': { v: '118113', n: 1 },
                '1': { v: 'מכניקה סטטיסטית של פולימרים', n: 0.5 },
                '2': {
                    v: "מבוא למערכות פולימריות. שרשרת בודדת: הליכה רנדומית. תמיסות פולימרים: סיכוך,תערובות פולימרים,הפרדת פאזות. מכניקה סטטיסטית של הפרדת פאזות.ג'לים. דינמיקה של שרשרת בודדת או בממיסים טובים. זרימת תמיסות פולימרים - זרימה לא-ניוטונית. תנועת שרשרת בג'ל-מודל הרפטציה.",
                    n: 0.171,
                },
            },
        },
        {
            i: 712,
            $: {
                '0': { v: '118114', n: 1 },
                '1': { v: 'נושאים נבחרים בפיסיקה עיונית', n: 0.5 },
                '2': {
                    v: 'הנושאים יתנתו במסגרת פיסיקה עיונית. הסילבוס יפורסם בנפרד. סמסטר א\' תשע"ט: סמינר בחישוב ומידע קוונטי. סמסטר ב\' תשע"ט: סדר ואירגון בחומר מעובה רך.',
                    n: 0.209,
                },
            },
        },
        {
            i: 713,
            $: {
                '0': { v: '118115', n: 1 },
                '1': { v: 'נושאים מתקדמים בפיסיקת כוכבים', n: 0.5 },
                '2': {
                    v: 'נושאים באבולוציה של כוכבים, תנודות וסיבוב של כוכבים, הפיסיקה של ספיחה, זוגות קרובים של כוכבים.',
                    n: 0.258,
                },
            },
        },
        {
            i: 714,
            $: {
                '0': { v: '118122', n: 1 },
                '1': { v: 'תורת הקוונטים 3', n: 0.577 },
                '2': {
                    v: 'משוואת דירק, משוואת קליין-גורדון, חלקיק באנטראקציה עם שדה אלקטרומגנטי ספין, פיזור, תורת ההפרעות ודיאגרמות פיינמן, קוונטיזציה שניה, קוונטיזציה של שדה אלקטרומגנטי, שדה דירק ושדה קליין-גורדון.',
                    n: 0.2,
                },
            },
        },
        {
            i: 715,
            $: {
                '0': { v: '118129', n: 1 },
                '1': { v: 'מכניקה סטטיסטית 2', n: 0.577 },
                '2': {
                    v: '(1) חזרה על עקרונות ורקע (2) מכניקה סטטיסטית של חלקיקים עם אינטראקציה: נוזל ון-דר ולס, פיתוח ויריאלי. מודלים על שריג. קירוב השדה הממוצע. תורת שדות סטטיסטית (3) מכניקה סטטיסטית לא בשיווי משקל: דינמיקה דיסיפטיבית והגעה לשיווי משקל. תגובה לינארית.',
                    n: 0.16,
                },
            },
        },
        {
            i: 716,
            $: {
                '0': { v: '118133', n: 1 },
                '1': { v: 'תורת השדות הקוונטית 2', n: 0.5 },
                '2': {
                    v: 'הקורס הוא המשך של תורת שדות קוונטיים 1. הנושאים שיידונו הם: שדות כיול ינג-מילס. הקדמה ל-QCD. שבירת סימטריה והקדמה לסופרסימטריה. מבוא לחוטים יחסותיים. נושאים נבחרים.',
                    n: 0.2,
                },
            },
        },
        {
            i: 717,
            $: {
                '0': { v: '118143', n: 1 },
                '1': { v: 'תורת הקוונטים של החומר 2', n: 0.447 },
                '2': {
                    v: "תכונות קוונטיות של מוצקים הנובעות מאינטראקציות אלקטרוניות. קוונטיזציה שנייה, קרוב הרטרי-פוק, מודל ג'ליום והגביש של ויגנר, תורת התגובה הלינארית, מיסוך, RKKY' קירוב הפאזה האקראית, נוזלי פרמי,הפרמטר ש לנדאו, גלי קול מטיפוס 0, אי יציבות סטונר, פרומגנטיות, מודל הברד, אנטיפרומגנטיות, תורת גינצבורג לנדאו, אינטראקציה אלקטרון פונון, תורת BCS. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לקרוא באופן ביקורתי ספרות עדכנית בנושא. 2. להשתמש בארגז הכלים הסטנדרטי של התיאוריה של חומר מעובה.",
                    n: 0.119,
                },
            },
        },
        {
            i: 718,
            $: {
                '0': { v: '118146', n: 1 },
                '1': { v: 'נושאים נבחרים ביחסות כללית', n: 0.5 },
                '2': {
                    v: 'שיטות מתקדמות ביחסות כללית. לדוגמה: גאומטריה דיפרנציאלית, יריעות, עקמומיות, פתרונות מדויקים, מבנה קאוזלי, בעיית קושי, סינגולריויות, קריסה וחורים שחורים, שיטות נומריות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להשתמש בכלים מתקדמים של יחסות כללית כדי לפתור בעיות.',
                    n: 0.162,
                },
            },
        },
        {
            i: 719,
            $: {
                '0': { v: '123015', n: 1 },
                '1': { v: 'השלמות כימיה', n: 0.707 },
                '2': {
                    v: 'הקורס מחולק לשבעה חלקים: מושגי יסוד, מבנה האטום, הטבלה המחזורית, הקשר הכימי, סטוכיומטריה, שיווי משקל בגזים, חומצות ובסיסים.',
                    n: 0.236,
                },
            },
        },
        {
            i: 720,
            $: {
                '0': { v: '124107', n: 1 },
                '1': { v: "כימיה לפיזיקאים מ'", n: 0.577 },
                '2': {
                    v: 'אטומים רבי אלקטרונים וקרוב האורביטל (הרטרי-פוק). המערכת המחזורית של היסודות. מתכות ואל-מתכות, חומרים יוניים ומולקולריים. מספר אבוגדרו, נוסחה אמפירית ונוסחת מבנה. משוואות כימיות וסטוכיומרטיה. ההמילטוניאן של מולקולות וקרוב בורן-אופנהיימר. ואריאציה לינארית ואורביטלים מולקולריים. יון מולקולת המימן. מולקולות דו-אטומיות. תנאים לצרוף לינארי אפקטיבי של אורביטלים. גישת הקשר הוולנטי, מולקולות פוליאטומיות, צורות רזוננס, הכלאות ומבנה מרחבי של מולקולות. תרכובות הפחמן: אלקאנים, אלקנים, אלקינים, כהלים, קטונים אמינים וחומצות קרבוכסיליות. תמיסות, ריכוזים, מהירות תגובה, תלות ארהניוס, פרופיל אנרגיה של תגובה. שיווי משקל כימי, שיווי משקל של מים. חומצות ובסיסים חזקים וחלשים, PH. תאים חשמליים, משוואת נרנסט, תאי ריכוז. הקורס יכלול כחמישה מפגשי מעבדות בנושאים: תגובות כימיות וסטוכיומטריה, קינטיקה כימית, חומצות ובסיסים, תאים חשמליים.',
                    n: 0.096,
                },
            },
        },
        {
            i: 721,
            $: {
                '0': { v: '124108', n: 1 },
                '1': { v: 'כימיה לפיסיקאים', n: 0.707 },
                '2': {
                    v: 'אטומים רבי אלקטרונים וקרוב האורביטל (הרטרי-פוק). המערכת המחזורית של היסודות. חומרים יוניים ומולקולריים. מספר אבוגדרו, נוסחה אמפירית ונוסחת מבנה. משוואות כימיות וסטוכיומרטיה. ההמילטוניאן של מולקולות וקרוב בורן-אופנהיימר. ואריאציה לינארית ואורביטלים מולקולריים. יון מולקולת המימן. מולקולות דו-אטומיות. תנאים לצרוף לינארי אפקטיבי של אורביטלים. גישת הקשר הוולנטי, מולקולות פוליאטומיות, צורות רזוננס, הכלאות ומבנה מרחבי של מולקולות. תרכובות הפחמן: אלקאנים, אלקנים, אלקינים, כהלים, קטונים אמינים וחומצות קרבוכסיליות. תמיסות, ריכוזים, מהירות תגובה, תלות ארהניוס, פרופיל אנרגיה של תגובה. שיווי משקל כימי, שיווי משקל של מים. חומצות ובסיסים חזקים וחלשים, PH. תאים חשמליים, משוואת נרנסט, תאי ריכוז. הקורס יכלול כחמישה מפגשי מעבדות בנושאים: תגובות כימיות וסטוכיומטריה, קינטיקה כימית, חומצות ובסיסים, תאים חשמליים.',
                    n: 0.097,
                },
            },
        },
        {
            i: 722,
            $: {
                '0': { v: '124117', n: 1 },
                '1': { v: "יסודות הכימיה א'", n: 0.577 },
                '2': {
                    v: 'מושגי יסוד: יסודות תרכובות ותערובות, תרכובות יוניות ומולקולריות, הנוסחה הכימית, המשוואה הכימית, ריכוזים בתמיסות מהירות תגובה. הגדרת קינטיקה של ריאקציות, שיווי משקל כימי וקבוע שיווי משקל, חומצות ובסיסים. רקע היסטורי: התפיסה המדעית הקלאסית, ספקטרום הפליטה של אטום המימן. נוסחת פלאנק, מודל בוהר, המודל הקוונטי, אורביטלים אטומיים. מבנה האטום והמערכת המחזורית, הקשר הכימי: קשר יוני, קשר קוולנטי, מבני לואיס, הכלאות ומבנה מרחבי של מולקולות, אורביטלים מולקולריים.',
                    n: 0.124,
                },
            },
        },
        {
            i: 723,
            $: {
                '0': { v: '124120', n: 1 },
                '1': { v: 'יסודות הכימיה', n: 0.707 },
                '2': {
                    v: 'אטומים, מולקולות ויונים. התורה הקוונטית והמבנה האלקטרוני של אטומים. הטבלה המחזורית. הקשר הכימי. גיאומטריה של מולקולות ואורביטלים מולקולרים. תרמוכימיה. מצב הצבירה הגזי. כוחות בין מולקולריים, נוזלים ומוצקים. תכונות פיסיקליות של תמיסות. קינטיקה כימית. שווי משקל כימי. חומצות ובסיסים. אלקטרוכימיה.',
                    n: 0.16,
                },
            },
        },
        {
            i: 724,
            $: {
                '0': { v: '124210', n: 1 },
                '1': { v: 'כימיה ביו-אי אורגנית', n: 0.577 },
                '2': {
                    v: 'הקורס יעסוק במודלים המרכזיים לתיאור הקישור בקומפלקסים של מתכות מעבר, תוך שימת דגש על אלו המתארים/חוזים בצורה הטובה ביותר את התכונות המגנטיות והפוט-פיסיקליות של קומפלקסים אלה. התייחסות מיוחדת תינתן למעורבותם של מתכות מעבר במערכות ביולוגיות חיוניות ביניהן מערכת הנשימה, שרשרת מעבר אלקטרונים ומערכות אנזימטיות.',
                    n: 0.151,
                },
            },
        },
        {
            i: 725,
            $: {
                '0': { v: '124212', n: 1 },
                '1': { v: 'מעבדה בכימיה אנליטית 1 מורחב', n: 0.447 },
                '2': {
                    v: 'ינתנו 11 הנסיונות הבאים: (פירוט בחוברת המעבדה) תמיסות: ריכוזים, מסיסות. טיטרציות חומצה-בסיס מימיות. טיטרציות חמצון-חיזור ויזואליות. טיטרציות חמצון-חיזור פוטנציומטריות. קביעת מנגן בפלדה. טיטרציות שיקוע. אלקטרודות יון סלקטיביות. גרבימטריה וקומפלקסומטריה. אלקטרוגרבימטריה, קולומטריה. ניסויים לבדיקות מים.',
                    n: 0.171,
                },
            },
        },
        {
            i: 726,
            $: {
                '0': { v: '124213', n: 1 },
                '1': { v: 'כימיה אנליטית 2 (מורחב)', n: 0.5 },
                '2': {
                    v: 'ספקטרופוטומטריה: בליעה מולקולרית, קביעת קומפלקסים, טיטרציות פוטומטריות, אנליזת שלהבת ופלזמה, פלואורימטריה. שיטות הפרדה אנליטיות: מיצוי, כרומטוגרפית גז-נוזל ונוזל-נוזל, מחליפי יונים. אלקטרואנליזה: אלקטרוגרבימטריה, קולומטריה בזרם ומתח מבוקר, פולרוגרפיה בזרם ישר ופעימות, וולטאמטריה ציקלית, אמפרומטריה.',
                    n: 0.174,
                },
            },
        },
        {
            i: 727,
            $: {
                '0': { v: '124214', n: 1 },
                '1': { v: 'מעבדה בכימיה אנליטית 2 מורחב', n: 0.447 },
                '2': {
                    v: 'ספקטרופוטמטריה: קביעת ריכוזים, אנליזה של תערובות. פלואורסנציה: אנליזה של כינין במשקאות, אנליזה של אספירין. בליעה ופליטת אטומים. כרומטוגרפית גזים: סדרות הומולוגיות, אנליזה של לימונן. גז כרומטוגרפיה עם גלאי ספקטרוסקופית מאסות ( MS-GC ). כרומטוגרפית נוזל HPLC. וולטמטריה ציקלית.',
                    n: 0.162,
                },
            },
        },
        {
            i: 728,
            $: {
                '0': { v: '124305', n: 1 },
                '1': { v: 'כימיה אי-אורגנית', n: 0.707 },
                '2': {
                    v: 'הקורס יעסוק בסקירת הטבלה המחזורית. נדגים את המחזוריות והשוני בהתנהגות של חומרים אי אורגניים ע"י תיאוריות מדעיות שונות ובעזרתן נקשר בין מבנה החומרים לבין תכונותיהם. ידע זה מקנה בסיס להבנה של תחומים מדעיים שונים כגון ביוכימיה, כימיה אורגנית, מדעי הסביבה והנדסת חומרים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 729,
            $: {
                '0': { v: '124355', n: 1 },
                '1': { v: 'פרוייקט מחקר מיוחד בכימיה', n: 0.5 },
                '2': {
                    v: "עבודת מחקר באחת מקבוצות המחקר בפקולטה לכימיה בטכניון. מיועד לסטודנטים מתואר ראשון שצברו 75 נק' לפחות. *** לפני תחילת הפרויקט על הסטודנט להגיש לועדת ההוראה בפקולטה לכימיה תקציר הצעת מחקר מאושרת על ידי חבר הסגל שעתיד להנחותו. בסיכום הפרויקט יכין הסטודנט פוסטר להצגה בפורום פקולטי, ודו\"ח מסכם אותו יגיש באישור המנחה לועדת ההוראה. היקף העבודה הוא כ- 240 שעות. הרישום מותנה בצבירה של 75 נק'.",
                    n: 0.124,
                },
            },
        },
        {
            i: 730,
            $: {
                '0': { v: '124356', n: 1 },
                '1': { v: 'מבוא למחקר בכימיה', n: 0.577 },
                '2': {
                    v: 'סדרת הרצאות מדעיות של חברי סגל הפקולטה לכימיה בנושאי מחקר עדכניים. כל הרצאה תציג בעיה מדעית ואת עקרונות שיטת המחקר שהובילה לפתרונה. רישום לקורס מותנה במילוי הדרישות של שלושה סמסטרים ראשונים לפי המערכת המומלצת באחד ממסלולי הכימיה ויש דרישה של חובת נוכחות. קביעת הציון תעשה על פי בחינה על נושאי ההרצאות.',
                    n: 0.14,
                },
            },
        },
        {
            i: 731,
            $: {
                '0': { v: '124400', n: 1 },
                '1': { v: 'כימיה קוונטית 1', n: 0.577 },
                '2': {
                    v: 'הרקע היסטורי. משוואת שרדינגר התויה בזמן, אופרטורים ופונקציות גל. עקרון הסופרפוזיציה ועקרון אי הוודאות. הנחות היסוד של תורת הקוונטים. מרחב פונקציות הגל כמרחב הילברט. משוואת שרדינגר הסטציונרית. בעיית החלקיק בתיבה, הרוטור דו מימדי וישומיהן. אפקט המנהרה במערכות כימיות. ויברציות מולקולריות. הסתברויות מעבר וספקטרום IR, משפט הפריקות. פוטנציאל מרכזי. הרוטור הקשיח. רוטציה של מולקולות דו אטומיות. אטום דמוי מימן. תורת ההפרעות. עקרון הואריאציה. שעטת השדה הממוצע. אטום ההליום. הספיק האלקטרוני. מערכות של חלקיקים זהים. מצבי סינגלט וטריפלט. קרוב הרטרי-פוק. דטרמיננו סלייטר ועקרון פאולי. המערכה המחזורית. קרוב בורן-אופנהיימר. יון מולקולת המימן. אורביטלים מולקולרים. שיטת היקל.',
                    n: 0.104,
                },
            },
        },
        {
            i: 732,
            $: {
                '0': { v: '124415', n: 1 },
                '1': { v: 'כימיה פיסיקלית-תרמודינמיקה כימית', n: 0.577 },
                '2': {
                    v: 'שיווי משקל, מערכת וסביבה, משתני מצב ופונקציות מצב, גזים אידיאלים וסטיות מאידאליות, החוק הראשון: האנרגיה הפנימית, חום ועבודה, פונקציות מסילה, תהליכים הפיכים ולא הפיכים, קיבול חום. פונקציית האנטלפיה, החוק השני ופונקציית האטרופיה, אנטרופיית הסביבה. המשמעות הסטטיסטית והחוק השלישי. מכונת קרנו וניסוח קלאוזיוס. האנרגיה החופשית, יחסי מכסוול ומשוואות מצב. דיאגרמת פאזות, רתיחה, לחץ אדים, הפוטנציאל הכימי, חוק הפאזות. תמיסות אידאליות וחוק ראול. סטיות מאידאליות וחוק הנרי. תכונות קולגטיביות, דיאגרמות פאזות בינאריות, זיקוק, שיווי משקל כימי, סטיות מאידאליות: אקטיביות לממס ומומס. תאים חשמליים ומשוואת נרסט.',
                    n: 0.11,
                },
            },
        },
        {
            i: 733,
            $: {
                '0': { v: '124416', n: 1 },
                '1': { v: 'אלקטרומגנטיות וחומר', n: 0.707 },
                '2': {
                    v: 'אנאליזה וקטורית בסיסית, השדה האלקטרומגנטי ומשוואות מקסוול בואקום דיאלקטרי. אלקטרוסטטיקה של מטענים נקודתיים-אנרגית קוהזיה של גבישים יוניים. מולטיפולים חשמליים, אינטראקציות בין-מולקולריות: אינטראקציה דיפול-דיפול. הקטבה (פולריזביליות) מולקולרית חשמלית, קיטוב חשמלי בחומרים דיאלקטריים, וקטורי הפולריזציה והעתק החשמליים. החזרה של גלים אלקטרומגנטיים ממתכת ומהיונוספירה, תדירות הפלסמה. תרמודינמיקה של תמיסות אלקטרוליטיות-תאריית דביי-היקל. נוזלים דיאלקטריים-נוסחת קלאוזיוס-מוסוטי. מוצקים דיאלקטריים- פרואלקטריות ופיזואלקטריות. מגנטו-סטטיקה, פוטנציאל וקטורי. מומנט מגנטי, אינטראקציה דיפולרית מגנטית, פרצסיה בשדה מגנטי, פרמגנטיות. תנועה ציקלוטרונית, דיאמגנטיות.',
                    n: 0.12,
                },
            },
        },
        {
            i: 734,
            $: {
                '0': { v: '124503', n: 1 },
                '1': { v: "כימיה פיסיקלית 1ב'", n: 0.577 },
                '2': {
                    v: 'חוקי הגזים, החוק הראשון של התרמודינמיקה, תרמוכימיה, אנטרופיה והחוק השני של התרמודינמיקה, אנרגיה חופשית, שיווי משקל, מעברי פאזה, פוטנציאל כימי בתהליכי עירבוב, תמיסות אידיאליות, תכונות קולקטיביות ולחצים אוסמוטיים.',
                    n: 0.189,
                },
            },
        },
        {
            i: 735,
            $: {
                '0': { v: '124510', n: 1 },
                '1': { v: 'כימיה פיסיקלית', n: 0.707 },
                '2': {
                    v: 'חוקי הגזים, החוק הראשון של התרמודינמיקה, תרמוכימיה, אנטרופיה והחוק השני של התרמודינמיקה, אנרגיה חופשית, שיווי משקל, מעברי פאזה, פוטנציאל כימי בתהליכי עירבוב, תמיסות אידיאליות, תכונות קוליגטיביות ולחצים אוסמוטיים. קינטיקה כימית: סדר ומולקולריות של תגובות, תגובות מורכבות, קטליזה הומוגנית והטרוגנית. מבוא למכניקת קוונטים וספקטרוסקופיה: קוונטיזציה, דואליות גל חלקיק, פתרונות של משוואת שרדינגר עבור חלקיק בבור פוטנציאל, אוסצילטור הרמוני (ספקטרום ויברציה) ורוטור קשיח (ספקטרום רוטציה).',
                    n: 0.126,
                },
            },
        },
        {
            i: 736,
            $: {
                '0': { v: '124601', n: 1 },
                '1': { v: 'מעבדה בכימיה פיסיקלית 1', n: 0.5 },
                '2': {
                    v: 'הוראת שיטות מדידה ודרכי עבודה בכימיה פיסיקלית, חקר נסיוני של תופעות בסיסיות וניתוח תוצאות, לימוד טכניקות מעבדתיות בהדגשת עבודה עצמאית. עריכת ניסויים בנושאים: תרמודינמיקה, התורה הקינטית של הגזים, תרמוכימיה, שיווי משקל כימי, אלקטרוכימיה ופוטנציומטריה, קינטיקה כימית, ספקטרופוטומטריה וכימית השטח.',
                    n: 0.16,
                },
            },
        },
        {
            i: 737,
            $: {
                '0': { v: '124605', n: 1 },
                '1': { v: 'מע. בכימיה פיסיקלית 2 לכימאים', n: 0.447 },
                '2': {
                    v: 'לימוד שיטות מדידה ודרכי עבודה בכימיה פיסיקלית. חקר נסיוני של תופעות בסיסיות וניתוח תוצאות. לימוד טכניקות מעבדתיות תוך הדגשת עבודה עצמאית. נסיונות נוספים בכימיה פיסיקלית בנושאים: התורה הקינטית של הגזים, תרמוכימיה, שיווי משקל כימי, קינטיקה כימית, אלקטרוכימיה, כימית השטח, קביעת מבנה מולקולרי, ספקטרוסקופיה בתחום האינפרא-אדום, הנראה והאולטרה-סגול.',
                    n: 0.146,
                },
            },
        },
        {
            i: 738,
            $: {
                '0': { v: '124608', n: 1 },
                '1': { v: 'מע. בכימיה פיסיקלית להנ. חומרים', n: 0.447 },
                '2': {
                    v: 'לימוד שיטות מדידה ודרכי עבודה מעבדתית מתקדמת לשם חקירה נסויית של חוקים ותופעות בתחומי הכימיה הפיסיקלית. עריכת נסיונות בשטחי תרמודינמיקה, קינטיקה כימית, אלקטרוכימיה, התורה הקינטית של הגזים, תהליכי שטח וספקטרוסקופיה בתחומי האינפרא אדום, הנראה והאולטרא-סגול. הכרת שיטות מתקדמות תוך כדי שימת דגש על עבודה עצמאית, שימוש בטכניקות ואקום מתקדמות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 739,
            $: {
                '0': { v: '124610', n: 1 },
                '1': { v: 'מעבדה כימיה פיסיקלית 1', n: 0.5 },
                '2': {
                    v: 'הוראת שיטות ומדידה ודרכי עבודה בכימיה פיסיקלית, חקר נסיוני של תופעות בסיסיות וניתוח תוצאות, לימוד טכניקות מעבדתיות בהדגשת עבודה עצמאית. עריכת ניסויים בנושאים: תרמודינמיקה, התורה הקינטית של הגזים, תרמוכימיה, שיווי משקל כימי, אלקטרוכימיה ופוטנציומטריה, קינטיקה כימית, ספקטרופוטומטריה וכימית השטח.',
                    n: 0.16,
                },
            },
        },
        {
            i: 740,
            $: {
                '0': { v: '124611', n: 1 },
                '1': { v: 'מעבדת מבוא לפיסיקה כימית', n: 0.5 },
                '2': {
                    v: 'תנודה במערכות מכנית דו-גרפית (הרמוני/אנהרמוני). זיהוי אופני תנודה במערכת תלת גופית, סיגנל משתנה בזמן, עיבוד מעגל באמצעות מחשב, בניית מעגלים חשמליים פשוטים, מדידת זרם מאולץ, רוחב קו הרזוננס ופקטור איכות, סימולציה ממוחשבת של מתח, מעגל תהודה אוסצילטור רב גופי ומדידת ספקטרום ויברציה של מולקולה תלת אטומית.',
                    n: 0.147,
                },
            },
        },
        {
            i: 741,
            $: {
                '0': { v: '124613', n: 1 },
                '1': { v: 'מעבדה בכימיה פיזיקלית 2', n: 0.5 },
                '2': {
                    v: 'לימוד שיטות מדידה מתקדמות בכימיה פיסקלית. עיבוד תוצאות ניסוייות והכרת מודלים תיאורטיים שמתארים את הניסויים בנושאים הבאים: התורה הקינטית של הגזים, תרמוכימיה, שיווי משקל כימי, קינטיקה כימית, אלקטרוכימיה, כימיית שטח ואלקטרומגנטיות של חומר. ספקטרוסקופיה בתחומים ספקטראלי האולטרה-סגול, הנראה והאינפרה-אדום, ספקטרוסקופיה מגנטית של ספין אלקטרוני, מדידות תרמיות ואקוסטיות',
                    n: 0.146,
                },
            },
        },
        {
            i: 742,
            $: {
                '0': { v: '124618', n: 1 },
                '1': { v: 'מע. בכימיה פיסיקלית להנ. חומרים', n: 0.447 },
                '2': {
                    v: 'לימוד שיטות מדידה ודרכי עבודה מעבדתית מתקדמת לשם חקירה נסויית של חוקים ותופעות בתחומי הכימיה הפיסיקלית. עריכת נסיונות בשטחי תרמודינמיקה, קינטיקה כימית, אלקטרוכימיה, התורה הקינטית של הגזים, תהליכי שטח וספקטרוסקופיה בתחומי האינפרא אדום, הנראה והאולטרא-סגול. הכרת שיטות מתקדמות תוך כדי שימת דגש על עבודה עצמאית, שימוש בטכניקות ואקום מתקדמות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 743,
            $: {
                '0': { v: '124703', n: 1 },
                '1': { v: 'מבנה ופעילות בכימיה אורגנית', n: 0.5 },
                '2': {
                    v: 'משטחי פוטנציאל, פרופיל תגובה, מנגנון וקינטיקה. תרמוכימיה. הנחת המונד, יחסי ריאקטיביות - סלקטיביות, משוואות לינאריות באנרגיה חפשית (כגון משואת המט). גופי ביניים פעילים בכימיה אורגנית כגון: יוני קרבוניום, קרבניונים, וקרבנים ותפקידם בסינתזה אורגנית.',
                    n: 0.174,
                },
            },
        },
        {
            i: 744,
            $: {
                '0': { v: '124708', n: 1 },
                '1': { v: 'כימיה אורגנית מורחב 1', n: 0.5 },
                '2': {
                    v: 'מבוא - קישור, מבנה, אנרגיות קשר, תגובות אורגניות: תרמודינמיקה, קינטיקה, דיאגרמת ריאקציה, חומציות ובסיסיות. אלקאנים. מחסומים לסיבוב, ציקלואלקאנים, מתח. תגובות שרשרת, הלוגנציות. סטריאוכימיה: אננטיומרים, דיאסטראואיזומרים, אלקיל הלידים, 1E , 2E , 1NS , 2NS . כהלים ואתרים. אלקנים. תהודה מגנטית גרעינית. אלקינים וניטרילים. אלדהידים, קטונים, צימוד וארומטיות.',
                    n: 0.146,
                },
            },
        },
        {
            i: 745,
            $: {
                '0': { v: '124911', n: 1 },
                '1': { v: 'מעבדה כימיה אורגנית 1', n: 0.5 },
                '2': {
                    v: 'סינתזות אורגניות פשוטות המבוססות על ההרצאות של כימיה אורגנית 1 ו-2, תוך הדגשת לימוד הטכניקות המעבדתיות. לימוד המנגנון לתגובות אורגניות.',
                    n: 0.224,
                },
            },
        },
        {
            i: 746,
            $: {
                '0': { v: '124912', n: 1 },
                '1': { v: 'מעבדה בכימיה אורגנית 2מ', n: 0.5 },
                '2': {
                    v: 'לימוד וביצוע של סינתזות מורכבות ורבות שלבים כולל פרויקט לקראת סוף המעבדה. שימוש במערכות מעבדתיות מורכבות, בשיטות ספקטרוסקופיות (אינפרה-אדום, אולטרה-סגול, ת.מ.ג.).',
                    n: 0.218,
                },
            },
        },
        {
            i: 747,
            $: {
                '0': { v: '125001', n: 1 },
                '1': { v: 'כימיה כללית', n: 0.707 },
                '2': {
                    v: 'מבוא, משקלים אטומיים ומולקולריים, יחידת ריכוז, סטויכיומטריה. ספקטרום אטומי. אטום המימן לפי מודל בוהר. חלקיקים וגלים, משוואת שרדינגר. אורביטלים אטומיים. המערכה המחזורית. הקשר היוני, הקשר הקוולנטי, נוסחאות לואיס. מומנט דיפול. מבנה מרחבי של מולקולות. גזים, משוואת הגזים האידאליים, נוזלים, לחץ אדים, רתיחה, תכונות נוזלים. מוצקים, סוגי סריגים גבישיים, גבישים יונים. דיאגרמת פאזות. תרמוכימיה, אנרגיה פנימית ואנטלפיה, חוק הס. שווי משקל בריאקציות כימיות, שיווי משקל הטרוגני, שווי משקל במערכות גזיות, עקרון לה שטליה. תמיסות אלקטרוליטיות, מלחים קשי תמס ומכפלת המסיסות, חומצות ובסיסים. תהליכי חימצון חיזור, תאים אלקטרוכימיים, מצברים ותאי דלק.',
                    n: 0.106,
                },
            },
        },
        {
            i: 748,
            $: {
                '0': { v: '125013', n: 1 },
                '1': { v: 'מעבדה בכימיה כללית', n: 0.577 },
                '2': {
                    v: 'תדריך בטיחות, כלי מדידה ודיוק מדידה, תגובות שריפה (בונזן) קביעת ריכוז נעלם ע"י טיטרציה, קביעת מי גבש בנחושת-סולפאט. שיווי משקל כימי ועיקרון ל-שטלייה. קביעת שקולת אבץ ( ZN ) בשיטת הדחייה (חוק הגזים האידאליים). ספקטרום פליטה/בליעה אטומי. זהות יסודות בלהבה. חוקי הבליעה, דיאגרמות פזות מצבי הצבירה. מדידת אנתלפיית האידוי. מחליפי יונים. חומצות ובסיסים עקומי אלוציה.',
                    n: 0.135,
                },
            },
        },
        {
            i: 749,
            $: {
                '0': { v: '125101', n: 1 },
                '1': { v: 'כימיה אנליטית 1 למהנדסים', n: 0.5 },
                '2': {
                    v: 'מבוא לכימיה אנליטית, שגיאות נסיוניות ואומדנן. גרירת שגיאות. סטיות תקן. תחומי אמינות, רגרסיה לינארית, רמת ודאות, שיווי משקל כימי ופתרון כללי של משוואות שיווי משקל. חומצות ובסיסים, תמיסות מגן: משוואת ברנסטד הכללית. אלקטרוכימיה וחימצום-חיזור. תיאור מתמטי של טיטרציות. טיטרציות בסיס חומצה וטיטרציות שיקוע. חישוב הדיוק היחסי של טיטרציה, אנליזת KJELDAHL, קומפלקסומטריה. יסודות האלקטרו-אנליזה, פוטנציומטריה, קולומטריה ואלקטרוגרבימטריה. אנליזת גרבימטריות ותהליכים לשיקוע אנליטי.',
                    n: 0.128,
                },
            },
        },
        {
            i: 750,
            $: {
                '0': { v: '125102', n: 1 },
                '1': { v: 'מעבדה כימיה אנליטית 1 למהנדסים', n: 0.447 },
                '2': {
                    v: 'ניסויים בשטחים השונים של הכימיה האנליטית. במסגרת המעבדה ינתנו הרצאות מקדימות בנושאים הקשורים למעבדה.',
                    n: 0.267,
                },
            },
        },
        {
            i: 751,
            $: {
                '0': { v: '125105', n: 1 },
                '1': { v: 'מע.בכימיה אנליטית 1 להנ.ביוכימית', n: 0.5 },
                '2': {
                    v: "נסויים בשטחים השונים של הכימיה האנליטית. הערה: המעבדה ניתנת במסגרת קורס מס' 125102.",
                    n: 0.277,
                },
            },
        },
        {
            i: 752,
            $: {
                '0': { v: '125800', n: 1 },
                '1': { v: "כימיה אורגנית מ'", n: 0.577 },
                '2': {
                    v: 'הקורס ניתן במתכונת MOOC (MASSIVE OPEN ONLINE COURSE ) הקורס מקנה ידע כללי בכימיה אורגנית ועוסק במבנה, תכונות, הכנה וחקירה של תרכובות אורגניות בעלות חשיבות בתעשייה ובחיי היום-יום.. הקורס כולל את התכנים הבאים : פחמימנים: קונפורמציות, ציקלואלקנים. חקירת תגובות כימיות (מנגנון תגובה(. אלקיל הלידים, הלוגנציות רדיקליות. סטריאוכימיה, פעילות אופטית. אלקיל הלידים-התמרות נוקלאופיליות+ אלימינציות. אלקנים (ALKENES). תרכובות קרבוניליות א + ב. חומצות קרבוקסיליות ונגזרותיהן. תרכובות ארומטיות. מולקולות ביולוגיות.',
                    n: 0.122,
                },
            },
        },
        {
            i: 753,
            $: {
                '0': { v: '126302', n: 1 },
                '1': { v: "מעב' אנליטית מתקדמת בניטור סביבתי", n: 0.447 },
                '2': {
                    v: 'הכרת שיטות אנליטיות מתקדמות בניטור סביבתי, שיטות דגימה, שיטות מדידה בתחום ה- PPB. שיטות אלקטרואנליטיות וספקטרופוטומטריות לאנליזה של סולפטים, ניטרטים ומתכות כבדות במים. אנליזות של חומרים אורגניים נדיפים ( VOC ) באויר בשיטות סטנדרטיות לאיכות הסביבה (שיטות EPA ). ניטור זיהומים באויר באמצעות GC.',
                    n: 0.151,
                },
            },
        },
        {
            i: 754,
            $: {
                '0': { v: '126303', n: 1 },
                '1': { v: 'מע. בכימיה אי-אורגנית ואורגנומתכת', n: 0.5 },
                '2': {
                    v: 'פיתוח מיומנויות עבודה בכימיה אי-אורגנית וכימיה אורגנומתכתית מתקדמת. טכנולוגיות ואקום ושלנק. הנסויים יתקיימו באוירה אינרטית ובתאי כפפות.',
                    n: 0.243,
                },
            },
        },
        {
            i: 755,
            $: {
                '0': { v: '126600', n: 1 },
                '1': { v: 'מעבדה מתקדמת בכימיה פיסיקלית', n: 0.5 },
                '2': {
                    v: 'נושאים: תכונות של משטחים: תרמודינמיקה ושכבות גבול. מבנה של משטחים מוצקים ותכונות אלקטרוניות של משטחי גבול. אינטראקציה של גזים על פני מוצקים. ספיחה כימית וספיחה פיסיקלית. איזותרמות ספיחה. התכונות של השכבה הספוחה. מבוא לשיטות נסיוניות בחקר משטחים ונושאים נבחרים בחקר תהליכים משטחיים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 756,
            $: {
                '0': { v: '126602', n: 1 },
                '1': { v: 'כימיה פיסיקלית ניסיונית מתקדמת', n: 0.5 },
                '2': {
                    v: 'שניים מבין הנושאים הבאים: 1. ספקטרוסקופיה ומיקרוסקופיה של ננו גבישים. 2. ספקטרוסקופית תמ"ג במצב מוצק. 3. אפיון מקרומולקולרי ברזולוציה אטומית. 4. שיטות גילוי רגישות למדידת אותות.',
                    n: 0.196,
                },
            },
        },
        {
            i: 757,
            $: {
                '0': { v: '126604', n: 1 },
                '1': { v: 'מעבדה בטכנולוגיות קוונטיות א', n: 0.5 },
                '2': {
                    v: '2 מתוך 4 ניסויים במערכות קוונטיות שונות. ניסוי יתבצע על ידי זוג סטודנטים. משך כל ניסוי יהיה 3 שבועות.\nפירוט הניסויים:\nVN ביהלום כמדיד שדה מגנטי מדידות ODMR .\nהתאבכות מפוטונים בודדים וניסויים באופטיקה קוונטית עם פוטונים בודדים.\nמחשוב קוונטי עם תהודה מגנטית גרעינית - ניסיונות בקיוביט בודד.\nVN ביהלום כקיוביט יחיד - מדידות ODMR עם גלאי פוטונים בודדים. תוצאות למידה: הקורס מיועד לסטודנטים בעלי רקע בסיסי באינפורמציה וטכנולוגיה קוונטיצת המעוניינים להתנסות בניסויים בסיסיים בתחום.\nבסיום הקורס הסטודנט יהיה מסוגל: 1. להכיר באופן מעשי לפחות שני ניסויים שהם אבני בניין בטכנולוגיה קוונטית עכשווית. 2. להבין את הבעיות המעשיות שמגבילות את היכולות של מערכות קוונטיות בעולם האמיתי ולהתנסות בצימצום המגבלות.',
                    n: 0.099,
                },
            },
        },
        {
            i: 758,
            $: {
                '0': { v: '126605', n: 1 },
                '1': { v: 'מעבדה בטכנולוגיות קוונטיות מתקדמת', n: 0.5 },
                '2': {
                    v: '2 מתוך 4 ניסויים במערכות קוונטיות שונות.\nקוונטיות שונות. כל ניסוי יתבצע במשך 6 שבועות.\n* NV ביהלום כמדיד שדה מגנטי, מדידות ODMR והארכת זמן קוהרנטיות.\n* התאבכותת מפוטונים בודדים וניסויים באופטיקה קוונטית עם פוטונים בודדים, העברת קוד קוונטי.\n* מחשוב קוונטי עם תהודה מגנטית גרעינית, ניסיונות בקיוביט בודד ושני קיוביטים.\n* NV ביהלום כקיוביט יחיד, מדידות ODMR עם גלאי פוטונים בודדים וחישה קוונטית. תוצאות למידה: הקורס מיועד לסטודנטים בעלי רקע מתקדם יחסית באינפורמציה וטכנולוגיה קוונטית המעונינים להתנסות בניסויים בסיסיים ומתקדמים בתחום.\nבסיום הקורס הסטודנט יהיה מסוגל: 1. להכיר באופן מעשי לפחות שני ניסויים שהם אבני בניין בטכנולוגיה קוונטית עכשווית. 2. להבין את הבעיות המעשיות שמגבילות את היכולות של מערכות קוונטיות בעולם האמיתי ולהתנסות בצימצום המגבלות.',
                    n: 0.095,
                },
            },
        },
        {
            i: 759,
            $: {
                '0': { v: '126901', n: 1 },
                '1': { v: 'מעבדה מתקדמת בכימיה אורגנית', n: 0.5 },
                '2': {
                    v: 'נושאים בכימיה אורגנית מודרנית: כימיה אורגנו-מתכתית, סינתזה אסימטרית, כימיה חישובית, נוגדנים קטליטיים, סינתזה של רב-סוכרים. דרישות: פרוייקט שיוצג בפני הכיתה.',
                    n: 0.224,
                },
            },
        },
        {
            i: 760,
            $: {
                '0': { v: '126902', n: 1 },
                '1': { v: 'מעבדה מתקדמת כימיה אורגנית פיסיקל', n: 0.447 },
                '2': {
                    v: 'לימוד טכניקות מעבדתיות בדגש על עבודה עצמאית. תכנון וביצוע ניסויים וניתוח תוצאות בנושאים הרלוונטיים לכימיה אורגנית מודרנית. הפרויקטים יוצגו בפני הכיתה.',
                    n: 0.218,
                },
            },
        },
        {
            i: 761,
            $: {
                '0': { v: '127010', n: 1 },
                '1': { v: 'נושאים מתקדמים בכימיה פיזיקלית', n: 0.5 },
                '2': {
                    v: 'מוטיבציה: מתי יש צורך במערכות קוונטיות פתוחות.\nשפה בסיסית: מטריצת צפיפות, מצבי טנזור, מצבים מופחתים. דגם של סביבה.\nדינמיקה מופחתת: גזירת משוואת לינדבלד. מהם הקירובים. מתי זה נכון.\nמאפייני משוואת לינדבלד: מבנה המשוואה, תכונות מתמטיות, ניתוק בין .והרנטיות ואלמנטים אלכסוניים.\nכיצד לפתור את משוואת לינדבלד ומאפיינים של המצב היציב.\nדוגמה 1 ליישומים של מערכות קוונטיות פתוחות. דה-קוהרנטיות: האם הסביבה היא האויב.\nדה-קוהרנטיות במידע קוונטי ומעבר קוונטי קלאסי.\nדוגמה 2 ליישומים של מערכות קוונטיות פתוחות. הובלה קוונטית בעזרת סביבה - לפעמים הסביבה יכולה להיות שימושית. ENAQT, הובלה קוונטית, ביולגיה קוונטית.\nוגמה 3 ליישומים של מערכות קוונטיות פתוחות: תרמודינמיקה קוונטית: סביבות מרובות אפילו טובות יותר.\nמכונות חום קוונטיות ותרמליזציה. האם מכונות חום קוונטיות יכולות להיות טובות יותר ממכונות חום קלאסיות.\nדוגמה 4 ליישומים של מערכות קוונטיות פתוחות: רעש קוונטי.\nהשפעות הרעש בטכנולוגיות קוונטיות: רעש ומערכות קוונטיות פתוחות._\nדוגמה 5 ליישומים של מערכות קוונטיות פתוחות: מדידות ומערכות קוונטיות פתוחות תורת המדידה, הקשר בין מדידות ומערכות קוונטיות פתוחות._\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n-לדעת למדל מערכת קוונטית לא מבודדת ולקבל אינטואיציות בסיסיות לגבי התנהגותה.\n-להכיר את המודלים הבסיסיים של רעש_.\n-לדעת לכתוב ולפתור משוואות דינמיות של מערכת בהשפעת סביבתה, החל ממודל מיקרוסקופי.__\n-להכיר את המודל הבסיסי של דה-קוהרנטיות_.',
                    n: 0.075,
                },
            },
        },
        {
            i: 762,
            $: {
                '0': { v: '127427', n: 1 },
                '1': { v: 'מצב מוצק לכימאים (מורחב)', n: 0.5 },
                '2': {
                    v: 'סריגים גבישיים, דיפרקציה מגביש, הסריג ההופכי. מודל דרודה להולכה במתכות, מוליכות חשמלית ומוליכות חום. התיקון של זומרפלד - גז אידאלי של פרמיונים, קיבול חום אלקטרוני. תורת ההולכה הקוונטית - משפט בלוך, פסי אנרגיה, אלקטרונים וחורים, מסה אפקטיבית, משטח פרמי, דינמיקה אלקטרונית בשדה מגנטי, מבנה פסים של מוליכים למחצה - המצב האינטרינסי. סטטיסטיקה של נושאי מטען, רמות סיגים, תכונות אופטיות - אקסיטונים. דינמיקת סריג-פונונים. קיבול חום, תכונות אופטיות של גבישים יוניים.',
                    n: 0.12,
                },
            },
        },
        {
            i: 763,
            $: {
                '0': { v: '127437', n: 1 },
                '1': { v: 'פוטוקטליזה', n: 1 },
                '2': {
                    v: 'אתגרים גלובליים ואנרגיה מתחדשת, סקירת רקע על פוטוכימיה, קטליזה הומוגנית והטרוגנית ומצב מוצק, תאים פוטואלקטרוכימיה ופוטוקטליזה מבוססת חלקיקים, אתגרים בבחירת החומרים, פוטפיזיקה של חומרים בממד ננומטרי, דינמיקת אקסיטון, ממשק מוליך למחצה ומתכת, צומת מוליך למחצה ותמיסה, דינמיקת מעבר מטען, תאורית מארקוס, שיטות ניסיוניות רלוונטיות, דיון מונחה בספרות עדכנית עם דגש על אפליקציות.',
                    n: 0.139,
                },
            },
        },
        {
            i: 764,
            $: {
                '0': { v: '127449', n: 1 },
                '1': { v: 'מעבדה בכימיה קוונטית חישובית', n: 0.5 },
                '2': {
                    v: 'שיטות החישוב הנפוצות בכימיה קוונטית על מחשבים קלאסיים. גישות מבוססות פונקציות גל HARTREE-FOCK, CI COUPLED CLUSTERS , גישות מבוססות צפיפות (DFT, TD-DFT ). ותרגולן תוך שימוש בתוכנות חישוב וויזואליזציה. יישומים בחישובי אנרגיה וגאומטריה של קונפורמציות מולקולריות יציבות, חישוב מצבי מעבר וקורדינטות תגובה, חישוב ספקטרה, NMR IR, הכרת סימולטורים קוונטיים והיישומים של מחשבים קוונטים בחישובים בכימיה קוונטית. תוצאות למידה.\nהסטודנט יכיר גישות חישוביות שונות בכימיה קוונטית, ידע לבחור גישה מתאימה לבעיה נתונה, וידע ליישם אותה תוך שימוש בתכנות נפוצות לכימיה קוונטית. הסטודנט יכיר יישומים של מחשב קוונטי לפתרון בעיות בכימיה קוונטית.',
                    n: 0.106,
                },
            },
        },
        {
            i: 765,
            $: {
                '0': { v: '127452', n: 1 },
                '1': { v: 'שליטה ומדידה קוונטית בכימיה פיס.', n: 0.447 },
                '2': {
                    v: 'שליטה ומדידה קוונטית קוהרנטית באמצעות פולסי לייזר קצרים ופולסי תדר רדיו: 1. מאפיינים פיסיקליים של פולסי לייזר קצרים של פמטושניות, עיצוב אופטי של פולסי פמטושניות, שיטות אפיון של פולסי פמטושניות, מבנה לייזרים ויצירה של פולסי פמטושניות, שליטה קוהרנטית מהירה במערכות קוונטיות מולקולריות באמצעות פולסי פמטושניות מעוצבים. 2. עקרונות תמ"ג: הפולריזציה, האינטראקציות, ההמילטוניאנים (היסט כימי, צימוד ספין-ספין). מהו ה- FID וכיצד מודדים. שיטות גל רציף ופולסים. מטריצת הצפיפות ומשוואות התנועה במערכת זוג ספינים מצומדים, המעברים הספקטרליים, INEPT העברת פולריזציה (מימן-פחמן), שיטות להסרת צימוד. תוצאות למידה הסטודנט יבין את הכלים הניסיוניים והשימוש בהם לשליטה ומדידה קוונטית בטכניקות אופטיות ואלקטרומגנטית.',
                    n: 0.102,
                },
            },
        },
        {
            i: 766,
            $: {
                '0': { v: '127456', n: 1 },
                '1': { v: 'תכנון מולקולרי של חומרים ביולוגיי', n: 0.447 },
                '2': {
                    v: 'אבני הבניין הביולוגיות, תהליך ההרכבה העצמית הביולוגי, פולימרים ופיברילות ביולוגיים, חומרים מבוססי אבני בניין ביולוגיים, עקרונות התכנון של חומרים מרמת מבנים ננומטריים ועד לתכנון פולימרים ביולוגיים, שימושים בחומרים ביולוגיים בתעשייה ומחקר, שימושים עתידיים בחומרים ביולוגיים. פרויקט של הצגת סמינר ועבודה._\nתוצאות למידה: בסיום הקורס, הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להכיר את התכונות הייחודיות של אבני בניין ביולוגיות, מרמת המולקולה הבודדת, ועד לפולימרים גדולים._\n2. הסטודנטים יכירו אסטרטגיות וכלים לתכנון מולקולרי של חומרים ביולוגיים ויוכלו לבחור את אבני הבניין שמתאימות לחומר ביולוגי בעל תכונות רצויות ולהתאים בין תכונות החומר לשימוש הרצוי._\n3. לקרוא בצורה ביקורתית מחקרים מולטידיסיפלינרים בנושאים הקשורים לתכנון ושימוש בחומרים ביולוגיים. 4. בעקבות הפרויקט יוכלו לכתוב הצעות מחקר ה בנושאים שקשורים לתכנון ושימוש בחומרים ביולוגיים.\n4. בעקבות הפרויקט יוכלו לכתוב הצעות מחקר המשלבות דיסציפלינות שונות בנושאים שקשורים לתכנון ושימוש בחומרים ביולוגיים.',
                    n: 0.089,
                },
            },
        },
        {
            i: 767,
            $: {
                '0': { v: '127738', n: 1 },
                '1': { v: 'כימיה אורגנית 3 מורחב', n: 0.5 },
                '2': {
                    v: 'סיפוח למערכות מצומדות, שימוש בצורונים אורגנומתכתיים,שליטה בסטראוכימית, קשרים כפולים, תגובות אלמינציה, סטראוכימיה של אנולאטים, כמוסלקטיביות, תגובות אלקילציה, סטראוסלקטיביות במולקולות ציקליות, תגובות פריצקליות, סינתזה וראקטיביות של קרבנים, כימיה הטרוציקלית, יסודות הקבוצה הראשית ותרכובות ארומטיות.',
                    n: 0.174,
                },
            },
        },
        {
            i: 768,
            $: {
                '0': { v: '128007', n: 1 },
                '1': { v: 'שיטות מחקר מתקדמות 1', n: 0.5 },
                '2': {
                    v: 'לימוד שיטות מתקדמות בנושא ספציפי באחד מן השטחים הבאים: כימיה אנליטית כימיה תיאורטית, כימיה אורגנית, כימיה אי אורגנית, כימיה פיסיקלית, פיסיקה כימית, כימיה סביבתית.\nעבודת המחקר תכלול לימוד שיטות מעבדה מתקדמות, תכנון ניסויים וסיכומם בצורה הנהוגה בספרות המדעית.',
                    n: 0.164,
                },
            },
        },
        {
            i: 769,
            $: {
                '0': { v: '128008', n: 1 },
                '1': { v: 'שיטות מחקר מתקדמות 2', n: 0.5 },
                '2': {
                    v: 'לימוד שיטות מחקר מתקדמות בנושא ספציפי באחד מן השטחים הבאים: כימיה אנליטית, כימיה תיאורטית, כימיה אורגנית, כימיה אי אורגנית, כימיה פיסיקלית, פיסיקה כימית, כימיה סביבתית.\nעבודת המחקר תכלול לימוד שיטות מעבדה מתקדמות, תכנון ניסויים, תכנון ניסויים וסיכומם בצורה הנהוגה בספרות המדעית.',
                    n: 0.158,
                },
            },
        },
        {
            i: 770,
            $: {
                '0': { v: '128413', n: 1 },
                '1': { v: 'סמינר בכימיה פיסיקלית ואנליטית', n: 0.5 },
                '2': {
                    v: 'מתן סמינרים בנושאים מהספרות בכימיה פיסיקלית ואנליטית אשר אינם קשורים ישירות לנושא המחקר של הסטודנט. מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים ברמה גבוהה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 771,
            $: {
                '0': { v: '128713', n: 1 },
                '1': { v: 'סמינר בכימיה אורגנית ואי-אורגנית', n: 0.5 },
                '2': {
                    v: 'מתן סמינרים בנושאים מהספרות בכימיה אורגנית ואי-אורגנית אשר אינם קשורים ישירות לנושא המחקר של הסטודנט. מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים ברמה גבוהה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 772,
            $: {
                '0': { v: '128719', n: 1 },
                '1': { v: 'הכימיה בפיתוח תרופות', n: 0.577 },
                '2': {
                    v: "עקרונות בסיסיים בגילוי תרופה, מולקולות שונות: פפטידים כדוגמא, פפטידו- ממטיקה/מולקולות קטנות וחלבונים כדוגמא לתקופות פוטנציאליות כנגד מגוון מחלות. מגוון דוגמאות של תרופות ידועות: אינסולין, מעכבי פוטאזות ל- HIV, EPO. הקורס יכסה את תהליכי הגילוי המובילים לתרופה ספציפית ואיך הכימיה משחקת תפקיד חיוני בתהליכים אלה (סינתזה, סריקה, עיצוב מבוסס מבנה וכו'). בסיום הקורס הסטודנט ידע: 1. תהליך הגילוי המוביל לתרופות חדשות. 2.התרומה של הכימיה לתהליכים אלו. 3. המורכבות בתהליך גילוי התרופה. 4. תחומי המחקר השונים המעורבים בתהליכים אלו כגון: זיהוי מטרות ויחסי פעילות מבנה.",
                    n: 0.11,
                },
            },
        },
        {
            i: 773,
            $: {
                '0': { v: '134015', n: 1 },
                '1': { v: "הכרת החי והצומח ב'", n: 0.5 },
                '2': {
                    v: 'הקורס יעסוק בחי ובצומח של ארץ ישראל. ידונו בזואוגאוגרפיה ובגאובוטניקה, במקורות הפאונה, בחברות הצומח ובתפוצה של החי והצומח. סיורים באזורים שונים של הארץ, חוף, חורש, שמורות, ימחישו את הקשר בין החי והצומח לסביבתם.',
                    n: 0.174,
                },
            },
        },
        {
            i: 774,
            $: {
                '0': { v: '134019', n: 1 },
                '1': { v: 'מבוא לביוכימיה ואנזימולוגיה', n: 0.577 },
                '2': {
                    v: "בסמסטר א' הקורס מיועד: להנדסה כימית, כימיה, מכונות, סביבה, ביו-רפואה בלבד. בסמסטר ב' הקורס מיועד: לביולוגיה ומסלוליה, הנדסת ביוטכנולוגיה ומזון והוראת המדעים בלבד. המבנה והתכונות של חומצות אמינו. תכונות כימיות ופיסיקאליות של פפטידים וחלבונים: מבנה ראשוני, שניוני ושלישוני. תהליך הקיפול של חלבונים ותפקוד של השפרונים. תכונות ייחודיות לחלבונים סיביים, מבניים וממברנאלים. בידוד והפרדה של חלבונים. מבנה רביעוני: המוגלובין כמודל לאינטראקציות קואופרטיביות. אנזימים, עקרונות הקטליזה האנזימתית, קואנזימים וקופקטורים, קינטיקה אנזימתית, מבנה האתר הפעיל ומנגנוני קטליזה נפוצים. בקרת פעולתם של אנזימים ומנגנוני עיכוב שונים. בקרה של אנזימים על ידי מודיפיקציות אחר-תרגומיות. מבוא למבנה ותפקוד של סוכרים וליפידים.",
                    n: 0.103,
                },
            },
        },
        {
            i: 775,
            $: {
                '0': { v: '134020', n: 1 },
                '1': { v: 'גנטיקה כללית', n: 0.707 },
                '2': {
                    v: "בסמסטר א' הקורס מיועד להנ.ביוטכנולוגיה ומזון והשאר על בסיס פנוי. בסמסטר ב' הקורס מיועד לביולוגיה ומסלוליה והוראת המדעים בלבד. נושאי הקורס: חוקי התורשה המנדליים והלא מנדליים, מהות הגן, ניתוח שושלות, התיאוריה הכרומוזומלית של ההורשה, קביעת מין, תאחיזה, שחלוף ושיטות למיפוי גנים באדם ובאורגניזמים שונים, מוטציות ושינויים במבנה הכרומוזומים ובמספרם, אינטראקציה בין גנים. הערה: הקורס פתוח לסטודנטים מפקולטות אחרות. ידרשו מקצועות קדם מקבילים בתאום עם מורה הקורס.",
                    n: 0.123,
                },
            },
        },
        {
            i: 776,
            $: {
                '0': { v: '134049', n: 1 },
                '1': { v: 'פרויקט מחקר בביולוגיה', n: 0.577 },
                '2': {
                    v: "תכנון וביצוע עצמאי של מחקר באחד משטחי הביולוגיה המיוצגים בפקולטה בהנחיית חבר סגל הפקולטה. בהיקף של 160 שעות. בתום המחקר, על הסטודנט לסכם את המחקר כחיבור ערוך בצורת מאמר מדעי בהיקף של כ-15 עמ' אשר יוגש למנחה ולועדת ההוראה של הפקולטה. החיבור יכלול סקירה של הספרות הקשורה לעבודת המחקר שבוצעה. הערה: הקורס נועד לסטודנטים שצברו 76 נקודות. ההרשמה למקצוע מותנית במציאת מדריך/מנחה. מקצועות קדם: קורסים בסיסיים בהתאם לנושא העבודה.",
                    n: 0.12,
                },
            },
        },
        {
            i: 777,
            $: {
                '0': { v: '134058', n: 1 },
                '1': { v: 'ביולוגיה 1', n: 0.707 },
                '2': {
                    v: "בסמסטר א' הקורס מיועד ל: ביולוגיה ומסלוליה, הנ. ביוטכנולוגיה ומזון והוראת המדעים וקבוצה מסויימת בנפרד - לפקולטות הנדסיות. בסמסטר ב' הקורס מיועד ל: הנ. ביו-רפואית, הנ. חשמל, מדעי המחשב, מתמטיקה וכימיה. הביולוגיה והגישה המחקרית, המים והסביבה, האבולוציה הכימית, מקרומולקולות, הדוגמה המרכזית-חומצות גרעין, שכפול, שעתוק ועבוד ר.נ.א., הצופן הגנטי והתרגום, טכנולוגיית הד.נ.א. והגנומיקה. התא הפרוקריוטי, קרום התא-מבנה ותפקוד, עקרונות המטבוליזם ומיחזור האנרגיה. יסודות הסיסטמטיקה, הטקסונומיה, והפילוגנזה. התא האאוקריוטי-אברוני התא, מחזור התא, מיטוזה ומיוזה, מהתא לרקמה, תאי גזע והתמיינות. יסודות האבולוציה.",
                    n: 0.113,
                },
            },
        },
        {
            i: 778,
            $: {
                '0': { v: '134069', n: 1 },
                '1': { v: 'ביולוגיה של ההתפתחות', n: 0.577 },
                '2': {
                    v: 'א. מורפוגנזה. יצירת תבניות הגוף. גרדיינטים ושדות מורפוגנטיים. התפתחות איברים בזבוב התסיסה מהעובר ועד הבוגר. מורפוגנים, גני-על, וגנים הומיאוטיים. הבסיס המולקולרי לקביעת הצירים בעוברי הנמטודה, העוף, והעכבר. תפקיד אינטראקציות תא-תא ואפופטוזיס בהתפתחות. ב. דיפרנציאציה ויצירת איברים. זיהוי ובידוד גנים הקשורים להתפתחות. הבקרה על ביטוי גנים בהתפתחות. רגנרציה. קביעת גודל התא, דטרמינציה ודיפרנציאציה. יצירת אברי המין בנמטודה, העין בזבוב התסיסה, הכנף בעוף, האצבעות בעכבר. ג. אבולוציה והתפתחות. ממאגרי גנים דומים ליצירת אורגניזמים שונים. שינויים אבולוציוניים בגנים התפתחותיים ובבקרה על ביטוי גנים.',
                    n: 0.112,
                },
            },
        },
        {
            i: 779,
            $: {
                '0': { v: '134082', n: 1 },
                '1': { v: 'ביולוגיה מולקולרית', n: 0.707 },
                '2': {
                    v: 'חומצות גרעין: אבני הבניין, מבנה הדנ"א, מבנה הכרומטין בתאים אאוקריוטיים ואריזת הדנ"א. שכפול דנ"א, תיקון ורקומבינציה- מנגנונים ואנזימים המעורבים בתהליך. תעתוק - מנגנון ואלמנטים בסיסיים בציס ובטרנס המשתתפים בתהליך (פרומוטור, רנ"א פולימרז). עיבוד ושחבור רנ"א. תרגום- הקוד הגנטי, מבנה הריבוזום, TRNA. שלבי התרגום - התחלה, הארכת החלבון וסיום.',
                    n: 0.144,
                },
            },
        },
        {
            i: 780,
            $: {
                '0': { v: '134088', n: 1 },
                '1': { v: 'מעבדה מתקדמת בביולוגיה', n: 0.577 },
                '2': {
                    v: 'מקצועות קדם: קורסים בסיסיים בהתאם לנושא העבודה. תכנון ועריכת ניסויי מעבדה עצמאיים בשטחי הביולוגיה השונים בהנחיה ישירה של חבר סגל. ההרשמה למקצוע מותנית במציאת מדריך/מנחה. מיועד לסטודנטים מתקדמים בהסמכה.',
                    n: 0.186,
                },
            },
        },
        {
            i: 781,
            $: {
                '0': { v: '134111', n: 1 },
                '1': { v: 'זואולוגיה', n: 1 },
                '2': {
                    v: 'מבוא לעולם החי. חסרי חוליות - חד תאיים, תולעים שטוחות וטבעתיות, פרוקי רגלים, קווצי עור. מיתרנים וחוליתנים - מוצא ותכונות יסוד, התפתחות צירי הגוף, מערכת סינון והובלת המזון, מערכות מין ושתן, מערכת הדם. האמפיוקסוס כדוגמא. יסודות ההיסטולוגיה (טיפוסי תאים והתארגנות לרקמות). אבולוציה וקשרי מבנה-תפקוד של מערכות העיכול, המין והשתן, הנשימה ומערכת העצבים המרכזית והחושים. עקרונות ההתפתחות העוברית. אבולוציה של האינטגומנט ותוצריו - קווי ההתפתחות של קשקשים, שערות ונוצות.',
                    n: 0.121,
                },
            },
        },
        {
            i: 782,
            $: {
                '0': { v: '134113', n: 1 },
                '1': { v: 'מסלולים מטבולים', n: 0.707 },
                '2': {
                    v: 'קטבולים ואנבוליזם, המסלול המטבולי. מנגנוני בקרה הפועלים במסלולים מטבולים. תיאור המסלולים המרכזיים במטבוליזם התאי: גליקוליזה, מעגל החומצה הציטרית, זירחון חימצוני ופוטוסינטזה, מסלול הפנטוז פוספאט, גלוקונאוגנזה. מאגרי אנרגיה מטבולית: גליקוגן וחומצות שומן והבקרה ההורמונלית על יצירתם ופירוקם. מטבוליזם במצבי עקה: רעב ומחלת הסוכרת. המטבוליזם של פוספוליפידים, כולסטרול, חומצות אמינו ונוקלאוטידים. אינטגרציה של המטבוליזם התאי.',
                    n: 0.137,
                },
            },
        },
        {
            i: 783,
            $: {
                '0': { v: '134127', n: 1 },
                '1': { v: 'נושאים בביולוגיה', n: 0.707 },
                '2': {
                    v: 'מיועד ל: כימיה, הנ. כימית, הנ. חומרים, הנ. מכונות. השאר על בסיס מקום פנוי. הקורס מקנה עקרונות יסוד ונושאים נבחרים בביולוגיה מודרנית. הגדרת המושג חיים. התא כיחידה הבסיסית של האורגניזם החי. החומרים הנושאים האינפורמציה הגנטית ובונים את התא. יסודות המטבוליזם התאי. דוגמאות לתפקוד מערכות פיזיולוגיות בתאים ובאורגניזמים מורכבים. הקוד הגנטי ויצירת חלבונים, יסודות התורשה, הנדסה גנטית, הגנום האנושי, הנדסה גנטית ושימושיה, שיבוט חיות, ריפוי בהנדסה גנטית, תאי גזע.',
                    n: 0.121,
                },
            },
        },
        {
            i: 784,
            $: {
                '0': { v: '134134', n: 1 },
                '1': { v: 'מעבדה בעולם החי', n: 0.577 },
                '2': {
                    v: 'הקורס כולל מעבדות בנושאים הבאים: מיקרוסקופיה, חד-תאיים, תולעים שטוחות ותולעים טבעתיות, פרוקי-רגליים, קווצי-עור, מיתרניים- אמפיוקסוס וצמד, אנטומיה של חולייתנים (כריש, דו-חיים, עוף ויונק) ולימוד מעשי של קשרי מבנה-תפקוד של מערכות הגוף, התפתחות עוברית, היסטולוגיה של סחוס ועצם, התאמות אבולוציוניות לתנועה בקבוצות שונות של בעלי-חיים. המעבדות ילוו בחתכים היסטולוגיים של המערכות השונות בקבוצות בעלי החיים השונות.',
                    n: 0.135,
                },
            },
        },
        {
            i: 785,
            $: {
                '0': { v: '134140', n: 1 },
                '1': { v: 'יוביקוויטין ומחזור חלבונים', n: 0.577 },
                '2': {
                    v: 'בקרה ביולוגית של מסלולים תאיים על ידי מערכת היוביקוויטין- פרוטאזום לפירוק חלבונים בררני. כיצד סימון על-ידי יוביקוויטין או מולקולות דמויי יוביקוויטין משנה זיהוי חלבונים, אינטראקציות וגורל. מרכיבי המערכת, מבנם ואופן פעולתם, מנגנון הפרוטאזום: מכונה ביולוגית תלוית אנרגיה. מעורבות בוויסות שעתוק, שלמות הגנום, בקרת מחזור התא, סרטן, מוות תאי, נוירונים, רגנרציה של נוירונים, מחלות ניווניות והתגובה החיסונית.',
                    n: 0.134,
                },
            },
        },
        {
            i: 786,
            $: {
                '0': { v: '134141', n: 1 },
                '1': { v: 'ביולוגיה חישובית', n: 0.707 },
                '2': {
                    v: 'בקורס נלמד כיצד ניתן לגשת למגוון רחב של בעיות ביולוגיות באמצעות רעיונות ומושגים מרכזיים ממדעי המחשב: אלגוריתמים ברשתות ביולוגיות, אנליזת רצפים ביולוגיים, ניתוח רשימות נתונים, עיבוד תמונות ביולוגיות, סימולציה של מערכות דינמיות ועוד. זהו לא קורס תכנות, אך נלמד כמה שיעורי בסיס בשפת התכנות הפופולרית פייתון ונשתמש בה במהלך הקורס.',
                    n: 0.141,
                },
            },
        },
        {
            i: 787,
            $: {
                '0': { v: '134142', n: 1 },
                '1': { v: 'מעבדה בגנטיקה מולקולרית', n: 0.577 },
                '2': {
                    v: "הקורס מקנה הבנת עקרונות גנטיים דרך ניסוי מעבדה. הקורס ילמד שיטות בגנטיקה קלסית ומולקולארית וישתמש במגוון מערכות מודל כגון: זבוב הפירות דרוזופילה, שמרים, חיידקים ובקטריופג'ים. נושאי המעבדה הם: אנליזה גנטית של דגמי הורשה - הורשה אוטוזומלית ותאחיזה למין, רקומבינציה מיוטית, קומפלימנטציה, בקרה על ביטוי גנים, מהות המוטציה, גנטיקה של אוכלוסיות, ושימוש בשיטות מולקולארית לבחינת מוטנטים (הפקת DNA, הרצה בג'ל, ו- PCR).",
                    n: 0.128,
                },
            },
        },
        {
            i: 788,
            $: {
                '0': { v: '134147', n: 1 },
                '1': { v: 'מטבוליזם ומחלות באדם', n: 0.577 },
                '2': {
                    v: 'קורס זה יעסוק באינטראקציות המטבוליות בין שריר, כבד ורקמת שומן באדם בריא ובמצבים פתולוגיים. כמו כן, נדון במנגנונים התורמים לפתולוגיה ובפקטורים בעלי תפקיד מפתח שיכולים להוות מטרה תיראפויטית אטרקטיבית. הקורס יתמקד במטבוליזם של סוכרים, שומנים וחלבונים במצבים של שובע, רעב, סכרת, השמנת יתר והיפרליפידמיה, ובמנגנוני אטרופיה והיחלשות של שרירים המאפיינים את המחלות השונות.',
                    n: 0.137,
                },
            },
        },
        {
            i: 789,
            $: {
                '0': { v: '134154', n: 1 },
                '1': { v: 'ביוסטטיסטיקה  לביולוגים', n: 0.707 },
                '2': {
                    v: 'בקורס זה יוצגו שיטות סטטיסטיות לניתוח נתונים ולהסקה סטטיסטית, תוך התנסות בעיבוד סטטיסטי של נתונים באמצעות תוכנת SPSS. הנושאים הכלולים בקורס הינם: תיאור נתונים באופן גרפי, חישוב מדדי מרכז ופיזור, מבחני השערה סטטיסטיים, אמידת פרמטרים לא ידועים באוכלוסייה באמצעות רווחי סמך, בחינת קשרים בין משתנים קטגורים וכמותיים, התאמת מודלים של רגרסיה לינארית, ניתוח שונות חד גורמי, משתנים מקריים, התפלגות בינומית, הסתברות מותנית.',
                    n: 0.127,
                },
            },
        },
        {
            i: 790,
            $: {
                '0': { v: '134155', n: 1 },
                '1': { v: 'אנדוקרינולוגיה', n: 1 },
                '2': {
                    v: 'מבוא: מה עושים הורמונים ומה היא המערכת האנדוקרינית. סוגים של הורמונים ורצפטורים, ומנגנוני ההשפעה שלהם. בקרה על פעילות הורמונאלית והמערכת האנדוקרינית. ההיפופיזה - בלוטה מרכזית במערכת האנדוקרינית. הבקרה האנדוקרינית על גדילה. בלוטת המגן. תפקידי המערכת האנדוקרינית ברבייה. בלוטת האדרנל וסטראוידוגנזה. הלבלב וסוכרת.',
                    n: 0.154,
                },
            },
        },
        {
            i: 791,
            $: {
                '0': { v: '134156', n: 1 },
                '1': { v: 'ביופיסיקה מולקולרית', n: 0.707 },
                '2': {
                    v: 'מבוא לעקרונות הפיסיקליים בדינמיקה התוך תאית. שיווי משקל מכאני וכימי בהקשר הביולוגי. תהליכיים אנטרופיים מרכזיים בתא. הליכת אקראי ומודלים למבנה של ביומולקולות. שיטות למניפולציות חד-מולקולריות ושימושיהן. דיפוזיה וחיכוך. החיים במספר ריינולדס נמוך. אנזימים פרוססיביים כמנועים מולקולריים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 792,
            $: {
                '0': { v: '134158', n: 1 },
                '1': { v: 'שיטות בביואינפורמטיקה למדעי החיים', n: 0.5 },
                '2': {
                    v: 'בקורס ילמדו כלים מרכזיים בביואינפורמטיקה, דרכי גישה למאגרים של נתוני ענק בתחומי הביולוגיה והרפואה וגישות מתקדמות לניתוחם. יושם דגש על הכרה ושימוש של כלים קיימים בביואינפורמטיקה לפתרון בעיות בביולוגיה מולקולרית מודרנית. בקורס ילמדו דרכי ייצוג ואחזור רצפי חומצות גרעין וחלבונים מנתוני רצוף, ניבוי מבני של מולקולות ביולוגיות וניתוח רשתות ביולוגיות.',
                    n: 0.141,
                },
            },
        },
        {
            i: 793,
            $: {
                '0': { v: '136042', n: 1 },
                '1': { v: 'מודלים בביולוגיה', n: 0.707 },
                '2': {
                    v: 'הקורס יסקור שיטות חישוביות למידול של תהליכים ומערכות ביולוגיות דינמיות על ידי הצגה של מודלים קלאסיים וחקר דוגמאות לבעיות מידול של מערכות ספציפיות. הקורס יתבסס על עבודה והתנסות מעשית. כל המודלים ימומשו במטלב. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. הכרות עם שיטות מידול שונות למערכות ביולוגיות. 2. שימוש במטלב לחישוב אינטראקטיבי, מימוש מודלים בקוד והצגה גרפית. 3. פתרון מערכות של משוואות דיפרנציאליות רגילות בעזרת מטלב.',
                    n: 0.122,
                },
            },
        },
        {
            i: 794,
            $: {
                '0': { v: '136088', n: 1 },
                '1': { v: 'גנטיקה מולקולרית של האדם', n: 0.5 },
                '2': {
                    v: 'היבטים מולקולרים בגנטיקה של האדם, בעיקר במחלות תורשתיות שונות. מחלות שבתאחיזה לכרומוזום X, מחלות הקשורות לתופעת ה- IMPRINTING, להרחבה של TRINUCLEOTIDE REPEATS, מחלות מולטיפקטוריאליות, מיטוכונדריאליות, מטבוליות וממאירות. כמו כן ידונו: גנטיקה של התנהגות, הפרעות בהתפתחות עוברית, קביעת מין וטכניקות מולקולריות למיפוי ולשיבוט גנים ואיבחון מחלות גנטיות.',
                    n: 0.147,
                },
            },
        },
        {
            i: 795,
            $: {
                '0': { v: '136105', n: 1 },
                '1': { v: 'ביולוגיה של ההתפתחות', n: 0.577 },
                '2': {
                    v: 'הקדמה. גמטוגנזה. CLEAVAGE ורב-תאיות. גסטרולוציה. נוירולציה, אקטודרמיט, מזודרמיס ואנדודרמיס. קיבוע כוונים התפתחותיים ע"י הציטופלסמה והגרעין. יחסי גומלין בין תאים ורקמות בהתפתחות. בקרה התפתחותית על התבטאות גנים. בקרה ברמת השעתוק, העבוד והתרגום, קשרי גומלין בין תאים. יצירת תבניות וצורות. הורמונים ותפקידם בהתפתחות. התפתחות עובר הדרוזופילה. קביעת מין, אבולוציה והתפתחות.',
                    n: 0.144,
                },
            },
        },
        {
            i: 796,
            $: {
                '0': { v: '138000', n: 1 },
                '1': { v: 'ממחקר בסיסי לסביבת העבודה בביוטק', n: 0.447 },
                '2': {
                    v: "הצגת עקרונות העומדים בבסיס יישומו של רעיון המתחיל במעבדה וממשיך לשלב פיתוח מוצר בפרמצבטיקה, מכשור רפואי ותעשיות ביוטכנולוגיות. נתאר ונדגים גישות מחקריות שונות המכוונות לפיתוח יישומי. ננגיש את סביבת העבודה בביוטק וחברות פארמה בישראל, מחברות הזנק לחברות גדולות. נציג את התפקיד של ארגונים תומכים כמו חממות, משקיעים, מרכזים רפואיים וכו'. תוצאות למידה: הסטודנטים מצופים להבין את השלבים הדרושים להפיכת רעיון ממחקר בתחום מדעי החיים למוצר מאושר, הגישות השונות לפיתוח מוצר ביו-רפואי, ואת התפקיד של הארגונים השונים לאורך הדרך. הם גם יכירו את סביבת העבודה של הביוטק הישראלי.",
                    n: 0.107,
                },
            },
        },
        {
            i: 797,
            $: {
                '0': { v: '138002', n: 1 },
                '1': { v: 'הבסיס המולקולרי של מחלת הסרטן', n: 0.447 },
                '2': {
                    v: 'בקורס יסקרו השינויים המולקולריים המביאים לטרנספורמציה סרטנית של תאים. הקורס יעסוק גם בהתפתחות גידולים סרטניים, ובגנים המבקרים בתהליכים כגון שליחת גרורות ופולשנות של תאים סרטניים. כמו כן יעסוק הקורס בסיבות להתפתחות עמידות לתרופות של גידולים סרטניים, ובגישות מולקולריות חדישות לריפוי סרטן.',
                    n: 0.156,
                },
            },
        },
        {
            i: 798,
            $: {
                '0': { v: '138012', n: 1 },
                '1': { v: 'עריכה גנטית', n: 0.707 },
                '2': {
                    v: 'עריכה גנטית משנה במהירות תחומים רבים בביולוגיה בחקלאות וברפואה. מטרת הקורס הוא להכיר מגוון שיטות מבוססות על SAC-PRSIRC. בקורס נלמד כיצד ניתן ליישם שיטות שונות על עריכה גנטית במערכות ביולוגיות מגוונות. נבחן לעומק את השיקולים בתכנון של ניסוי עריכה גנטית, נכיר את המגבלות של השיטות השונות ונדון באלטרנטיביות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לתכנון ניסוי IK-OKRPSIRC_במודלים שונים, תוך הבנת המגבלות, הביקורות והגישות האלטרנטיביות. 2. להכיר שיטות מתקדמות המבוססות 9SAC-RPSIRC כולל LLEC-ELGNIS, CIPYTONEHP DNA GINNEERCS-RPSIRC. 3. להכיר את ארגז הכלים המבוסס על 9SACD ליישומי RPSIRC החורגים מהעתק- הדבק (EROM DNE ECNECSEROLF, GNITIDE ESAB, I/ARPSIRC).',
                    n: 0.102,
                },
            },
        },
        {
            i: 799,
            $: {
                '0': { v: '138021', n: 1 },
                '1': { v: 'מכונות ביולוגיות', n: 0.707 },
                '2': {
                    v: 'תפקידם של קומפלקסים מורכבים בתהליכים צורכי אנרגיה בתא. מנגנון הפעולה של מנועים ביולוגיים: הדרכים לתרגם אנרגיה כימית ע"י הידרוליזה של ATP לפעולה מכנית. שינויי קונפורמציה תלויי אנרגיה היכולים לבקר תהליכים ביולוגיים. סקירת מכונות ביולוגיות המשתתפות לדוגמא : ברפליקציה של DNA התכווצות שרירים, הסעת אורגנלים, מעבר ממברנלי, קיפול חלבונים, ודגרדציה של חלבונים.',
                    n: 0.14,
                },
            },
        },
        {
            i: 800,
            $: {
                '0': { v: '138034', n: 1 },
                '1': { v: 'התגובה התאית לנזקים ב-דנ"א', n: 0.5 },
                '2': {
                    v: 'נושאים: המנגנונים המולקולרים המתרחשים לאחר היווצרות נזק ל-דנ"א תוך הדגשים על ההיבטים הבאים: חישת הנזק ב-דנ"א ואתחול תהליך התגובה לנזק, שינויים במחזור התא כתגובה לנזק, שינויים אפגינטיים וחשיבותם בגילוי ותיקון הנזק, מנגנונים מולקולרים, שבר דו-גדילי ב-דנ"א, התפקיד התאי של חלבוני 2BRCA/1BRCA ומעורבותם בהיווצרות וריפוי מחלת הסרטן.',
                    n: 0.147,
                },
            },
        },
        {
            i: 801,
            $: {
                '0': { v: '138039', n: 1 },
                '1': { v: 'תפקוד ומבנה חלבונים', n: 0.577 },
                '2': {
                    v: 'מבנה ותפקוד של חלבונים, שיטות לבידוד ולהפרדת חלבונים טבעיים ומהונדסים גנטית, קביעת רצף, כימות ואנליזה של שינויים לאחר תרגום בחלבונים, אינטרקציות בין חלבונים ועם ליגנדים אחרים, קביעת מבנה תלת- ממדי של חלבונים, מנגנון פעילות של אנזימים ודרכים לעיכובם, קינטיקה אנזימטית. תוצאות למידה: בסיום הקורס הסטודנט ידע 1. לבודד חלבונים ואנזימים בשיטות ביוכימיות מתקדמות. 2. לאפיין פרמטרים ולקבוע את מבנם של חלבונים בעזרת קריסטלוגרפיה ודיפרקציה של קרני X. 3. לזהות את מגוון החלבונים השונים בעזרת אלקטרופוריזה, כרומטוגרפיה וספקטרומטריית מסות.',
                    n: 0.113,
                },
            },
        },
        {
            i: 802,
            $: {
                '0': { v: '138047', n: 1 },
                '1': { v: 'מדעי הנתונים הגנומיים', n: 0.577 },
                '2': {
                    v: 'קורס יציג בפני הסטודנטים תכנות ביואינפורמטי מודרני, כולל גישה למידע גנומי ממאגרים ציבוריים וביצוע ניתוחים מתקדמים על המידע. במהלך הקורס התלמידים יתנסו בניתוח סוגים שונים של מידע גנומי, כולל ביטוי גנים, אפיגנטיקה ונתונים ברמת התא הבודד, תוך למידת נושאים בסטטיסטיקה, למידת מכונה, ויזואליזציה והדירות של אנליזות._ __תוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n. לכתוב קוד ב-R ולהשתמש בספריות שונות לביצוע ניתוחים מתקדמים._\n2. להוריד מידע גנומי מסוגים שונים ממאגרים ציבוריים, להריץ תהליך ניתוח שלם, ולהפיק ממנו תובנות.____\n3. להשתמש בכלים סטטיסטיים כדי להפיק תובנות בעלות משמעות מבחינה מדעית.',
                    n: 0.107,
                },
            },
        },
        {
            i: 803,
            $: {
                '0': { v: '138049', n: 1 },
                '1': { v: 'שיטות מיקרוסקופיה במדעי החיים', n: 0.5 },
                '2': {
                    v: 'הכרת שיטות מיקרוסקופיית אור מתקדמות במחקר במדעי החיים, כולל הבנה מרחיבה של הטכנולוגיה והיישומים. הבנת קונספטים בסיסיים באופטיקה, בפלורוסנציה ובאנליזה ועיבוד תמונות. כפן משלים, יסקרו מגוון שיטות לסימון של מולקולות שונות (NIETORP ,ANR ,AND) לצורך זיהוי פלורסנטי בתא חי, בדגש על דוגמאות נבחרות ממחקרים עדכניים ברזולוציית ה-ELGNIS ELUCELOM. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1.להסביר ולפרש כיצד עובד מיקרוסקופ ולהפעיל באופן עצמאי את המיקרוסקופיים האופטיים לטובת מחקרו. 2. לתכנן ולבצע ניסויי הדמייה בביולוגיה של התא תוך הבנת כל הגורמים המשפיעים הן על הכנת הדוגמא והן על תהליך ההדמייה. 3.להשוות בין שיטות שונות לצביעת תאים והדמייתם תחת מיקרוסקופ ולהעריך איזה שיטה טובה יותר למחקרו. 4.להשוות בין שיטות מתקדמות של מיקרוסקופיה אופטית ולהעריך איזה שיטה טובה יותר למחקרו. 5. לנתח את התוצאות שהתקבלו מהמיקרוסקופיים בעזרת תוכנות אנליזה מתקדמות.',
                    n: 0.089,
                },
            },
        },
        {
            i: 804,
            $: {
                '0': { v: '138060', n: 1 },
                '1': { v: 'עבודת מחקר 1', n: 0.577 },
                '2': {
                    v: 'עבודת מחקר בנושא ספציפי באחד מן השטחים הבאים: ביוכימיה, ביולוגיה מולקורית, גנטיקה, ביולוגיה של התא, בוטניקה, זואולוגיה ואקולוגיה. עבודת המחקר תכלול לימוד שיטות מעבדה מתקדמות, תכנון ניסויים וסיכומם בצורה הנהוגה בספרות המדעית.',
                    n: 0.177,
                },
            },
        },
        {
            i: 805,
            $: {
                '0': { v: '138061', n: 1 },
                '1': { v: 'עבודת מחקר 2', n: 0.577 },
                '2': {
                    v: 'עבודת מחקר בנושא ספציפי באחד מן השטחים הבאים: ביוכימיה, ביולוגיה מולקולרית, גנטיקה, ביולוגיה של התא, בוטניקה, זואולוגיה ואקולוגיה. עבודת המחקר תכלול לימוד שיטות מעבדה מתקדמות, תכנון ניסויים וסיכומם בצורה הנהוגה בספרות המדעית.',
                    n: 0.177,
                },
            },
        },
        {
            i: 806,
            $: {
                '0': { v: '138083', n: 1 },
                '1': { v: 'נושאים עדכניים בביולוגיה 1', n: 0.5 },
                '2': {
                    v: 'הרצאות על מחקרים חדישים בביוכימיה, ביופיזיקה, ביולוגיה מולקולרית, אימונולוגיה, ביולוגיה של התא, גנטיקה, ביואינפורמטיקה ועוד. כל סטודנט יתבקש להגיש עבודה בסוף הסמסטר, ובה יסוכם אחד המחקרים שנדונו בקורס על ידי כתיבת מאמר דעה, פרספקטיבה או פרשנות בהיקף של 6-4 עמודים, שיכלול תקציר מדעי, הקדמה, גוף המאמר, סיכום וביבילוגרפיה. הנוכחות חובה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לעקוב ולהבין אחרי הרצאה מדעית ברמה גבוהה המועברת באנגלית. 2. לסכם הרצאה מדעית בצורת מאמר מדעי באנגלית.',
                    n: 0.115,
                },
            },
        },
        {
            i: 807,
            $: {
                '0': { v: '138084', n: 1 },
                '1': { v: 'נושאים עדכניים בביולוגיה 2', n: 0.5 },
                '2': {
                    v: "הרצאות על מחקרים חדישים בביוכימיה, ביופיזיקה, ביולוגיה מולקולרית, אימונולוגיה, ביולוגיה של התא, גנטיקה, גנומיקה, ביואינפורמטיקה וכו'. כל סטודנט יתבקש להגיש עבודה בסוף הסמסטר, ובה יסוכם אחד המחקרים שנדונו בקורס על ידי כתיבת מאמר דעה, פרספקטיבה או פרשנות בהיקף של 6-4 עמודים, שיכלול תקציר מדעי, הקדמה, גוף המאמר,סיכום וביבילוגרפיה. הנוכחות חובה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לעקוב ולהבין אחרי הרצאה מדעית ברמה גבוהה המועברת באנגלית. 2. לסכם הרצאה מדעית בצורת מאמר מדעי באנגלית.",
                    n: 0.115,
                },
            },
        },
        {
            i: 808,
            $: {
                '0': { v: '138085', n: 1 },
                '1': { v: 'נושאים עדכניים בביולוגיה 3', n: 0.5 },
                '2': {
                    v: "הרצאות על מחקרים חדישים בביוכימיה,ביופיזיקה, ביולוגיה מולקולרית, אימנולוגיה, ביולוגיה של התא, גנטיקה, גנומיקה, ביואינפורמטיקה וכו'. כל סטודנט יתבקש להגיש עבודה בסוף הסמסטר, ובה יסוכם אחד המחקרים שנידונו בקורס על ידי כתיבת מאמר דעה,פרספקטיבה, או פרשנות בהקף של 6-4 עמודים שיכלול תקציר מדעי, הקדמה, גוף המאמר, סיכום וביבילוגרפיה. הנוכחות חובה. תוצאות למידה:_בסיום הקורס הסטודנט יהיה מסוגל: 1. לעקוב ולהבין אחרי הרצאה מדעית ברמה הגבוהה המועברת באנגלית. 2. לסכם הרצאה מדעית בצורת מאמר מדעי באנגלית.",
                    n: 0.117,
                },
            },
        },
        {
            i: 809,
            $: {
                '0': { v: '138086', n: 1 },
                '1': { v: 'נושאים עדכניים בביולוגיה 4', n: 0.5 },
                '2': {
                    v: "הרצאות על מחקרים חדישים בביוכימיה, ביופיזיקה, ביולוגיה מולקולרית, אימנולוגיה, ביולוגיה של התא, גנטיקה, גנומיקה, ביואינפורמטיקה וכו'. כל סטודנט יתבקש להגיש עבודה בסוף הסמסטר, ובה יסוכם אחד המחקרים שנידונו בקורס על ידי כתיבת מאמר דעה, פרספקטיבה או פרשנות בהיקף של 6-4 עמודים שיכלול תקציר מדעי,הקדמה, גוף המאמר, סיכום וביבילוגרפיה. הנוכחות חובה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לעקוב ולהבין אחרי הרצאה מדעית ברמה גבוהה המועברת באנגלית. 2. לסכם הרצאה מדעית בצורת מאמר מדעי באנגלית.",
                    n: 0.115,
                },
            },
        },
        {
            i: 810,
            $: {
                '0': { v: '196012', n: 1 },
                '1': { v: 'שיטות אנליטיות במיש. דיפ.', n: 0.5 },
                '2': {
                    v: "יש ללמוד כקדם או בצמוד לקורס זה את אחד מצמדי המקצועות הבאים: ( 104220 + 104215 ) או ( 104228 + 104215 ) או ( 104223 + 104221 ) או ( 104122 ו - 104030 )._\nטורי פורייה מוכללים ובעית שטורם-ליוביל. בעיות צמודות ולא צמודות לעצמן. מש' האלטרנטיבה של פרדהולם. פונקציות גרין ושימושים. משוואות בסל ולז'נד. פתרונות של משוואות דיפרנציאליות חלקיות בעזרת שיטות התמרה (פורייה ולפלס).\nתוצאות למידה:\nבסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. לקבל תנאי פתירות למשוואה רגילה אי-הומוגנית עם תנאי שפה.\n2. לקבל ולהשתמש בפונקצית גרין למשוואות רגילות וחלקיות.\n3. לקבל פתרונות למשוואות חלקיות בעזרת טורי פורייה מוכללים תוך שימוש בפונקציות מיוחדות והכרת תכונותיהן.\n4. לקבל פתרונות למשוואות רגילות וחלקיות בעזרת התמרות אינטגרליות, תוך שימוש בפונקציות מיוחדות.",
                    n: 0.094,
                },
            },
        },
        {
            i: 811,
            $: {
                '0': { v: '196013', n: 1 },
                '1': { v: 'אנליזה נומרית', n: 0.707 },
                '2': {
                    v: '1. אלגברה ליניארית נומרית: פירוק ערכים סינגולריים, קירוב ריבועים מינימליים, פירוק QR, בעיות ערכים-עצמיים ואלגוריתם QR 2. התמרת פורייה דיסקרטית והתמרת פורייה מהירה. 3. שיטות נומריות למד"ר: בעיות התחלה, שיטות חד-צעדיות ורב-צעדיות, שיטות רונגה-קוטה, עקביות יציבות ודיוק סכמות. תוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל: 1. שימוש באלגוריתמים לפתרון בעיות ריבועים מינימליים ולפתרון בעיות ערכים עצמיים. 2. שימוש בשיטות ספקטרליות לפתרון בעיות שפה. 3. פיתוח או בחירת שיטה נומרית מתאימה לפתרון מד"ר נתון. 4. ניתוח דיוק ויציבות של שיטה נומרית נתונה לפתרון מד"ר.',
                    n: 0.11,
                },
            },
        },
        {
            i: 812,
            $: {
                '0': { v: '197009', n: 1 },
                '1': { v: 'נושאים נבחרים במתמטיקה שימושית 2', n: 0.447 },
                '2': {
                    v: 'נושאים מתקדמים במתמטיקה שימושית אשר יקבעו מחדש בכל פעם שהקורס יוצע.',
                    n: 0.302,
                },
            },
        },
        {
            i: 813,
            $: {
                '0': { v: '198014', n: 1 },
                '1': { v: 'נושאים נבחרים במתמטיקה שימושית 5', n: 0.447 },
                '2': {
                    v: 'במסגרת הקורס יחשפו הסטודנטים לשימושים של כלים ושיטות מתמטיות מתקדמות בבעיות בחזית המחקר במדעים מדויקים, הנדסה ומדעי החיים. כל הרצאה תינתן על ידי חוקר מדיספלינה שונה. בסוף הקורס יכתבו הסטודנטים עבודה המנתחת את האספקטים המתמטיים במאמרים מדעיים על אחת מבעיות המחקר שהוצגו במהלך הקורס. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להכיר מגוון גישות מתמטיות המשמשות במדעים מדויקים, הנדסה ומדעי החיים ברמה המאפשרת יישום מעשי של גישות אלו. 2. להכיר את בעיות המחקר המוצגות בקורס בדגש על האספקטים הקשורים בשילוב כלים מתמטיים עם תופעות ניסיוניות.',
                    n: 0.108,
                },
            },
        },
        {
            i: 814,
            $: {
                '0': { v: '203015', n: 1 },
                '1': { v: 'בחינת קבלה לאדריכלות נוף', n: 0.5 },
            },
        },
        {
            i: 815,
            $: {
                '0': { v: '204000', n: 1 },
                '1': { v: 'מבוא לאדריכלות נוף', n: 0.577 },
                '2': {
                    v: 'דיון בתפיסות ובדילמות מרכזיות באדריכלות נוף והשקה עם תחומי ידע אחרים, היכרות ראשונית עם אדריכלי נוף בארץ ובעולם, חשיפה לנושאים ולכלים הייחודיים של אדריכלי נוף בעיצוב סביבות חדשות, בשימור ובשיקום סביבות קיימות.',
                    n: 0.177,
                },
            },
        },
        {
            i: 816,
            $: {
                '0': { v: '204005', n: 1 },
                '1': { v: 'מבנה ופרטי גן 1', n: 0.5 },
                '2': {
                    v: "הקורס עוסק בעיצוב טופוגרפי בפיתוח אתר. חומר ההרצאות והתרגילים יקנה היכרות בסיסית עם תצורות ומבני קרקע, והבנת אופני ההשתנות של פני הקרקע כתוצאה מהכוחות הפועלים עליה כמו נגר, רוח, שחיקה וכו'. מיפוי,_עיצוב וביטוי הנדסי של שינויים טופוגרפיים לרבות תכנון משטחים, קירות תמך, דרכים וטרסות, והכנת עבודות עפר.",
                    n: 0.146,
                },
            },
        },
        {
            i: 817,
            $: {
                '0': { v: '204007', n: 1 },
                '1': { v: 'צמחיה בנוף 3', n: 0.577 },
                '2': {
                    v: 'הסטודנטים ילמדו על צמחיה כחלק מתפישה תכנונית לעיצוב ולשיקום המרחב הפתוח. הדגשת התפקידים, האסתטיים, החוויתיים, הפונקציונליים, האקולוגיים וההנדסיים של הצומח. הסטודנטים ילמדו לגבש תכנית אב והגדרת עקרונות תכנון לצמחייה בקנ"מ רחב אזורי וארצי ובתפקודים שונים. הכנת תכניות צמחייה מפורטות, בק"מ משתנה, כולל רשימות צמחים והנחיות תחזוקה.',
                    n: 0.147,
                },
            },
        },
        {
            i: 818,
            $: {
                '0': { v: '204061', n: 1 },
                '1': { v: 'תכנון נוף 20', n: 0.577 },
                '2': {
                    v: 'בקורס יקנה כלים ויכולת התמודדות עם תכנון ועיצוב אתר במרחב אורבני קיים, בראייה רחבה של הקונטקסט והסביבה העירונית. הסטודיו ייבנה בשלבים מתוכנית אב לבניית פרוגרמה לעיצוב מרחב נבחר ויכלול הוספה והתערבות במבנים קיימים, ארגון תנועת הולכי-הרגל ורכב, נגר, אי החום העירוני, חומריות, ועוד.',
                    n: 0.152,
                },
            },
        },
        {
            i: 819,
            $: {
                '0': { v: '204063', n: 1 },
                '1': { v: 'תכנון נוף 40', n: 0.577 },
                '2': {
                    v: 'תכנון שטחים פתוחים במרחב עירוני/כפרי בדגש על הכרת המרכיבים השונים של המערכת, תפקידיהם והקשרים למרחב התכנון והקהילה. הפרויקט יכלול הכנת תוכניות בהתאמה לצרכים תוך התחשבות בקונטקסט פוליטי, סביבתי, חברתי, תרבותי ונופי.',
                    n: 0.18,
                },
            },
        },
        {
            i: 820,
            $: {
                '0': { v: '204065', n: 1 },
                '1': { v: 'תכנון נוף 60', n: 0.577 },
                '2': {
                    v: 'ניתוח פיזי וטבעי של הנוף בקנה מידה אזורי תוך שימוש בצורה הטבעית והבנויה של האתר כבסיס לפיתוח ולשימור. התרגיל יכלול ניתוח מערכות טבעיות של אזור נתון, הערכת משאביו מבחינת התאמתם ורגישותם לשימושי קרקע נבחרים והכנת תכנית שימושי קרקע ראשונית לאזור.',
                    n: 0.158,
                },
            },
        },
        {
            i: 821,
            $: {
                '0': { v: '204090', n: 1 },
                '1': { v: 'תולדות אדריכלות נוף 1', n: 0.5 },
                '2': {
                    v: 'התפתחות אדריכלות נוף מהזמן העתיק ועד הבארוק הצרפתי. לימוד נופים, פארקים וגנים תוך בחינת ההיבטים התיאורטיים וההיסטוריים של התקופה וניתוח דוגמאות מייצגות.',
                    n: 0.213,
                },
            },
        },
        {
            i: 822,
            $: {
                '0': { v: '204204', n: 1 },
                '1': { v: 'מבוא למערכות מידע גיאוגרפי', n: 0.5 },
                '2': {
                    v: 'הכרות תיאורטית והתנסות מעשית עם מערכת מידע גיאוגרפי GIS - בהקשר לתחומי הכשרתם. התרגול יתבצע בסביבה של ARCGIS .נושאים עיקריים: שיטות ייצוג ותשאול מידע מרחבי, פונקציות ניתוח מרחביות, קרטוגרפיה ממוחשבת, קליטה ובנית מסד נתונים, שימוש בטכנולוגית GPS.',
                    n: 0.164,
                },
            },
        },
        {
            i: 823,
            $: {
                '0': { v: '204611', n: 1 },
                '1': { v: "צמחיה בנוף 4: תכנון צ' במרחב פתוח", n: 0.378 },
                '2': {
                    v: 'תכנון צמחיה כחלק מפיתוח ושיקום המרחב האזורי והארצי. הדגשת התפקידים האגרו טכניים, ההנדסיים, האסתטיים, הפונקציונליים והאקולוגיים של הצומח. יצירת תכניות אב לצמחייה לשטחי תעשיה, יער, נופש, אזורים פגועים, פארקים מטרופולינים, צידי דרכים ותשתיות. הגדרת עקרונות תכנון, הכנת תכניות צמחייה בק"מ משתנה, בחירת רשימות צמחים רלוונטיות, הנחיות תחזוקה ומפרט טכני ראשוני.',
                    n: 0.141,
                },
            },
        },
        {
            i: 824,
            $: {
                '0': { v: '204624', n: 1 },
                '1': { v: 'תכנון נוף 50', n: 0.577 },
                '2': {
                    v: 'תכנון פיסי מפורט של יחידת שטח עד 2500 דונם, תוך שימת הדגש על ערכי טבע, נוף ומורשת כקריטריונים בפתרון הפיזי. הקורס יכלול ניתוח פוטנציאל ופגיעות נוף האתר, הערכת השטח ליעודים השונים, פיתוח חלופות לתכנית אב ותכנון מפורט של מתחם בשטח.',
                    n: 0.158,
                },
            },
        },
        {
            i: 825,
            $: {
                '0': { v: '204625', n: 1 },
                '1': { v: 'תכנון נוף 60', n: 0.577 },
                '2': {
                    v: 'ניתוח פיזי וטבעי של הנוף בקנה מידה אזורי תוך שימוש בצורה הטבעית והבנויה של האתר כבסיס לפיתוח ולשימור. התרגיל יכלול ניתוח מערכות טבעיות של אזור נתון, הערכת משאביו מבחינת התאמתם ורגישותם לשימושי קרקע נבחרים והכנת תכנית שימושי קרקע ראשונית לאזור.',
                    n: 0.158,
                },
            },
        },
        {
            i: 826,
            $: {
                '0': { v: '204626', n: 1 },
                '1': { v: 'אדריכלות נוף חוקרת', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס לאפשר לסטודנט לפתח כלים היסטוריים ותיאורטיים ומיומנויות טקסטואליות ומחקריות בזיקה לפרוייקט הגמר. על הסטודנט לזהות בעיה תכנונית, להכין סקירה תיאורטית על הנושא הנבחר, ולנתח את מרכיביו.',
                    n: 0.189,
                },
            },
        },
        {
            i: 827,
            $: {
                '0': { v: '204627', n: 1 },
                '1': { v: 'תכנון נוף 70', n: 0.577 },
                '2': {
                    v: "שלב זה, כהמשך לתכנון נוף 70 א', הוא החלק השני של פרויקט הגמר, בו יפתח ויפרט הסטודנט את הפרוגרמה התכנונית, יקבע הנחיות ועקרונות תכנון, יגבש תכנית רעיונית כללית ותכניות מפורטות לנושא הנבחר. ההתייחסות בפרויקט תהיה לאלמנטים שונים הכוללים מגוון שטחים, חללים, מתקנים וחומרים, בקני מידה שונים המסבירים את עקרונות התכנון, הפתרון והתכנון המפורט.",
                    n: 0.137,
                },
            },
        },
        {
            i: 828,
            $: {
                '0': { v: '204720', n: 1 },
                '1': { v: "נושא נבחר/פר.מיוחד באדר'נוף55ב'", n: 0.577 },
                '2': {
                    v: 'הסילבוס יקבע ע"י מורה המקצוע באישור הדיקן, לפני תחילת הסמסטר בו יינתן המקצוע.',
                    n: 0.277,
                },
            },
        },
        {
            i: 829,
            $: {
                '0': { v: '204723', n: 1 },
                '1': { v: 'סיור לימודי באדריכלות נוף 2', n: 0.447 },
                '2': {
                    v: 'סיור לימודי באתרים נבחרים. לימוד היבטים היסטוריים, תרבותיים, סביבתיים ותפעוליים של האתרים. פגישה עם מתכננים ומפעילי האתרים. על המשתתפים להכין חומר רקע טרם ביקור ולהגיש עבודה מסכמת.',
                    n: 0.192,
                },
            },
        },
        {
            i: 830,
            $: {
                '0': { v: '205012', n: 1 },
                '1': { v: 'מבוא לחברה ורוח בארכיטקטורה', n: 0.5 },
                '2': {
                    v: 'הקורס ידון במסכת של סוגיות, פרקים היסטוריים ורעיונות מתחום מדעי הרוח והחברה כמבוא ללימודים בתחומים אלה בפקולטה לארכיטקטורה.',
                    n: 0.236,
                },
            },
        },
        {
            i: 831,
            $: {
                '0': { v: '205017', n: 1 },
                '1': { v: 'תולדות האדריכלות בעידן המודרני', n: 0.5 },
                '2': {
                    v: 'מקורותיה והתפתחותה של אדריכלות מודרנית. התפתחות המרחב הבנוי והפתוח המודרני משורשיו ברנסנס, המהפכה התעשייתית ועד למלחמת העולם השניה. בחינת היבטים היסטוריים ותאורטיים תוך ניתוח מבחר תנועות, ארכיטקטים ובניינים ומרחבים פתוחים משמעותיים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 832,
            $: {
                '0': { v: '205104', n: 1 },
                '1': { v: "הסט' ותיאוריה של אדר' מלח\"ע-כיום", n: 0.447 },
                '2': {
                    v: 'קביעת הציון עפ"י מעקב לאורך הסמסטר, מבחן ועבודת גמר. הקורס בוחן ההיסטוריה והתיאוריה של הדריכלות והעירוניות בתקופה שלאחר מלחמת העולם השניה ועד היום, ובעקבות השבר החברתי, המוסרי והמקצועי שהביאה. הקורס סוקר תימות מרכזיות בתיאוריות האדריכלות בת זמננו בראי התמורות החברתיות, הטכנולוגיות ואידיאולוגיות. הקורס כולל תרגילי קריאה ועבודת חקר בניתוח פרויקטים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 833,
            $: {
                '0': { v: '205257', n: 1 },
                '1': { v: 'מבוא לעיצוב ותכנון עירוני', n: 0.5 },
                '2': {
                    v: 'יכולת ניתוח ומתן מענה תכנוני למכלול מרכיבי הקונטקסט הרלוונטיים. יכולות הבנה, הכרה,הבחנה וניתוח של חללים ורקמות עירוניות. הבנת מכלול השיקולים בפתוח עירוני, לרבות חברה, סביבה, כלכלה, תשתיות, תחבורה, מרקם, היסטוריה. הכרה והבנה של התאוריות והכלים של עיצוב עירוני. יכולת הגדרה של הצרכים והמטרות בפיתוח העירוני. תכנון בר קיימא בסביבה העירונית. הצגת השלד הנופי של העיר.',
                    n: 0.135,
                },
            },
        },
        {
            i: 834,
            $: {
                '0': { v: '205304', n: 1 },
                '1': { v: "מיני סטודיו עיצוב א'", n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בעיצוב חללים וריהוט כחלק משמעותי מהתמחותו של האדריכל והשלמות באדריכלות. התנסות מעשית בפעולות עיצוב בחללים מגוונים ובקני מידה שונים. תתאפשר בחירה בין נושאים של עיצוב פנים וריהוט בחלל בנוי ועיצוב חללים וריהוט בחלל פתוח עם דגשים אפשריים על עיצוב קומפקטי, עיצוב תלוי חומר, עיצוב ניסיוני ועוד. הסטודיו ילוווה בסדרת הרצאות שישלבו הצגת תפיסות ותכנים מובילים ועדכניים בתחום, בסיס ידע טכני- טכנולוגי, שיטות עיצוב וייצור יחד עם הדגמה של עבודות מופת ויוצרים מקומיים.',
                    n: 0.116,
                },
            },
        },
        {
            i: 835,
            $: {
                '0': { v: '205427', n: 1 },
                '1': { v: 'טכנולוגיות בנייה ופרטי בניין 2', n: 0.447 },
                '2': {
                    v: 'עקרונות של מעבר וקשר מסוגים שונים בין חללי המבנה וסביבתם ובין חללים בתוך המבנה. תנועה אנכית, אופקית מדורגת ומשופעת במבנה ועם סביבתו. יושם דגש על פתחים מסוגים שונים, כולל סוגיות של שקיפות, הצללה, נעילה אבטחה ונגישות. יישום שיטות וטכנולוגיות בניה, שימוש בחומרים, תכנון ועיצוב פירטי בניין כגון: חיבורים, עיגונים בידודים ואיטומים.',
                    n: 0.14,
                },
            },
        },
        {
            i: 836,
            $: {
                '0': { v: '205458', n: 1 },
                '1': { v: 'תכן מבנים 1', n: 0.577 },
                '2': {
                    v: 'הקניית ידע בסיסי בתכן מבנים והתנהגות המערכות הסטרוקטורליות, תוך הבנת ההשלכות ההדדיות בין תכנון הנדסי ותכנון אדריכלי. דגש יינתן בנושאי יציבות, חוזק, בקשר בין צורת המבנה למאפייניו המבניים, בקשיחותו, באופן העברת הכוחות ובניצול החומר.',
                    n: 0.171,
                },
            },
        },
        {
            i: 837,
            $: {
                '0': { v: '205459', n: 1 },
                '1': { v: 'תכן מבנים 2', n: 0.577 },
                '2': {
                    v: 'עקרונות להבנת ההתנהגות הסטאטית של רכיבי מבנה ומערכות המורכבות מאלמנטים קוויים והשפעתן על התכנון האדריכלי. עיצוב צורת החתך וצורת הרכיב. שיטות אנליטיות בתכן מבנים.',
                    n: 0.204,
                },
            },
        },
        {
            i: 838,
            $: {
                '0': { v: '205501', n: 1 },
                '1': { v: 'מערכות הבניין - אור ותאורה', n: 0.447 },
                '2': {
                    v: 'תכונות מנגנון הראייה וקליטת הסביב החזותי. פילוג ההארה ומערך הצבעים בחלל המואר. האור הטבעי, תכונותיו וניצולו להארת בניינים. אור השמש הישיר, הצללה. דרישות אנוש. מקורות האור, תכונות ותחומי ניצול, גופי תאורה, מדידות וחישובים של תאורה טבעית וחשמלית. שיטות מחשב לחישוב תאורה. שילוב מאור טבעי ומלאכותי בבניינים. מאור חוץ ברחובות, ככרות, בניינים ואתרים.',
                    n: 0.139,
                },
            },
        },
        {
            i: 839,
            $: {
                '0': { v: '205510', n: 1 },
                '1': { v: 'בטיחות ונגישות במבנים וסביבתם', n: 0.5 },
                '2': {
                    v: 'האדריכל כמחולל בטיחות, בטחון ונגישות במבנה ובסביבתו. הגדרות, סיווג סיכונים, עקרונות יסוד ותחיקה. בטיחות שהייה ותנועה. בטיחות אש ומילוט: דרכי גישה וסביבת הבניין, מילוט וחילוץ, אגפי בטיחות וחללים מוגנים. עמידות אש לתת-מערכות ולחומרי בנין. אחסון חומרים דליקים, מערכות לגילוי וכיבוי. שילוט ותאורה לחירום. בטיחות בבנינים גבוהים. בנייה ביטחונית ומוגנת. דרישות משתנות של אוכלוסיות בעלות צרכים מגוונים ושוויון זכויות לאנשים עם מוגבלות. הכרת ויישום תקנות הנגישות, בטיחות או ומילוט, בטיחות המשתמש ומיגון. יכולת שיתוף פעולה עם יועצים.',
                    n: 0.115,
                },
            },
        },
        {
            i: 840,
            $: {
                '0': { v: '205542', n: 1 },
                '1': { v: 'אוריינות: מרחב וטקסט', n: 0.577 },
                '2': {
                    v: 'הקורס מקנה כלים לקריאה של המרחב באמצעות תרגול של מיומנויות קריאה בארכיטקטורה. פיתוח אוריינות בחומרים ראשוניים כולל קריאה וניתוח של המרחב (חזית, מבנה, רחוב, כיכר) וכן של ייצוגים אדריכליים (תוכניות, חתכים, חזיתות). פיתוח אוריינות בחומרים משניים כולל קריאה וניתוח של טקסטים אודות המרחב (מסמכי תכנון, טקסטים פרשניים).',
                    n: 0.146,
                },
            },
        },
        {
            i: 841,
            $: {
                '0': { v: '205543', n: 1 },
                '1': { v: 'מבוא לגיאומטריה תיאורית', n: 0.577 },
                '2': {
                    v: 'הקניית ידע תיאורטי בסיסי ופיתוח הבנה בסיסית והיכרות עם חוקי יסוד בגיאומטריה תיאורית, תשתית עיונית שיטתית בסיסית בתחום תיאור המרחב , פעולות במרחב ומציאת פתרונות לבעיות מרחביות בארכיטקטורה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 842,
            $: {
                '0': { v: '205571', n: 1 },
                '1': { v: 'כלכלת המרחב והבנייה', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק בתפקוד המשק הלאומי והעירוני ובהיבטים של מדיניות כלכלית ובשיטות ניתוח כלכלי בתהליכי תכנון אדריכלי ובנייה. הקורס כולל סוגיות כגון: הכרת מבנה משק הבנייה ותפקודו, שוק הקרקע בישראל וייחודו, היבטים של מיקום לדיור, לתעסוקה, לשירותים למוסדות ולתשתיות, מימון בנייה ופרוגרמות כלכליות, כולל הערכת ביקושים, עלויות ורווחיות, הרכב הוצאות בניין ותפעול בניינים מדגמים שונים, אב-טיפוס של ניתוח ותפעול פרוייקטים בראיה של מחזורי חיים.',
                    n: 0.126,
                },
            },
        },
        {
            i: 843,
            $: {
                '0': { v: '205574', n: 1 },
                '1': { v: 'פרויקט סטודיו 1', n: 0.577 },
                '2': {
                    v: 'הקורס מהווה מבואה לעולם המקצועי. עוסק בהקניית ארגז כלים ראשוני להכרת מושג החלל, דרך תרגילים רעיוניים ומעשיים בסוגיות חומר, צורה תפקוד וחוויה. הקורס כולל הרצאות, סיורים לימודיים, הנחייה והדרכה במהלך פיתוח התרגלים.',
                    n: 0.177,
                },
            },
        },
        {
            i: 844,
            $: {
                '0': { v: '205576', n: 1 },
                '1': { v: 'פרויקט סטודיו 3', n: 0.577 },
                '2': {
                    v: 'תכנון מבנה בהקשר סביבתי. חשיפה מובנית לחוליות מרכזיות בתהליך התכנון תך הקניית כלי חשיבה ועבודה מתוך אחריות ומחויבות לתוצאה מנומקת.',
                    n: 0.224,
                },
            },
        },
        {
            i: 845,
            $: {
                '0': { v: '205578', n: 1 },
                '1': { v: 'סטודיו נושאי:מורשת,שימור והתחדשות', n: 0.577 },
                '2': {
                    v: 'מחקר דרך תכנון: פיתוח נושא/רעיון בכלים מחקריים וארכיטקטוניים, התווית עתידו של אתר מורשת באמצעות הבנת עברו. שימוש במתודולוגיות מחקר המובילות לעמדה תכנונית ביקורתית ביחס לסוגיות עכשוויות הנוגעות להמשכיות ושינוי בסביבה ההיסטורית. הסטודיו מלווה בקורס עיוני תומך.',
                    n: 0.167,
                },
            },
        },
        {
            i: 846,
            $: {
                '0': { v: '205579', n: 1 },
                '1': { v: 'סטודיו נושאי:עיצוב ויצור ממוחשב', n: 0.5 },
                '2': {
                    v: 'מחקר דרך עיצוב ( RESEARCH BY DESIGN ): פיתוח פרוייקט אדריכלי דרך כלים ארכיטקטוניים דיגיטאליים, תוך שימוש במתודולוגיית מחקר המובילה לעמדה תכנונית, בניית עמדה ביקורתית ביחס לסוגיות עכשוויות. ושימוש בכילים מתקדמים בתכנון.',
                    n: 0.177,
                },
            },
        },
        {
            i: 847,
            $: {
                '0': { v: '205580', n: 1 },
                '1': { v: "סט' נושאי:היסטוריה,תיאוריה,ביקורת", n: 0.707 },
                '2': {
                    v: 'מחקר דרך תכנון (RESEARCH BY DESIGN): פיתוח נושא/דיון/ רעיון דרך כלים ארכיטקטוניים, תוך שימוש במתודולוגיית מחקר המובילה לעמדה תכנונית, בניית עמדה ביקורתית ביחס לסוגיות עכשוויות. בחירה מתון מגוון נושאים המוצעים במסגרת נתיב היסטוריה תיאוריה וביקורת.',
                    n: 0.169,
                },
            },
        },
        {
            i: 848,
            $: {
                '0': { v: '205581', n: 1 },
                '1': { v: 'סטודיו נושאי:אדריכלות בת-קיימא', n: 0.577 },
                '2': {
                    v: 'מחקר דרך תכנון ( RESEARCH BY DESIGN ): פיתוח נושא/דיון/רעיון דרך כלים ארכיטקטוניים, תוך שימוש במתודולוגיית מחקר המובילה לבניית עמדה תכנונית ביקורתית ביחס לסוגיות עכשוויות. הסטודיו יתמקד בנושאים עכשוויים מתחום אדריכלות בת-קיימא.',
                    n: 0.177,
                },
            },
        },
        {
            i: 849,
            $: {
                '0': { v: '205582', n: 1 },
                '1': { v: 'סטודיו נושאי: כללי', n: 0.577 },
                '2': {
                    v: 'מחקר דרך תכנון: פיתוח נושא/רעיון דרך חשיפה מובנית לכלים ארכיטקטוניים, תוך שימוש במתודולוגית מחקר המובילה לעמדה תכנונית ביקורתית ביחס לסוגיות עכשוויות ויישומה באתר ספציפי. הסטודיו מלווה בקורס עיוני תומך. תוצאות למידה: הסטודנט יהיה מסוגל להשלים תהליך של תכנון אדריכלי תוך שימוש במחקר דרך תכנון ובדגש על שימוש בכלים ארכיטקטוניים לפיתוח ביקורתי של נושאים ורעיונות. תוצרי הקורס ידגימו יכולת אינטגרציה של שיקולים כגון פרוגרמתיים, טכנולוגיים, סביבתיים ותרבותיים במערכת אדריכלית בעלת חללי פנים וחוץ עשירים ומובחנים ושפת עיצוב מגובשת.',
                    n: 0.114,
                },
            },
        },
        {
            i: 850,
            $: {
                '0': { v: '205584', n: 1 },
                '1': { v: 'אדריכלות ובריאות', n: 0.707 },
                '2': {
                    v: 'בעת חלי, שגרת היום-יום מופרת ואדם ניצב בפני אתגרים בלתי צפויים הקשורים בגוף ובנפש. מטרת הקורס הנה לחשוף את הסטודנטים לשיח הנוגע לקשר שבין אדריכלות ובריאות, תוך התמקדות ביחסי הגומלין של האדם והסביבה הפיזית. הקורס יעניק לסטודנטים כלים לקריאה ולניתוח של סביבות שבמרכזן עומדים נושאי בריאות במובנם הרחב.',
                    n: 0.144,
                },
            },
        },
        {
            i: 851,
            $: {
                '0': { v: '205598', n: 1 },
                '1': { v: "תחבורה והעיר:תכנון מכליל שכ',רחוב", n: 0.5 },
                '2': {
                    v: 'הקורס יקנה רקע וידע בסיסיים בתכנון תחבורה ודרכים במערכת העירונית. הוא יעסוק בקשרי הגומלין בין מערכת התחבורה לבין המבנה העירוני, התכנון השכונתי והשפעותיהם על הסביבה. יובאו כללי התכן, ההנחיות והתקנים העדכניים המקובלים בישראל. בין נושאי הלימוד: תכנון רחובות עירוניים וחניה, תכנון עבור הולכי רגל ורוכבי אופניים, רחובות "משולבים", תחבורה אלטרנטיבית ועוד.',
                    n: 0.14,
                },
            },
        },
        {
            i: 852,
            $: {
                '0': { v: '205622', n: 1 },
                '1': { v: "פרויקט מיוחד 3ג'", n: 0.577 },
                '2': {
                    v: "בעיה מיוחדת בתכנון ארכיטקטוני. נושא ג'.",
                    n: 0.408,
                },
            },
        },
        {
            i: 853,
            $: {
                '0': { v: '205660', n: 1 },
                '1': { v: 'תכנון כולל 8', n: 0.577 },
                '2': {
                    v: 'המשך תכנון הבעיה שטופלה במקצוע "תכנון כולל 7": פיתוח וגיבוש הפתרון הנבחר והפירוט שלו. מטרת המקצוע: יישום הידע המקצועי אשר נרכש במהלך שנות הלימוד והמתיחס בין השאר לתחומים הבאים: בחירת מערכת קונסטרוקטיבית לבניין, קביעת חומרי בנייה ופרטי בנייה מתאימים, שילוב ותיאום תת-מערכות טכניות, התייחסות לתהליך ביצוע הבנייה. הגשת המקצוע תכלול את הצגת הפתרון, ובנוסף - פיתוח קטע נבחר בקנ"מ 1:50 ותכנון מערכות מבניות ופרטי בנייה. במהלך העבודה על הסטודנט להיעזר ביועצים לתכנון מערכות הבנין. התכנון יבוצע בעבודה אינדיבידואלית. ציון על סמך מעקב במשך הסמסטר והגשת פרויקט.',
                    n: 0.108,
                },
            },
        },
        {
            i: 854,
            $: {
                '0': { v: '205813', n: 1 },
                '1': { v: 'הבעה גרפית', n: 0.707 },
                '2': {
                    v: 'הקניית יכולת בסיסית בהבעה וחשיבה גרפית בארכיטקטורה. הבעה גרפית באמצעים שונים לתאור המרחב. יכולת הבעה וחשיבה גרפית ביד חופשית וברישום ארכיטקטוני לעריכה וכיתוב, צבע, אור וצל. אמצעים וטכניקות הגשה.',
                    n: 0.186,
                },
            },
        },
        {
            i: 855,
            $: {
                '0': { v: '205873', n: 1 },
                '1': { v: 'עיצוב בסיסי 4', n: 0.577 },
                '2': {
                    v: 'המשך לעיצוב בסיסי 2 או 3 תוך עליה במורכבות הבעיה הן מבחינה מעשית והן מבחינה עיצובית.',
                    n: 0.25,
                },
            },
        },
        {
            i: 856,
            $: {
                '0': { v: '205878', n: 1 },
                '1': { v: "עיצוב בסיסי 1 א'", n: 0.5 },
                '2': {
                    v: 'הקניית מושגים בסיסיים בעיצוב תוך רכישת מיומנות באמצעי הבעה אמנותיים. נושאי ההוראה: 1. הכרת צורות וקומפוזיציות במרחב הדו ממדי והתלת ממדי. 2. פיתוח יכולות בביטוי חזותי לתכונות הפיסיקליות של גופים מצויים ושתולים במרחב קיים. 3. הכרת אמצעי הבעה מסוגים שונים מתוך האמנות הפלסטית- רישום, צילום, אמצעי הבעה תלת ממדיים, בטכניקות ובחומרים שונים. במסגרת הקורס ניתן לבחור בין סדנאות בנושאים שונים.',
                    n: 0.129,
                },
            },
        },
        {
            i: 857,
            $: {
                '0': { v: '205885', n: 1 },
                '1': { v: 'עיצוב בסיסי 3', n: 0.577 },
                '2': {
                    v: 'מטרה: הקניית כלים להתנסות בחלל. נושאי ההוראה: 1. המשך לעיצוב בסיסי 2+1 תוך הדגשה של שילוב מרכיבים עיצובים בחלל. 2. פרשנות חללית באמצעות הפשטה והסמלה. 3. הכרת מכשירי עזר להתנסות בחלל (מודלים, וידיוטייפ, הסרטה).',
                    n: 0.171,
                },
            },
        },
        {
            i: 858,
            $: {
                '0': { v: '205922', n: 1 },
                '1': { v: 'התבוננות, דיגום ויצוג 1', n: 0.5 },
                '2': {
                    v: 'היכרות עם טכנולוגיות, שיטות לייצוג המרחב ודיגום צורה אדריכלית וירטואלית ןיזית. במסגרת הקורס תסקר התפתחות הטכנולוגיות והשיטות ויוצגו באופן כללי. הכלים והשיטות העיקריים בהם נעשה שימוש בפרקטיקה תוך התמקדות בשיטות רישום, שרטוט ומידול תלת מימדי. לימוד מעמיק של כלים ושיטות נבחרות יבוצע במסגרת סדנאות המדיה.',
                    n: 0.149,
                },
            },
        },
        {
            i: 859,
            $: {
                '0': { v: '205923', n: 1 },
                '1': { v: 'התבוננות, דיגום ויצוג 2', n: 0.5 },
                '2': {
                    v: 'הרחבת ההיכרות עם טכנולוגיות ושיטות לייצוג המרחב ודיגום צורה אדריכלית באופן וירטואלי ופיזי ולימוד שיטות בסיסיות לייצור בעזרת מחשב. במסגרת הקורס תסקר התפתחות הטכנולוגיות והשיטות ויוצגו באופן כללי הכלים והשיטות העיקריים בהם נעשה שימוש בפרקטיקה תוך התמקדות בשיטות מתקדמות להבעה גרפית דו ממדית, הדמיה תלת ממדית ושיטות לסימולציה/אנימציה ארבע ממדיות. לימוד מעמיק של כלים ושיטות נבחרות יבוצע במסגרת סדנאות המדיה.',
                    n: 0.129,
                },
            },
        },
        {
            i: 860,
            $: {
                '0': { v: '206006', n: 1 },
                '1': { v: 'נושאים בארכ.-אדריכלות דיגיטלית 1', n: 0.5 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המורה, באישור ועדת לימודי תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן הקורס. סמסטר ב\' תשע"ט: ייצור רובוטי בארכיטקטורה.',
                    n: 0.204,
                },
            },
        },
        {
            i: 861,
            $: {
                '0': { v: '206007', n: 1 },
                '1': { v: 'נוש. בארכיטקטורה-אדריכלות ירוקה 1', n: 0.5 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המורה, באישור ועדת לימודי תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן הקורס. סמסטר א\' תשע"ח: מידול אנרגטי מתקדם של בניינים.\nסמסטר ב\' תשע"ח: סמינר בתכנון מבנים סולריים.\nסמסטר ב\' תשע"ט: אדריכלות ירוקה 1._',
                    n: 0.164,
                },
            },
        },
        {
            i: 862,
            $: {
                '0': { v: '206008', n: 1 },
                '1': { v: 'נושא. נבח. בארכ.-אדריכלות ירוקה 2', n: 0.447 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המורה, באישור ועדת לימודי תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן הקורס.',
                    n: 0.236,
                },
            },
        },
        {
            i: 863,
            $: {
                '0': { v: '206009', n: 1 },
                '1': { v: 'נושאים בארכ.-היסטוריה ותיאוריה 2', n: 0.5 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המורה, באישור ועדת לימודי תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן הקורס. סמסטר א\' תשע"ז: סדנא עירונית: סוגיות עכשוויות בעיצוב המרחב ההיסטורי של ירושלים.',
                    n: 0.183,
                },
            },
        },
        {
            i: 864,
            $: {
                '0': { v: '206013', n: 1 },
                '1': { v: 'סדנה טכנולוגית הנדסית 2', n: 0.5 },
                '2': {
                    v: 'הקורס יעסוק בשני נושאים: היבט התכנון ותהליך הבניה של פרויקטים אדריכליים. תינתן סדרת הרצאות הכוללות את סך תחומי התכנון והבניה העיקריים להקמת פרויקט אדריכלי בנוי. הסטודנטים יהיו מסוגלים להטמיע את הידע התיאורטי הנרכש בפרויקט הסטודיו, וירכשו יכולת לחבר טכנולוגיות בניה שונות בשלבי התכנון השונים. תוצרי למידה: בסיום הקורס הסטודנט יהיה מסוגל: לחבר את המרכיבים השונים של פרויקט אדריכלי ולהבין כיצד הידע והשליטה של האדריכל במכלול הדיסציפלינות השונות משפיע על התוצאה הסופית.',
                    n: 0.119,
                },
            },
        },
        {
            i: 865,
            $: {
                '0': { v: '206061', n: 1 },
                '1': { v: 'סטודיו נושאי מיוחד 1', n: 0.5 },
                '2': {
                    v: 'סדנה לימודית הכוללת 26 שעות סטודיו. מסגרת הוראה לאורחים לטווח קצר סמסטר א\' תש"ף: סדנת אוצרות במרחב הציבורי הלא מוזיאלי.',
                    n: 0.224,
                },
            },
        },
        {
            i: 866,
            $: {
                '0': { v: '206072', n: 1 },
                '1': { v: 'נושאים נבחרים בארכיטקטורה 6א', n: 0.5 },
                '2': {
                    v: 'סדנה לימודית הכוללת 13 שעות הרצאה. מסגרת הוראה לאורחים לטווח קצר. סמסטר ב\' תשפ"א: סדנת התנדסות במחקר אמפירי.',
                    n: 0.236,
                },
            },
        },
        {
            i: 867,
            $: {
                '0': { v: '206101', n: 1 },
                '1': { v: 'אדריכלות חוקרת', n: 0.707 },
                '2': {
                    v: 'בניית עמדה מושגית ותכנונית המאתגרת ומחדשת את העשייה הארכיטקטונית העכשווית. בניית מתודולוגיה מחקרית ותכנונית והבנת היחס בניהם, פירוט המניפסט של הפרויקט, פיתוח תזה ממחקר מפורט ועד תיאור התכנון הארכיטקטוני.',
                    n: 0.186,
                },
            },
        },
        {
            i: 868,
            $: {
                '0': { v: '206170', n: 1 },
                '1': { v: 'דיון ביקורתי בשיכון הצבורי בישראל', n: 0.447 },
                '2': {
                    v: 'בקורס נבחן הדיון הביקורתי על השיכון והתכנון הציבורי בישראל במשך שנות קיומה. הנושאים: אידיאולוגיה התיישבותית, הפער בין הממסד המיישב לבין האוכלוסייה המיושבת, משמעות המקום - בין מזרח למערב, דימוי הבית והיחס המשתנה לעירוניות. נושאים אלו נבחנים באמצעות היבטים תכנוניים וארכיטקטוניים תחומיים, כמו גם באמצעות היבטים חברתיים, תרבותיים ופוליטיים. דרישות הקורס כוללות הצגת מאמרים בכיתה וכתיבת עבודה סופית.',
                    n: 0.132,
                },
            },
        },
        {
            i: 869,
            $: {
                '0': { v: '206180', n: 1 },
                '1': { v: 'תורת הצבע', n: 0.707 },
                '2': {
                    v: 'מהות הצבע, מופעיו ותפקידיו בטבע ובתרבות. ממדי הצבע ושיטות למיון צבעים. ראיית צבעים ותפיסת צבעים. הרמוניות של צבע באמנות ובטבע.',
                    n: 0.224,
                },
            },
        },
        {
            i: 870,
            $: {
                '0': { v: '206284', n: 1 },
                '1': { v: 'עיצוב וקראפט דיגיטלי', n: 0.577 },
                '2': {
                    v: 'בקורס נלמד את יסודות התכנות בסביבות תהליכים ריינו וגרסהופר בגישה שפותחה במיוחד עבור מעצבים - בצורה ויזואלית ומוחשית, ונפיק את העיצובים באמצעות כליי יצור דיגיטליים כדוגמת מכשיר לחיתוך לייזר למדפסות תלת מימד. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להכיר את אבני הבניין של תכנות: משתנים, לולאות, פונקציות. 2. לבנות קוד פשוט, לדעת לעשות הקשר לקוד קיים. 3. להכיר את תחום המחקר שנקרא יצור חישובי, ולהכיר עבודות ופרוייקטים בתחום.',
                    n: 0.12,
                },
            },
        },
        {
            i: 871,
            $: {
                '0': { v: '206567', n: 1 },
                '1': { v: 'מערכות הבניין - בקרת הסביבה', n: 0.447 },
                '2': {
                    v: 'הכרת, הבנת ותכנון בסיסי של מערכות המבנה, ושילובן בתכנון הכולל של המבנה (לרבות תרגילי תכן). מערכות מים, ביוב וניקוז, מיזוג ואיוורור, חשמל ותאורה, אקוסטיקה, תיאו ושילוב בין מערכות הבניין השונות. הכרת ויישום עקרונות הבניה הירוקה (בנייה בת קיימא) - מותאמת אקלים וחוסכת משאבים. היבטים של חיסכון באנרגיה ומשאבים מתכלים בראיית מחזורי חיים ועקרונות הקיימות. יכולת שיתוף פעולה עם יועצים.',
                    n: 0.13,
                },
            },
        },
        {
            i: 872,
            $: {
                '0': { v: '206571', n: 1 },
                '1': { v: 'מודלים ממוחשבים לתכנון ארכיטקטוני', n: 0.5 },
                '2': {
                    v: 'סקירת תחומי הידע הממוחשב בנושאים שונים של תכנון בר-קיימא (כגון: אנרגיה, רוחות, הצללה ופריסת מבנים בשטח). מודלים ממוחשבים: ליצירה, להערכה ולאופטימיזציה. שילוב של סימולציה לתכנון בעזרת מחשב מבוסס ביצועים. מבוא ליישום כלים ממוחשבים מתקדמים לסימולציה של בניינים.',
                    n: 0.164,
                },
            },
        },
        {
            i: 873,
            $: {
                '0': { v: '206577', n: 1 },
                '1': { v: 'תכן מבנים כולל', n: 0.577 },
                '2': {
                    v: 'שילוב ואינטראקציה בין מקצועות הקונסטרוקציה והאדריכלות, תוך דגש על תכן מבנים כמכלול תלת מימדי המשתלב בתכן אדריכלי עיצובי, פונקציונאלי וערכי. צבירת מיומנויות בפתרון סוגיות סטרוקטוראליות, בבחינת חלופות ובניתוח מערכות מבניות מגוונות מההיבט ההנדסי והכלכלי. תכנון של פרויקט החל מפרוגראמה ורעיון אדריכלי ועד לקביעה של פתרון הנדסי.\nתוצאות למידה: בסיום הקורס הסטודנט: 1)יצבור ניסיון בתכנון הוליסטי בו הקונסטרוקציה מהווה גורם בעל נוכחות בתכנון האדריכלי, בו המבנה, החומרים והחלל עובדים ביחד מבחינה ארכיטקטונית וסטרוקטוראלית.\n2) ידע לעבור בין תכניות ארכיטקטוניות לקונסטרוקטיביות.\n3) יתנסה בקביעה ובתכנון מערכות סטרוקטוראליות המבטיחות יציבות מחד, אך משלימות ארכיטקטורה מאידך.\n4)יתנסה ביחסי הגומלין בין התכנון הארכיטקטוני לתכנון הקונסטרוקטיבי.',
                    n: 0.102,
                },
            },
        },
        {
            i: 874,
            $: {
                '0': { v: '206808', n: 1 },
                '1': { v: 'תיאוריות של אדריכלות דיגיטלית', n: 0.5 },
                '2': {
                    v: 'נושאים: תיאוריה ומעשה בארכיטקטורה דיגיטלית מראשית שנות ה-90 ועד ימינו. השפעת המחקר על הזהוי והגדרה של מאפיינים ארכיטקטוניים ייחודיים באדריכלות הדיגיטלית (כגון טקטוניקה, תגובתיות, דינמיות). היסודות התיאורטיים בשטחי המדע והטכנולוגיה המשפיעים על התחום, מושגים באדריכלות דיגיטלית ומקורות כתובים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 875,
            $: {
                '0': { v: '206823', n: 1 },
                '1': { v: 'נושאים נבחרים בעיצוב תעשייתי 4', n: 0.447 },
                '2': {
                    v: 'הסילבוס ייקבע על ידי המורה, באישור וועדת לימודי תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן המקצוע. סמסטר ב\' תשע"ז: עיצוב אתגרי סמסטר א\' תשע"ט: העריסה האפריקאית: עיצוב ויצירה בת קיימא באפריקה. סמסטר א\' תש"פ: אספקים שונים של עיצוב מערכות שירות ומוצר.',
                    n: 0.152,
                },
            },
        },
        {
            i: 876,
            $: {
                '0': { v: '206825', n: 1 },
                '1': { v: 'היסטוריה ותאוריה בעיצוב תעשייתי 2', n: 0.447 },
                '2': {
                    v: "היבטים בצמיחתו של תחום העיצוב התעשייתי מתקופת המהפכה התעשייתית בשלהי המאה ה-18 ועד לערב מלחמת העולם ה-II -(1939) בהקשרו הסביבתי והתרבותי. היבטים תרבותיים, גיאו-פוליטיים, כלכליים, אקולוגיים ופדגוגיים, תמורות טכנולוגיות (חומרים, שיטות עבודה וכד'), שינויים בתפיסת תחום העיצוב והמעצב, אבולוציה של מוצרים.",
                    n: 0.156,
                },
            },
        },
        {
            i: 877,
            $: {
                '0': { v: '206837', n: 1 },
                '1': { v: 'עיצוב', n: 1 },
                '2': {
                    v: 'על מעצב חווית המשתמש לתרגם דרישות מורכבות מתחומים שונים (עסקיים, שיווקיים, טכנולוגיים, פסיכולוגיים) למוצר נוח, נגיש ומהנה לשימוש תוך התאמה לסוגים שונים של משתמשים. מטרת הקורס היא הכרות והתנסות מעשית בשיטות תכנון. הקורס כולל סקירה רחבה של הנושא בלווי עבודת סטודיו ופרויקט סמסטריאלי. הקורס מיועד לסטודנטים לתואר שני בעיצוב תעשייתי ולסטודנטים לארכיטקטורה.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\nלנהל, להוביל ולבצע תהליך תכנון ועיצוב אפליקציה/מוצר דיגיטלי עפ"י העקרונות של עיצוב מכוון משתמש.',
                    n: 0.119,
                },
            },
        },
        {
            i: 878,
            $: {
                '0': { v: '206841', n: 1 },
                '1': { v: 'תכן פרמטרי באדריכלות', n: 0.577 },
                '2': {
                    v: "שיטות מידול ותכנון פרמטריות מאפשרות להתאים את הפרויקט לסביבה, למשתמשים ולאופן הייצור שלו. הקורס יציג עקרונות בסיסיים ותיאורטיים של תכנון פרמטרי ויכלול התנסות מעשית בממשק הגראסהופר בסדרה של תרגילים מעשיים. נושאים: תכנון פרמטרי, תכנות אסוציאטיבי (גראסהופר), ביו-מימטיקה, אנליזות, סימולציות, אופטימיזציה, ייצור דיגיטלי, רציונליזציה, הכרות עם שפת פייטון ולמידת מכונה.\nתוצאות למידה: בסיום הקורס הסטודנט ידע 1. לחקור וליישם מתודולוגיות וטכניקות של תכנון פרמטרי באדריכלות כדרך חשיבה תכנונית. 2. לפתח מודלים פרמטריים (כגון: מודלים מתימטיים, טרנספורמציות גיאומטריות, 'מציאת צורה', אלגוריתמים של יצירת צורה).\n3. לשלוט בשפה פרמטרית (כגון גראסהופר: הגדרת רכיבים יחסים ופרמטרים). 4. לפתח פרויקט נסיוני אדריכלי פרמטרי- בקנה מידה מצומצם.",
                    n: 0.101,
                },
            },
        },
        {
            i: 879,
            $: {
                '0': { v: '206842', n: 1 },
                '1': { v: 'מחקר פיתוח ועיצוב', n: 0.577 },
                '2': {
                    v: "הקורס יעסוק במתודולוגיות שונות בשילוב מחקר, פיתוח ועיצוב מוצרים תעשייתיים בסביבה אקדמית ומקצועית. הקורס יפגיש בין תיאוריות שונות בתהליכים אלה בתחומי תעשייה וטכנולוגיה המאמצים עיצוב, ומתן דוגמאות חיות מתוך פרוייקטים מהתעשייה. לקורס יוזמנו מספר מרצים אורחים לתאר 'מקרי בוחן' של תהליכי מחקר, פיתוח ועיצוב, הצגת הקשיים האפשריים העולים בתהליכים אלו, ההזדמנויות והאתגרים.\nתוצאות למידה: בסיום הקורס הסטודנט: 1. ילמד את הנושאים הנדרשים בתחום התיאורטי של מתודולוגיות מחקר ופיתוח בסביבת עיצוב מוצר תעשייתי.\n2. יטמיע וישתמש במסקנות בתהליך המחקר, הפיתוח והעיצוב של פרויקט התזה או פרויקט הגמר שלו במסלול לעיצוב תעשייתי. 3. ידגים דרך פרויקט את הגישה האישית שלו לתהליך הכולל 4. יגיש את תוצרי פרוייקט הגמר ויקבל עליהם משוב.",
                    n: 0.097,
                },
            },
        },
        {
            i: 880,
            $: {
                '0': { v: '206843', n: 1 },
                '1': { v: 'סוגיות בעיצוב וטכנולוגיה במאה ה21', n: 0.447 },
                '2': {
                    v: 'E המשמעותי של העיצוב להצלחתן של המהפיכות הטכנולוגיות שיסוקרו. הקורס ינתח את עיקרי השינויים שמביאה המהפיכה התעשייתית הרביעית, והשפעתה על מגוון רחב של תחומים בעיצוב תעשייתי כמו מהפיכת המחשוב, מהפיכת מחשבי כף היד, מהפיכת האובייקט התלת מימדי הדיגיטלי, הדפסה תלת מימדית, מציאות מדומה ומציאות מרובדת ועוד. כל אחד מהשיעורים יוקדש לתחום אחד מתוך היריעה הרחבה, יסקור את התחום מהפצעתו ועד היום, וינתח מגמות עתיד. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. לנתח ולפרט את עיקרי השינויים המרכזיים שמביאה המהפיכה התעשייתית הרביעית\n2. לפרט על השפעתה על מגוון רחב של תחומים בעיצוב תעשייתי ועיצוב ממשקים UX חווית משתמש\n3. להדגים את יכולתו באמצעות ניתוח של מוצר/שירות שלא נסקר בקורס באמצעות מצגת ועבודה כתובה\n4. לחזות מגמות עתיד בתחום שנסקר באמצעות הדמיה של מוצר/שירות עתידי.',
                    n: 0.091,
                },
            },
        },
        {
            i: 881,
            $: {
                '0': { v: '206913', n: 1 },
                '1': { v: 'נושאים נבחרים בארכיטקטורה 1', n: 0.5 },
                '2': {
                    v: "הסילבוס יקבע ע'י המורה באישור הועדה לפני תחילת הסמסטר בו ינתן המקצוע. סמסטר א' תשע\"ז: אדריכלות וקידמה במאות ה-02 וה-12: חשיבה עתידנית באדריכלות ובעיצוב עירוני. סמסטר ב' תשע\"ח: ברוטליזם וקהילה. מחקר אדריכלי ואתנוגרפי אודות מתחם המגורים בתי בארי בתל אביב. סמסטר ב' תשע\"ט: חומרים לבניה 2.",
                    n: 0.147,
                },
            },
        },
        {
            i: 882,
            $: {
                '0': { v: '206931', n: 1 },
                '1': { v: 'גישות עכשוויות לעיצוב עירוני', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בהרחבה והעמקה בהבנת גישות עכשוויות בעיצוב עירוני, גישות אשר בוחנות את הכוחות והתהליכים המעצבים את המרחב האורבני בישראל ובעולם. על ידי לימוד תיאוריות, מדיניות והיבטים בפרקטיקה נבחן את הטווח שבין פיתוח מדיניות מרחבית ויישומה, חשיבה אסטרטגית להתמודדות עם אתגרים עירוניים ועיצוב מרקמים ומקומות בהם מתקיימים חיי היום-יום העירוניים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 883,
            $: {
                '0': { v: '206948', n: 1 },
                '1': { v: 'היסטוריה ופילוסופיה של השימור', n: 0.5 },
                '2': {
                    v: "הקורס ישמש כפלטפורמה להעמקה בתולדות השימור בעולם מהמאה ה-18 ועד ימינו, ניסוח האמנות הבינלאומיות והתגבשות ארגוני השימור בעולם ובארץ. תתאפשר הרחבה של הדיון במושגי היסוד של שיח המורשת ולמקומם בהתווית תיאוריות ופרקטיקות_עכשוויות בשימור המורשת הבנויה:חורבות, אותנטיות, מקוריות, מונומנט, הוורנקולר, שחזור וכו'.\nתוצרי למידה: 1.הסטודנט יפתח וירחיב את ההיכרות עם יסודותיה התיאורטיים וההסטוריים של דיסציפלינת השימור. 2.הסטודנט יקרא, יבקר וינתח טקסטים תיאורטיים ודיסציפלינריים. 3.הסטודנט יכיר את עיקרי השיח המקצועי והאקדמי סביב נושאי הקורס.",
                    n: 0.119,
                },
            },
        },
        {
            i: 884,
            $: {
                '0': { v: '206951', n: 1 },
                '1': { v: 'היסטוריה של האדריכלות בישראל', n: 0.5 },
                '2': {
                    v: 'בחינת המקורות המקומיים והבינלאומיים של האדריכלות בישראל: אספקטים סגנוניים, טכנולוגיים, אקלימיים, נופיים וחברתיים אשר תרמו לגיבוש האדריכלות בארץ. ניתוח מבנים של אדריכלים מובילים. המאפיינים האדריכליים הייחודיים של ישובים שונים. התפתחות סוגי מבנים (כגון חדר האוכל בקיבוץ, שיכונים, בתי כנסת, אוניברסיטאות, מוזיאונים).',
                    n: 0.156,
                },
            },
        },
        {
            i: 885,
            $: {
                '0': { v: '206952', n: 1 },
                '1': { v: 'ההיסטוריה של המגורים', n: 0.577 },
                '2': {
                    v: 'סקירה היסטורית וגיאוגרפית של המגורים כטיפוס אדריכלי בסיסי בהקשר של צרכים מול ערכים, בית ומולדת, אזרחות, מעמדות כלכליים, מבנה המשפחה, והדיור כנדל"ן. היבטים היסטוריים ותיאורטיים בהתגבשות המגורים כבעיה מרכזית בארכיטקטורה, בתכנון ערים ובתכנון לאומי. טיפולוגיות מגורים. קשר בין טיפולוגיות וסטרוקטורות של מגורים לארגון ועיצוב העיר והמדינה.\nתוצאות למידה: בסיום הקורס הסטודנט יכיר את ההיבטים השונים של היסטוריה של המגורים הקשר ביניהם והשלכותיהם.',
                    n: 0.128,
                },
            },
        },
        {
            i: 886,
            $: {
                '0': { v: '206963', n: 1 },
                '1': { v: 'תחיקת התכנון והבניה', n: 0.577 },
                '2': {
                    v: 'הקורס בוחן את התכנון הסטטוטורי ככלי למדיניות והסדרה של המרחב. מטרת הקורס לחשוף את הסטודנט לחוק התכנון והבניה, הבנת מערכת התכנון הארצית, סוגי תכניות, מרכיבי תכנית (תשריט, תקנון ונספחים), תקנות התכנון והבניה, תקני בטיחות אש ומילוט, בטיחות המשתמש, נגישות ובריאות ויישומם, חוק המהנדסים והאדריכלים ותקנותיו וכל הנ"ל על שינוייהם - מאפייניהם ומעמדם, תהליכי דיון ואישור, גמישות בין תכנון לביצוע- הקלות ושימושים חורגים והקניית שיקול דעת. כמו כן, עוסק הקורס בייצוג ושילוב של שיקולי כלכלה, חברה, וסביבה בתהליכי תכנון, כולל יידוע הציבור, שיתוף הציבור וכלי ביצוע. תוצאות למידה: בסים הקורס הסטודנט יהיה מסוגל: 1. להכיר את העקרונות העומדים בבסיסו של החוק ויתמצא בחוק התכנון והבנייה ובשינויים החלים בו, תוך פיתוח מיומנות ראשונית בשפת החוק והתכניות, התשריטים, ההוראות, הנספחים וכלי המדיניות ומודעות למאגרי מידע קיימים והגישה אליהם. 2. לפתח רגישות למורכבות האינטרסים הפרטיים והציבוריים בתכנון ודרכי ייצוגם ושילובם, תוך הבנה בקורתית של הערכים והנהלים המנחים את ההסדרה הציבורית של המרחב.\n3. יתנסה בניתוח תהליך תכנוני מבחינת אינטרסים נוגדים מעורבים ותהליך הסדרתם.',
                    n: 0.08,
                },
            },
        },
        {
            i: 887,
            $: {
                '0': { v: '206964', n: 1 },
                '1': { v: 'תהליכי תכנון ובניה', n: 0.577 },
                '2': {
                    v: 'שליטה ביישום תהליכי התכנון, הרישוי והביצוע. בשלב התכנון- בדיקת היתכנות, סקרים ואיסוף נתונים, פרוגרמה, תכנון ראשוני וסופי, תיאום תכנון, עריכה והגשת תכנית, טיפול מול מוסדות התכנון, תיאום תשתיות. בשלבי הרישוי והתכנון לביצוע- תכנון ראשוני וסופי, עריכה והגשת בקשה להיתר, הכרת מערכות הרישוי, תיאום מערכות ויועצים, בקרת תכן ועבודה מול מכון בקרה, תכניות לביצוע, רשימות ומפרטים, הכרת בעלי תפקידים בהליך הרישוי, שינויי תכנון והשלכותיהם על התהליך. בשלבי הביצוע- התנעת תהליך הביצוע, הנחיית יועצים, קבלנים ובעלי מקצוע, הכרת אתר הבניה וארגונו, ציוד בניה ובטיחות בעבודה, בדיקות מעבדה, פיקוח עליון וצמוד, בקרת ביצוע ועבודה מול מכוני בקרה, תיאום עם גורמי תשתית וגורמים מאשרים, שינויים במהלך הביצוע, הכרת בעיות הביצוע, הכרת בעלי תפקידים בתהליך הביצוע. הבנת דרכי ההתקשרות בין השותפים לתהליכי התכנון והביצוע לרבות הכרת חוק המכרזים ואופן עריכת מכרזים.',
                    n: 0.089,
                },
            },
        },
        {
            i: 888,
            $: {
                '0': { v: '207001', n: 1 },
                '1': { v: 'תיאוריות התכנון', n: 0.707 },
                '2': {
                    v: 'תפקיד התאוריה בתהליך התכנון, תפקיד התכנון בחברה המודרנית והתפתחות מחשבת התכנון בישראל. תאוריות של תהליך התכנון הרציונאלי כוללני ושל התכנון התוספתי. שיטות להצבת יעדי תכנון, שיטות ליצירת תכניות אלטרנטיביות והערכתן, תהליך בצוע התכניות, תפקידים חלופיים למתכנן, ערכים ואתיקה בתכנון.',
                    n: 0.16,
                },
            },
        },
        {
            i: 889,
            $: {
                '0': { v: '207002', n: 1 },
                '1': { v: 'תכנון חברתי', n: 0.707 },
                '2': {
                    v: 'מטרת המקצוע היא הכרות עם גישות וכלים מקובלים לתכנון חברתי במדינת ישראל. נושאי הלימוד: מקורות הלגיטימציה של תכנון. אידיאולוגיה ושיטות להחדרת שינויים חברתיים במערכות חברתיות קיימות. תכנון לקראת שינויים חברתיים בשנות ה-2000. דפוסים להגשת שירותים חברתיים בישראל: שירותי דיור, חינוך, בריאות, סעד והבטחת הכנסה.',
                    n: 0.151,
                },
            },
        },
        {
            i: 890,
            $: {
                '0': { v: '207020', n: 1 },
                '1': { v: 'מבוא לממ"ג למתכננים', n: 0.577 },
                '2': {
                    v: 'לפתח מיומנות בשימוש טכנולוגיה מתקדמת בנתוח נתונים מרחביים. הקורס מתרכז בלימוד הסביבה -GIS מערכות מידע גיאוגרפיות במסגרת הקורס בחלקו הראשון ילמדו הסטודנטים שימוש ישיר של טכנולוגית GIS ובחלק השני, יישום השיטה לפרויקט קטן, בתחום תכנון אזורי.',
                    n: 0.167,
                },
            },
        },
        {
            i: 891,
            $: {
                '0': { v: '207041', n: 1 },
                '1': { v: 'עקרונ.אקולוגיים בתכנון עיר ואזור', n: 0.5 },
                '2': {
                    v: 'יחסי אדם סביבה, הגישה האקולוגית בתכנון שימושי קרקע אזוריים, תכנון שימושי קרקע ושמירת איכות הסביבה, גישות נבחרות לניתוח והערכה של משאבי טבע ונוף, נתונים לתכנון משאבי טבע ועיבודם בעזרת מחשבים, גישות בקרת איכות סביבה.',
                    n: 0.171,
                },
            },
        },
        {
            i: 892,
            $: {
                '0': { v: '207045', n: 1 },
                '1': { v: 'הכנה לתהליך מחקר', n: 0.577 },
                '2': {
                    v: 'בניית תהליך מחקר וכתיבה של חיבור מדעי. המתכונת המתוכננת היא של הרצאות ותרגילים נבחרים תוך הדגשת הצגות התרגילים בכיתה וקבלת משוב הדדי בין הסטודנטים.',
                    n: 0.204,
                },
            },
        },
        {
            i: 893,
            $: {
                '0': { v: '207048', n: 1 },
                '1': { v: 'תכנון סביבתי', n: 0.707 },
                '2': {
                    v: 'מטרת הקורס הינה לחשוף את הסטודנטים למורכבות השילוב של שיקולים סביבתיים בתכנון עירוני ואזורי בישראל. נושאי הקורס: אפיון תכנון סביבתי לעומת סוגי תכנון אחרים, הקשר בין תכנון סביבתי וגידול אוכלוסין, תסקירי השפעה על הסביבה, ניהול מי נגר, אתיקה ומוסר הסביבתיות, פיתוח בר-קיימא ודרכי יישומו בנושאים נבחרים._ תוצאות למידה: בסיום הקורס הסטודנטים והסטודנטיות יהיו מסוגלים:\n1.לזהות את 4-3 עיקרי הסוגיות הסביבתיות במרחב עירוני או קהילתי.\n2. להצביע על מספר תרחישים עתידיים המתיחסים לסוגיות הסביבתיות העיקריות במרחב.\n3. להציע לפחות פתרון (יצירתי) אחד או שניים שיכולים לבוא כמענה לבעיה תוך כדי התחשבות בתרחישים אפשריים._',
                    n: 0.106,
                },
            },
        },
        {
            i: 894,
            $: {
                '0': { v: '207342', n: 1 },
                '1': { v: 'גיאוגרפיה עירונית ואזורית', n: 0.577 },
                '2': {
                    v: 'תאור מרכיבי מערכות מרחביות של שכונות, ישובים, ערים ואזורים ברמות שונות. ניתוח התהליכים העיקריים העוברים על המערכות האלה. הגדרות מושגי היסוד העיקריים והדגמות מהעולם ומישראל. פרוט הנושאים: תהליכי עיור, מערכות של ישובים ארצית ואזורית, המטרופולין, השדה העירוני והשוליים העירוניים, מבנה מרחבי של ערים, הגדרות שונות של אזורים, יחסי-גומלין מרחביים הגירה ושיקולים בפתוח אזורי.',
                    n: 0.137,
                },
            },
        },
        {
            i: 895,
            $: {
                '0': { v: '207407', n: 1 },
                '1': { v: 'מדיניות סביבתית', n: 0.707 },
                '2': {
                    v: 'הגדרה של המושגים מדיניות וניהול בהקשר של שמירה על איכות הסביבה. ניתוח אירועים נבחרים של תכניות מדיניות וניהול איכות הסביבה ומשאביה בישראל ובארצות אחרות. לימוד צורות הערכה של המבנה המינהלי והחוקי לביצוע מדיניות סביבתית.',
                    n: 0.171,
                },
            },
        },
        {
            i: 896,
            $: {
                '0': { v: '207440', n: 1 },
                '1': { v: 'תכנון עם הקהילה, מושגים, כלים', n: 0.447 },
                '2': {
                    v: 'תיאוריה ומעשה של התכנון ככלי לשינוי חברתי. תכנון עם הקהילה (בניגוד לתכנון עבור הקהילה), כאמצעי לתווך בין התושבים, הסביבה למנגנוני ייצורה. הקורס כולל עבודה מעשית עם ארגונים קהילתיים בפרויקטים בנושאי תכנון, התומכים בקהילה ומסייעים לעבודת הארגונים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 897,
            $: {
                '0': { v: '207457', n: 1 },
                '1': { v: "היבטים תמטיים וכרונו' באדר' נוף", n: 0.447 },
                '2': {
                    v: 'דיון בסוגיות בעיצוב הנוף בישראל מראשית המאה העשרים ועד ימינו, בזיקה לנוף ולתרבות המקומיים ולהשפעות תרבותיות מבחוץ. הבחינה תעשה לאורך צירים תמטיים וכרונולוגיים באמצעות סקירה של תקופות ושינויים באדריכלות הנוף המקומית, דיון עומק במקרי בוחן, ראיונות וחקירה ארכיונית של מקורות היסטוריים.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. להבין את התפתחות אדריכלות הנוף בישראל כתוצאה מתהליכים היסטוריים, תרבותיים וחברתיים.\n2. לבחון באופן בקורתי פרויקטים שונים.\n3. להבין את מקומה של אדריכלות הנוף בישראל ביחס לתחומים משיקים.\n4. לערוך מחקר היסטורי עצמאי מצומצם.',
                    n: 0.113,
                },
            },
        },
        {
            i: 898,
            $: {
                '0': { v: '207460', n: 1 },
                '1': { v: 'תאוריות באדריכלות הנוף העכשווית', n: 0.5 },
                '2': {
                    v: 'נושאים: תאוריות עכשוויות של אדריכלות נוף מתוך השדה ומתוך שדות אחרים ליצירת בסיס לקריאה ביקורתית של פרויקטים. בין נושאי הדיון: מסורת הציורי, קיימות ואדריכלות הנוף, נופי תרבות ושימור מורשת, עירוניות נופית, שפה וייצוג, יחסי הגומלין בין אדריכלות לאדריכלות הנוף, אתיקה ואסטטיקה.',
                    n: 0.156,
                },
            },
        },
        {
            i: 899,
            $: {
                '0': { v: '207463', n: 1 },
                '1': { v: 'נושאים נבחרים באדריכלות נוף 2', n: 0.447 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המורה באישור וועדת תכנית הלימודים המסלולית לפני תחילת הסמסטר בו יינתן המקצוע. סמסטר א\' תשע"ז: אתיקה וצדק בנוף העירוני: קונפליקטים בין החברתי והסביבתי.',
                    n: 0.192,
                },
            },
        },
        {
            i: 900,
            $: {
                '0': { v: '207466', n: 1 },
                '1': { v: 'נושאים נבחרים באדריכלות נוף 5', n: 0.447 },
                '2': {
                    v: 'הסילבוס ייקבע על ידי המורה, באישור ועדת תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן המקצוע.\nסמסטר א\' תשע"ז: חקלאות בין עיר לכפר. סמסטר ב\' תש"ף: שיקום נחלים ובתי גידול לחים בישראל.',
                    n: 0.177,
                },
            },
        },
        {
            i: 901,
            $: {
                '0': { v: '207569', n: 1 },
                '1': { v: 'נופי תרבות:תיאוריה, פרשנות, עיצוב', n: 0.5 },
                '2': {
                    v: 'נופי תרבות הם יצירה משותפת של הטבע והאדם. הם מהווים ביטוי להתפתחות של חברה אנושית לאורך ציר הזמן, בזיקה למגבלות ולאפשרויות הפיזיות הגלומות בסביבה הטבעית ותחת השפעתם של תהליכים חברתיים, כלכליים ותרבותיים. הקורס בוחן כלים לסיווג, פרשנות, תכנון וניהול של נופי תרבות, ומציע דיון תיאורטי בהקשר הבינלאומי ובהקשר המקומי, בזיקה לנוף הישראלי.\nתוצרי למידה: עם סיום הקורס הסטודנט:\n1. יגדיר, יאפיין, יסווג, ויתעד נופי תרבות וחבלי ארץ.\n2. יבין את התפקיד והמשמעות של נופי תרבות, יחידות נוף ושירותי מערכת התרבות בקיום האדם ורווחתו.\n3. יציע פתרונות עיצוביים ותכנוניים במטרה לשמר את נופי התרבות והשירותים שהם מעניקים לאדם ולסביבה.\n4. יפתח חשיבה ביקורתית וכלים לייצוג של נופי תרבות וחבלי ארץ.',
                    n: 0.098,
                },
            },
        },
        {
            i: 902,
            $: {
                '0': { v: '207580', n: 1 },
                '1': { v: 'נושאים נבחרים באדריכלות נוף 10', n: 0.447 },
                '2': {
                    v: 'הקורס יעסוק בנושאים נבחרים באדריכלות נוף.',
                    n: 0.408,
                },
            },
        },
        {
            i: 903,
            $: {
                '0': { v: '207600', n: 1 },
                '1': { v: 'תכנון תחבורה מוטה אנשים', n: 0.5 },
                '2': {
                    v: 'מערכות תחבורה: יחסי הגומלין בין מערכת התחבורה ומערכת הפעילויות העירוניות. תחבורה ושימושי קרקע. תהליך תכנון תחבורה, בעיות תחבורה עירוניות אופייניות, מודלים לחיזוי דפוסי זרימה, מודלים ליצירת נסיעות, פילוגן, פיצולן והצבתן, מודלים דיסאגרגטיביים של ביקוש, הערכת פרויקט איסוף נתונים ועיבודם, טכנולוגיות שונות של תחבורה עירונית.',
                    n: 0.151,
                },
            },
        },
        {
            i: 904,
            $: {
                '0': { v: '207804', n: 1 },
                '1': { v: 'חשיבה כלכלית למתכננים', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד בכלכלה. החשיבה הכלכלית ומגבלותיה בהתייחסות מיוחדת לתחום התכנון העירוני והאזורי. בעיית המחסור, עקומת התמורה, עלות אלטרנטיבית, יתרון יחסי ומוחלט, תורת הצרכן ותורת התועלת, תורת היצרן, ביקוש והיצע, מונופול, התערבות ממשלה בשווקים, חשבונאות לאומית, המודל הקיינסיאני ומדיניות פיסיקאלית ומוניטרית. כלים כמותיים בסיסיים לקבלת החלטות בתכנון.',
                    n: 0.147,
                },
            },
        },
        {
            i: 905,
            $: {
                '0': { v: '207902', n: 1 },
                '1': { v: 'נוש מתקדמים בתכנון ערים ואזורים 3', n: 0.408 },
                '2': {
                    v: 'הסילבוס ייקבע על ידי המורה, באישור וועדת תארים מתקדמים של המסלול, לפני תחילת הסמסטר בו יינתן המקצוע. סמסטר א\' תשע"ז: שטחים פתוחים בישראל - סוגיות עיקריות סמסטר ב\' תשע"ז: ערים חכמות סמסטר ב\' תשע"ח: ערים חכמות. סמסטר ב\' תשע"ט: ערים חכמות',
                    n: 0.156,
                },
            },
        },
        {
            i: 906,
            $: {
                '0': { v: '207912', n: 1 },
                '1': { v: 'נושאים נבחרים בתכנון ערים ואזור 1', n: 0.408 },
                '2': {
                    v: 'הסילבוס יקבע על ידי המורה באישור הוועדה לפני תחילת הסמסטר בו ינתן המקצוע. סמסטר ב\' תשע"ו: יזמות בבנייה למגורים. סמסטר ב\' תשע"ז: טבע, עיר, שריפה. סמסטר א\' תשע"ח: תכנון רגיש למים: שילוב שיקולי מים בתכנון אזורי, עירוני ונופי.',
                    n: 0.162,
                },
            },
        },
        {
            i: 907,
            $: {
                '0': { v: '207920', n: 1 },
                '1': { v: 'שיטות מחקר איכותניות למתכננים', n: 0.5 },
                '2': {
                    v: 'אבני היסוד בשיטות מחקר איכותניות בתכנון: הצגת גישות מחקריות שונות (אתנוגרפיה, תיאוריה מעוגנת בשדה, חקר מקרה) ויישומן בהתנסות מעשית באמצעות עבודה עם קהילה נבחרת במטרה לקדם ידע ותוצרים אשר ישמשו את הקהילה.\nקשיים ודילמות עימם מתמודדים חוקרים הנוקטים בשיטות מחקר איכותניות במפגש האינטימי עם אנשים וקהילות. תוצאות למידה: עם סיום הקורס הסטודנט ידע: 1. ליישם שיטות מחקר איכותניות.\n2. לבחון מרחבים מתוכננים בעזרת כלים איכותניים. 3. ליישם ידע מחקרי ככלי לפתרון בעיות תכנוניות של קהילות.',
                    n: 0.117,
                },
            },
        },
        {
            i: 908,
            $: {
                '0': { v: '207953', n: 1 },
                '1': { v: 'תכנון וניהול הסביבה החופית והימית', n: 0.447 },
                '2': {
                    v: 'מדיניות חופית וימית: תהליכים פיזיים חופיים, שימושי חוף וים, פיתוח נמלי-ים, שיטות הניהול המשולב של אזורי חוף ותכנון מרחב ימי, כלים מדיניים לניהול ולתכנון אזורי חוף וים, החוקים לניהול החופי והימי בישראל ומסגרות בין לאומיות (כגון: הסכמים בחסות האומות המאוחדות והאיחוד האירופי).',
                    n: 0.154,
                },
            },
        },
        {
            i: 909,
            $: {
                '0': { v: '208111', n: 1 },
                '1': { v: 'סטודיו פרויקט גמר - חלק 1', n: 0.408 },
                '2': {
                    v: 'פרוייקט תכנון העונה לנושא/דיון/רעיון נבחר ברמה של בניית קונספט. הסטודנט יפתח עמדה תכנונית בנוגע ליחסים הרלוונטיים לנושא הפרויקט, כגון היחס בין קנה מידה עירוני לקנה מידה בנייני. הפרוייקטים יתמקדו בנתיב מחקר נבחר. הפרויקט מלווה בקורס עיוני תומך תיזה. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. לגבש שיטה כלי-אסטרטגיה ולעון טענה מרחבית המבוססת על דיון בנושא/ קונטקסט וידע אדריכלי. 2. לפתח כלים חדשניים ומקוריים לדיון, לזהות ולהשתמש באמצעים רלבנטיים המתאימים להתערבות, לנקוט עמדה וליישם טענה מרחבית דרך הכלי שנבחר.',
                    n: 0.113,
                },
            },
        },
        {
            i: 910,
            $: {
                '0': { v: '208171', n: 1 },
                '1': { v: 'פרויקט בסטודיו אינטגרטיבי', n: 0.577 },
                '2': {
                    v: 'פרויקט מונחה הכולל מחקר דרך תכנון ( RESEARCH BY DESIGN ). פיתוח אדריכלי מפורט מתוך עמדה ביקורתית ביחס לסוגיה עכשווית. גיבוש ופיתוח מערך קונסטרוקטיבי כבסיס לתכנון המכלול הבנייני, ופיתוח חלקים מהמבנה ברמת פירוט גבוהה תוך היכרות, הבנה ויישום של שיקולי אקלים, הקשר סביבתי, פיתוח סביבה, קונסטרוקציה, תחיקה ותקנים.\nתוצאות למידה: בסיום הסטודיו הסטודנט יהיה מסוגל:\nלהשלים תהליך של תכנון אדריכלי תוך שימוש במחקר דרך התכנון ושימוש בכלים ארכיטקטוניים לפיתוח ביקורתי של נושאים ורעיונות. תוצרי הסטודנט יכללו פיתוח מפורט במנעד קני מידה מן ההיבט העירוני ועד חומרים ופירטי בניה וייצוגם דרך כלים מתקדמים המקובלים בפרקטיקה האדריכלית העכשווית.',
                    n: 0.103,
                },
            },
        },
        {
            i: 911,
            $: {
                '0': { v: '208174', n: 1 },
                '1': { v: 'פרוייקט בסטודיו עיצוב עירוני', n: 0.5 },
                '2': {
                    v: 'פרוייקט מונחה הכולל מחקר דרך תכנון. פיתוח נושא/דיון/רעיון דרך כלים ארכיטקטוניים, תוך שימוש במתודולוגיית מחקר המובילה לעמדה תכנונית ביקורתית ביחס לסוגיות עכשוויות בעיצוב עירוני.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. לנתח ולקבל מענה תכנוני למכלול מרכיבי המרחב הרלבנטיים.\n2. להבין את מכלול השיקולים בפיתוח עירוני. 3. להכיר ולהבין את השפה והכלים של עיצוב עירוני וייצוגם דרך כלים מתקדמים המקובלים בפרקטיקה האדריכלית העכשווית.',
                    n: 0.128,
                },
            },
        },
        {
            i: 912,
            $: {
                '0': { v: '208310', n: 1 },
                '1': { v: 'סטודיו עיצוב תעשייתי 1', n: 0.5 },
                '2': {
                    v: 'עיצוב מוצר או מערכת בדרגת מורכבות בינונית תוך לימוד תהליכי עיצוב תעשייתי ויישומם בפועל. יושם דגש על הצבת יעדים ומטרות לעיצוב, עיצוב כוללני על סמך שיקולים טכניים/טכנולוגיים, עיצוביים, שיווקיים חברתיים, פסיכולוגיים ואקולוגיים. גיבוש פתרונות אלטרנטיביים וניתוחם ובנית הגשה. שיטת עבודה: צוות בין תחומי. דרישות מהסטודנט: הגשה שלמה הכוללת פרוגרמה, הערכת חלופות ופתרון מנומק, תוך קיום קשר פעיל ורצוף עם חברי הצוות והמנחים.',
                    n: 0.127,
                },
            },
        },
        {
            i: 913,
            $: {
                '0': { v: '208314', n: 1 },
                '1': { v: 'סטודיו בעיצוב תעשייתי 3', n: 0.5 },
                '2': {
                    v: 'סטודיו 3 הינו סטודיו עיצוב תעשייתי במתכונת של הרצאה, וסטודיו בהנחיה קבוצתית ואישית. מטרת הקורס היא להתוות דרכי פעולה, הקניית מתודות יצירתיות, כוונון, ותרגול הצגת משתתפים ודיון קבוצתי. הסטודיו מתניע את פרויקט הגמר של עיצוב תעשייתי ללא תזה, ומלווה את תחילת העבודה על פרויקט הגמר לאורך סמסטר ליצירת נפח מחקר וסקיצות על מנת ליצור קונספט בהיר וברור להמשך הפיתוח. הסטודיו מלווה את תחומי הפיתוח והעיצוב שמתקיימים בתהליך, תוך הקשר להיסטוריה של העיצוב, עיצוב בדגשים של תרחיש, היבט חווית משתמש, טכנולוגיית יצור וטכנולוגיות דיגיטליות. הקורס מתנהל בשיטת סטודיו, בה מחויבים הסטודנטים להביא מידי שבוע נפח עבודה, תוך כדי מצגות קצרות ועדכון בהתקדמות אישית. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להגיש מצגת מלאה של קונצפט עיצוב כולל אב טיפוס ראשוני. 2. לתכלל פרויקט בחשיבה עיצובית בהיבטיו השונים.',
                    n: 0.089,
                },
            },
        },
        {
            i: 914,
            $: {
                '0': { v: '208353', n: 1 },
                '1': { v: 'פרוייקט גמר בעיצוב תעשייתי', n: 0.5 },
                '2': {
                    v: 'עבודה סמינריונית בהיקף מורחב בעלת אופי עיוני, מחקרי או פרויקט בהיקף של 6 נקודות תבוצע בהנחיית חבר סגל. העבודה תוצג בדוח מפורט ותוגש באישור המנחה כחלק ממילוי הדרישות לקבלת התואר מגיסטר בעיצוב תעשייתי ללא תזה בלבד.',
                    n: 0.167,
                },
            },
        },
        {
            i: 915,
            $: {
                '0': { v: '208720', n: 1 },
                '1': { v: 'נושאים נבחרים בארכיטקטורה ובנוי', n: 0.5 },
                '2': {
                    v: 'הנחיה אישית של סטודנט על נושא נבחר בארכיטקטורה ובנוי ערים. הנושאים יותאמו לתחום התעניינות הסטודנטים.',
                    n: 0.258,
                },
            },
        },
        {
            i: 916,
            $: {
                '0': { v: '208750', n: 1 },
                '1': { v: 'היבטים נבחרים במחקר בארכיטקטורה', n: 0.5 },
                '2': {
                    v: 'לימוד מיגוון של גישות ושיטות מחקר מתקדמות בארכיטקטורה והנושאים הנלווים להם, בהנחיה אישית ובדיונים קבוצתיים.',
                    n: 0.258,
                },
            },
        },
        {
            i: 917,
            $: {
                '0': { v: '208800', n: 1 },
                '1': { v: 'סמינר בארכיטקטורה ובינוי ערים', n: 0.5 },
                '2': {
                    v: 'הנחיה והדרכה בהגשת סמינר/פרויקט גמר. נושאים: הגדרת הבעיה, סקר ספרות ביקורתי, איסוף וניתוח נתונים, דיון בממצאים, הסקת מסקנות והמלצות להמשך מחקר. נושא העבודה ייבחר במשותף על ידי הסטודנט והמורה. העבודה תוגש במתכונת של דו"ח מקצועי.',
                    n: 0.169,
                },
            },
        },
        {
            i: 918,
            $: {
                '0': { v: '209005', n: 1 },
                '1': { v: 'התחדשות עירונית', n: 0.707 },
                '2': {
                    v: 'מטרת הקורס היא להבין תהליכי שינוי עירוני, להכיר תכניות לשיקום של שכונות ומרכזים עירוניים במדינות מפותחות, ולהעריך מפעלי שיקום שבוצעו ומבוצעים בישראל. נושאי הלימוד העיקריים: גורמים חברתיים, כלכליים, פיסיים ומנהליים לשינוי במעמדם של איזורים עירוניים. תכניות שיקום והחיאה במדינות מערביות: סקירה והערכה. שיטות לבחירת אזורי שיקום. תבניות להחייאת מרכזי ערים בישראל. פרויקט השיקום- התכנית הלאומית לשיקום חברתי ופיסי של שכונות מצוקה בישראל: עבר, הווה ועתיד.',
                    n: 0.124,
                },
            },
        },
        {
            i: 919,
            $: {
                '0': { v: '209050', n: 1 },
                '1': { v: 'כלכלה עירונית', n: 0.707 },
                '2': {
                    v: 'נושאים: קביעות בסיסיות בכלכלה עירונית, התפיסה הכלכלית של ערים, הסברים לקיומן של ערים, נגישות וכלכלת תחבורה, מבנה מרחבי של ערים, דינאמיקה מרחבית וביזור, תיאוריות של צמיחה עירונית, דיור עירוני ועוני, מורכבות וערים.',
                    n: 0.177,
                },
            },
        },
        {
            i: 920,
            $: {
                '0': { v: '209100', n: 1 },
                '1': { v: 'סוציולוגיה למתכננים', n: 0.707 },
                '2': {
                    v: 'מטרת המקצוע היא להקנות מושגי-יסוד בסוציולוגיה ולהציג מבוא מקוצר לסוציולוגיה עירונית. נושאי הלימוד: מהות הסוציולוגיה, תרבות וחברה, ערכים ונורמות חברתיות. הסדרים ריבודיים ופערים חברתיים. גישות לניתוח אורח החיים העירוני. תכנון שכונת מגורים: היבטים נורמטיביים וממצאים אמפיריים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 921,
            $: {
                '0': { v: '209450', n: 1 },
                '1': { v: 'סמינר מתקדם בתכנון ערים 2', n: 0.447 },
                '2': {
                    v: 'כל סטודנט יידרש לערוך מחקר אישי בהיקף מצומצם בנושא נבחר הקשור בלימודי תכנון ערים ואזורים. העבודה תכלול: הגדרת הבעיה, ביצוע סקר ספרותי ביקורתי ואוסף נתונים קיימים, ניתוח הנתונים והסקת מסקנות לעבודה המקצועית בתכנון ערים או למדיניות ציבורית ומתן המלצות להמשך מחקר. תוצאות המחקר יוגשו כדוח כתוב וכן יוצגו בפני סטודנטים וחברי סגל.',
                    n: 0.139,
                },
            },
        },
        {
            i: 922,
            $: {
                '0': { v: '209970', n: 1 },
                '1': { v: 'סמינר מחקר אישי', n: 0.577 },
                '2': {
                    v: 'הסטודנט יבצע עבודת מחקר אינדיבידואלית על נושא באישור ובהנחית אחד ממורי המסלול. העבודה תתייחס לנתוח בעיה מרכזית בתחום מחקרו של הסטודנט.',
                    n: 0.218,
                },
            },
        },
        {
            i: 923,
            $: {
                '0': { v: '214011', n: 1 },
                '1': { v: 'מבוא לחינוך למדע וטכנולוגיה 1', n: 0.447 },
                '2': {
                    v: 'הקורס כולל היכרות, דיון וקריאה על תיאוריות מתחום הפילוסופיה של החינוך, פסיכולוגיה חברתית, סוציולוגיה של החינוך ותיאוריות של למידה והוראה.',
                    n: 0.224,
                },
            },
        },
        {
            i: 924,
            $: {
                '0': { v: '214092', n: 1 },
                '1': { v: "התנסות קלינית בהוראה א'", n: 0.5 },
                '2': {
                    v: 'תהליך מודרך ומבוקר של התנסות קלינית של סטודנטים בביה"ס: התנסות בהוראה, הערכה ותכנון לימודים בתחום הדעת שבהוראתו מתמחה הסטודנט, והתנסות בהיבטים חינוכיים חוצי תחומי דעת כגון ניהול למידה וניהול כיתה, התייחסות פרטנית לתלמידים עם צרכים מיוחדים, השתלבות בצוות חינוכי, היבטים חברתיים-רגשיים, מפגשי הורים וקהילה, וניתוח רפלקטיבי של הוראה ולמידה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 925,
            $: {
                '0': { v: '214120', n: 1 },
                '1': { v: 'יסודות למידה והוראה', n: 0.577 },
                '2': {
                    v: 'הקורס נועד להקנות לסטודנטים בלימודי הסמכה ידע תאורטי ומעשי בסיסי אודות תורות למידה ושיטות הוראה. בחלקו הראשון, הקורס דן בהיבטים קוגניטיביים, רגשיים וחברתיים של למידה, וסוקר תורות למידה מובילות. חלקו השני של הקורס מוקדש להוראה (מטרות, דרכים והערכה). במסגרת הקורס, הסטודנטים מכינים שיעור בתחום מדעי או טכנולוגי לרמה תיכונית ומלמדים את עמיתיהם.',
                    n: 0.139,
                },
            },
        },
        {
            i: 926,
            $: {
                '0': { v: '214132', n: 1 },
                '1': { v: 'דרכי הוראת מתמטיקה בחטיבת הביניים', n: 0.447 },
                '2': {
                    v: 'הקורס עוסק בתכנית הלימודים בחט"ב, המותאמת להתפתחות החשיבה המתמטית של התלמידים: בגאומטריה המעבר מגישה קדם דדוקטיבית עד לפיתוח של מיומנויות היסק דדוקטיביות ובאלגברה המעבר מחשיבה חשבונית לחשיבה אלגברית. דגש מיוחד ניתן לפעילויות חקר ושילוב טכנולוגיה, מאמרים, העברת שיעורים וצפייה, במטרה להתאים את ההוראה לרמות שונות של תלמידים בדרך מעמיקה ומהנה.',
                    n: 0.141,
                },
            },
        },
        {
            i: 927,
            $: {
                '0': { v: '214135', n: 1 },
                '1': { v: 'התנסות בהוראת מתמטיקה', n: 0.577 },
                '2': {
                    v: 'במסגרת ההתנסות בהוראת מתמטיקה ישמעו הסטודנטים שיעורים בכיתות שונות, בשכבות גיל שונות וברמות לימוד שונות, יכירו מקרוב את עבודת המורה על היבטיה המגוונים, יסייעו למורה בדרכים שונות, ויתנסו באורח פעיל בהוראה. כל סטודנט ישהה 6-4 שעות בכל שבוע בין כותלי בית-ספר על-יסודי (6-שנתי) ויתנסה בהוראה של 6 רצפים של שיעורים (כשני שליש מהשיעורים יתקיימו בשכבות גיל המתאימות למסלול בו הסטודנט מתמחה: חט"ע או חט"ב). בנוסף, יתקיימו מפגשי רפלקציה לאורך הקורס אחת לשבועיים, שיתקיימו במעבדת הסימולציה לחדשנות בהוראת המתמטיקה, ובהם הסטודנטים יתנסו בהוראה של 2 שיעורים קצרים (כ-20 דקות) מול תלמידים לאורך השנה, וכן יידונו וינותחו אירועים נבחרים מההתנסות של הסטודנטים בכיתה, ודרכי התמודדות של המורה המתחיל. הציון מבוסס על הערכת מורה המקצוע בטכניון, על ציוני המעקב של המורה המאמן, ועל שיעור המבחן בנוכחות שניהם.',
                    n: 0.09,
                },
            },
        },
        {
            i: 928,
            $: {
                '0': { v: '214300', n: 1 },
                '1': { v: 'התנסות בהוראת פיזיקה', n: 0.577 },
                '2': {
                    v: 'במסגרת ההתנסות בהוראת פיזיקה ישמעו הסטודנטים שיעורים בכיתות שונות, בשכבות גיל שונות וברמות לימוד שונות, יכירו מקרוב את עבודת המורה על היבטיה המגוונים, יסייעו למורה בדרכים שונות, ויתנסו באורח פעיל בהוראה. כל סטודנט ישהה 4-6 שעות בכל שבוע בין כותלי בית-ספר על-יסודי ויתנסה בהוראה של 4 רצפים של שעורים. בנוסף, יתקיימו מפגשי רפלקציה, אחת לשבועיים, לאורך הקורס שבהם יידונו וינותחו אירועים נבחרים מההתנסות של הסטודנטים בכיתה, ודרכי התמודדות של המורה המתחיל. הציון מבוסס על הערכת מורה המקצוע בטכניון, על ציוני המעקב של המורה המאמן, ועל שיעור מבחן בנוכחות שניהם.',
                    n: 0.106,
                },
            },
        },
        {
            i: 929,
            $: {
                '0': { v: '214301', n: 1 },
                '1': { v: 'דרכי הוראת הפיזיקה 1', n: 0.5 },
                '2': {
                    v: 'דיון מקיף בהוראה מעמיקה וחווייתית של נושאים מרכזיים במכניקה וגלים בביה"ס התיכון דרך עיצוב, הפעלה ודיון על שעורי דוגמה. הצגת נושא, ניהול דיון, הכרות והתמודדות עם קשיים של תלמידים, טיפוח מיומנויות לפתרון בעיות, תכנון וביצוע של ניסויים והדגמות, חקר בכיתה, שימוש באינטרנט, סימולציות וצעצועים בהוראה, שיעורי בית ודרכי הערכה מגוונות.',
                    n: 0.141,
                },
            },
        },
        {
            i: 930,
            $: {
                '0': { v: '214401', n: 1 },
                '1': { v: 'דרכי הוראת כימיה 1', n: 0.5 },
                '2': {
                    v: 'הכרות מעמיקה עם תוכנית הלימודים בכימיה בנושאי הלימוד: מושגי יסוד, מבנה האטום, מחזוריות ומשפחות כימיות, הקשר הכימי, סריגים וסטויכיומטריה. הקורס יעסוק בניתוח מדעי ועיבוד דידקטי של נושאים ומושגים חשובים בהוראת הכימיה כולל חקר, גילוי, הקניית מיומנויות בביצוע הדגמות ונסויים במעבדה ושילוב טכנולוגיות בהוראת הכימיה. קביעת הציון עפ"י נוכחות והשתתפות בשיעורים, הגשת דו"ח, מטלות סיכום ובחינה.',
                    n: 0.135,
                },
            },
        },
        {
            i: 931,
            $: {
                '0': { v: '214410', n: 1 },
                '1': { v: 'התנסות בהוראת הכימיה', n: 0.577 },
                '2': {
                    v: 'במסגרת ההתנסות בהוראת כימיה ישמעו הסטודנטים שיעורים בכיתות שונות, בשכבות גיל שונות וברמות לימוד שונות, יכירו מקרוב את עבודת המורה על היבטיה המגוונים, יסייעו למורה בדרכים שונות, ויתנסו באורח פעיל בהוראה. כל סטודנט יתנסה בהוראה של 4 רצפים של שעורים ושיעור מבחן. בנוסף, יתקיימו מפגשי רפלקציה, אחת לשבועיים, לאורך הקורס שבהם יידונו וינותחו אירועים נבחרים מההתנסות של הסטודנטים בכיתה, ודרכי התמודדות של המורה המתחיל. קביעת הציון עפ"י נוכחות והשתתפות בשיעורים, הגשת דו"חות מעבדה ועבודת סיכום.',
                    n: 0.115,
                },
            },
        },
        {
            i: 932,
            $: {
                '0': { v: '214411', n: 1 },
                '1': {
                    v: 'התנסות בהור\'מדע וטכ\' בחט"ב ובחט"ע',
                    n: 0.447,
                },
                '2': {
                    v: 'במסגרת ההתנסות בהוראת מדע וטכנולוגיה ישמעו הסטודנטים שיעורים בכיתות שונות, בשכבות גיל שונות וברמות לימוד שונות, יכירו מקרוב את עבודת המורה על היבטיה המגוונים, יסייעו למורה בדרכים שונות, ויתנסו באורח פעיל בהוראה. כל סטודנט ישהה 4-6 שעות בכל שבוע בין כותלי בית-ספר על-יסודי ויתנסה בהוראה של 4 רצפים של שעורים. בנוסף, יתקיימו מפגשי רפלקציה, אחת לשבועיים, לאורך הקורס שבהם יידונו וינותחו אירועים נבחרים מההתנסות של הסטודנטים בכיתה, ודרכי התמודדות של המורה המתחיל. הציון מבוסס על הערכת מורה המקצוע בטכניון, על ציוני המעקב של המורה המאמן, ועל שיעור מבחן בנוכחות שניהם.',
                    n: 0.105,
                },
            },
        },
        {
            i: 933,
            $: {
                '0': { v: '214501', n: 1 },
                '1': { v: 'דרכי הוראת ביולוגיה 1', n: 0.5 },
                '2': {
                    v: 'מבנה הדעת של הביולוגיה רמות ארגון ביולוגיות, עקרונות מרכזיים. היכרות עם תכנית הלימודים בביולוגיה בחטיבה העליונה. גישת הוראה במקצוע הביולוגיה - הקניית מידע, גילוי, חקר. מודלים להוראת ביולוגיה בכיתה, במעבדה ובשדה. הזמנות לחקר, משימות לימודיות, ניתוח מחקרים בביולוגיה כשיטת לימוד, ערכים וחינוך ביולוגי, טלאולוגיה, הוראת עמיתים.',
                    n: 0.147,
                },
            },
        },
        {
            i: 934,
            $: {
                '0': { v: '214510', n: 1 },
                '1': { v: 'התנסות בהוראת ביולוגיה וסביבה', n: 0.5 },
                '2': {
                    v: "במסגרת ההתנסות בהוראת ביולוגיה וסביבה ישמעו הסטודנטים שיעורים בכיתות שונות, בשכבות גיל שונות וברמות לימוד שונות, יכירו מקרוב את עבודת המורה על היבטיה המגוונים, יסייעו למורה בדרכים שונות, ויתנסו באורח פעיל בהוראה. כל סטודנט ישהה 4-6 שעות בכל שבוע בין כותלי בית-ספר על-יסודי ויתנסה בהוראה של 4 רצפים של שעורים. בנוסף, יתקיימו מפגשי רפלקציה, אחת לשבועיים, לאורך הקורס שבהם יידונו וינותחו אירועים נבחרים מההתנסות של הסטודנטים בכיתה, ודרכי התמודדות של המורה המתחיל. הציון מבוסס על הערכת מורה המקצוע בטכניון, על ציוני המעקב של המורה המאמן, ועל שיעור מבחן בנוכחות שניהם. מיועד לסטודנטים מתואר ראשון שצברו 116 נק' לפחות ולסטודנטים מתכנית מבטים שלמדו לפחות שני סמסטרים והשלימו לפחות מחצית מההשלמות בתחום התוכן (אם נדרשו).",
                    n: 0.094,
                },
            },
        },
        {
            i: 935,
            $: {
                '0': { v: '214607', n: 1 },
                '1': { v: 'דרכי הוראת מדע-טכנולו. בחט"ב(ז-ט)', n: 0.5 },
                '2': {
                    v: 'הקורס דן במטרות תוכנית הלימודים מדע וטכנולוגיה בחטה"ב, בחשיבות הגישה האינטגרטיבית המאפיינת את המקצוע, באפיון דרכי הוראה ולמידה, באפיון קשרים הדדיים מדע-טכנולוגיה-חברה, בהקניית מיומנויות, כגון: למידה מבוססת חקר, שאלת שאלות, הערכת עמיתים ועוד, תוך שילוב טכנולוגיות מתקדמות בחינוך. הקורס עוסק בנושאים מתוכנית הלימודים: חומרים, אנרגיה, כוחות ותנועה, יצורים חיים, טכנולוגיה וסביבה.',
                    n: 0.14,
                },
            },
        },
        {
            i: 936,
            $: {
                '0': { v: '214806', n: 1 },
                '1': { v: 'דרכי הוראת תכן הנדסי', n: 0.5 },
                '2': {
                    v: 'תהליך תכן במובן הרחב, חשיבת תכן, גישות לתכן הנדסי. קשרי גומלין בין תכן הנדסי וחקר מדעי, מתודולוגיות ללימודי תכן הנדסי. תכן הנדסי ככלי למידה התנסותית מבוססת פרויקטים בתכן וייצור, הנחייה והערכת הישגים בפרויקטי תכן ועבודות גמר. התנסות בביצוע, תיעוד, הנחייה והערכה של פרויקט תכן הנדסי.',
                    n: 0.149,
                },
            },
        },
        {
            i: 937,
            $: {
                '0': { v: '214808', n: 1 },
                '1': { v: 'התנסות בחינוך הנדסי', n: 0.577 },
                '2': {
                    v: 'במסגרת הקורס הסטודנטים יצפו בשיעורי הנדסה עיוניים ומעשיים בבתי ספר תיכונים ויעריכו אותם, יסייעו למורה בדרכים שונות, ויתנסו באופן פעיל בהוראה, תוך קבלת משוב וכתיבת דו"ח רפלקטיבי. בנוסף, במסגרת מפגשי רפלקציה אחת לשבועיים ידונו ארועים נבחרים מההתנסות של הסטודנטים בכיתה, לרבות דרכי התמודדות של המורה המתחיל.',
                    n: 0.147,
                },
            },
        },
        {
            i: 938,
            $: {
                '0': { v: '214901', n: 1 },
                '1': { v: 'דרכי הוראת מדעי המחשב 1', n: 0.447 },
                '2': {
                    v: 'הקורס מכשיר את הסטודנטים להוראת היחידות "יסודות מדעי המחשב" ו"מבני נתונים" של תכנית הלימודים בבית הספר העל-יסודי. ידונו נושאים נבחרים מתוך תכנית הלימודים ודרכי הוראתם ויפותחו יחידות הוראה. הקורס יתמקד בתפיסות מושגים ובגישות הוראה מגוונות, ביניהן: למידה מטעויות, הוראה על-פי תבניות, למידת חקר במעבדה, שימוש בכלי אנימציה וויזואליציה של מושגים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 939,
            $: {
                '0': { v: '214905', n: 1 },
                '1': { v: 'התנסות בהוראת מדעי המחשב', n: 0.5 },
                '2': {
                    v: 'במסגרת ההתנסות בהוראת מדעי המחשב ישמעו הסטודנטים שיעורים בכיתות שונות, בשכבות גיל שונות וברמות לימוד שונות, יכירו מקרוב את עבודת המורה על היבטיה המגוונים, יסייעו למורה בדרכים שונות, ויתנסו באורח פעיל בהוראה. כל סטודנט ישהה 4-6 שעות בכל שבוע בין כותלי בית-ספר על-יסודי ויתנסה בהוראה של 4 רצפים של שעורים. בנוסף, יתקיימו מפגשי רפלקציה, אחת לשבועיים, לאורך הקורס שבהם יידונו וינותחו אירועים נבחרים מההתנסות של הסטודנטים בכיתה, ודרכי התמודדות של המורה המתחיל. הציון מבוסס על הערכת מורה המקצוע בטכניון, על ציוני המעקב של המורה המאמן, ועל שיעור מבחן בנוכחות שניהם.',
                    n: 0.105,
                },
            },
        },
        {
            i: 940,
            $: {
                '0': { v: '216003', n: 1 },
                '1': { v: 'מוח וחינוך - לקויות למידה בילדים', n: 0.408 },
                '2': {
                    v: 'הקורס מיועד הן לסטודנטים בשלב מתקדם של התואר הראשון והן לתארים מגיסטר ודוקטורט לאור האחוזים העולים באוכלוסיית התלמידים המתקשים במערכת החינוך והצורך במתן מענה לתלמידים אלו. בכך, הקורס יאפשר זיהוי והבנה של הלקויות הנלמדות בכיתה ומחוצה לה. הסטודנטים ילמדו את הגדרות ליקויי למידה והתנהגות ואיפיוניהן. הקורס יכלול דיון על הלקויות הבאות: דיסלקציה, דיסקלקוליה, הפרעות קשב והתנהגות, שפה וקשיים רגשיים. בקורס יידונו גם אפשרויות טיפול שונות לאוכלוסיות נלמדות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: להגדיר את לקויות הלמידה השונות. להבין דוח אבחון להתאים תוכנית התערבות טיפולית ללקויות השונות.',
                    n: 0.107,
                },
            },
        },
        {
            i: 941,
            $: {
                '0': { v: '216022', n: 1 },
                '1': { v: 'יזמות טכנולוגית בחינוך', n: 0.577 },
                '2': {
                    v: "בקורס זה יבחנו תאוריות למידה ומודלים (לדוג' ביהביוריזם, תיאוריות קוגניטיביותת קונסטרקטיביזם) העומדים מאחורי טכנולוגיות חינוכיות בקונטקסט של מקרים שונים של חברות EDTECH מהארץ ומהעולם (SCRATCH, AMPLIFY LEARNING ועוד). בפרט יבחנו מודלים קיימים לחדשנות טכנולוגית בחינוך ודרכים לפיתוח, בחינה ומימוש אפקטיבי של טכנולוגיה חינוכית בכיתה ומחוץ לה. תוצאות למידה: בסיום הקורס הסטודנטים יכירו את תאוריות הלמידה והמודלים העומדים בבסיס טכנולוגיות חינוכיות שונות. יכירו מגוון רחב של טכנולוגיות EDTECH מצליחות בבית הספר ומחוץ להם, וכן יכירו חברות שלא הצליחו לפרוץ ויבחנו את הסיבות לכך. יכירו את המכשולים בהכנסת טכנולוגיות חדשות למערכת החינוך , יכירו את תהליך הפיתוח, הערכה, ומימוש של טכנולוגיות EDTECH חדשה תוך התייחסות לתכני הקורס.",
                    n: 0.098,
                },
            },
        },
        {
            i: 942,
            $: {
                '0': { v: '216028', n: 1 },
                '1': { v: 'עיצוב משחקי למידה', n: 0.577 },
                '2': {
                    v: 'בקורס נלמד עקרונות עיצוב ולמידה ממשחקים. הקורס יעסוק בסגנונות, יחסי גומלין עם למידה, מוטיבציה, משחקים להערכה, משחקים עבור אוכלוסיות מגוונות, ומשחוק ( GAMIFICATION ). דגש יושם על עיצוב בקבוצה ויישור ( ALIGNMENT ) עם מטרות ההוראה.הסטודנטים יצרו מספר משחקים מסוגים שונים. הפרויקטים יכולים להיות מקוונים, אולם אין דרישה לכך. בסיום הקורס הסטודנט יהיה מסוגל: 1. לעצב משחקים בהתאם למטרות למידה. 2. לנתח משחקים על מנת לזהות הזדמנויות ללמידה של תוכן, כישורים,',
                    n: 0.119,
                },
            },
        },
        {
            i: 943,
            $: {
                '0': { v: '216110', n: 1 },
                '1': { v: 'הוראת מדעים זיקה להוראת טכנולוגיה', n: 0.447 },
                '2': {
                    v: 'ליבון אספקטים אינטרדיסציפלינריים של הוראה במדעים והוראה בטכנולוגיה. תכנון מערך למידה בדיסציפלינה מדעית או טכנולוגית תוך התחשבות ביחסי הגומלין ביניהן. יישום המערך בשדה, הערכת יעילותו והכנסת שיפורים מתאימים. שמוש בתורת השטחות.',
                    n: 0.18,
                },
            },
        },
        {
            i: 944,
            $: {
                '0': { v: '216117', n: 1 },
                '1': { v: 'תקשורת המדע', n: 0.707 },
                '2': {
                    v: 'נושאים: ניסוח מסר תוך התאמתו לקהל היעד, כתיבה של ידיעה חדשותית בנושא מדע, ראיון, צילום ועריכת כתבה לטלויזיה ופיתוח פורמט. הידע הציבורי בנושא מדע ומקורותיו, מודלים ליחסי הקהילה המדעית עם התקשורת והציבור והמחקר בתחום זה.',
                    n: 0.169,
                },
            },
        },
        {
            i: 945,
            $: {
                '0': { v: '216125', n: 1 },
                '1': { v: 'גישות מתקדמות להערכה בחינוך מתמטי', n: 0.447 },
                '2': {
                    v: 'גישות מתקדמות להערכת הישגים לימודיים במתמטיקה. שימוש במגוון של מקורות ואמצעים, על מנת להעריך מכלול שלם של סוגי ידע ומיומנויות במתמטיקה ברמות שונות של הבנה ובמצבי למידה שונים. יישום שיטות הערכה עדכניות וניתוח התפיסה החינוכית העומדת ביסודן והקשר שלהן לתכנית הלימודים ולמטרות לימוד המתמטיקה. בין היתר תיכללנה השיטות הבאות : הערכה דיאגנוסטית, הערכת ביצוע, הערכה באמצעות תיק עבודות, הערכה של מטלות בסיוע מחשב, הערכה של משימות פתוחות.',
                    n: 0.122,
                },
            },
        },
        {
            i: 946,
            $: {
                '0': { v: '216126', n: 1 },
                '1': { v: 'סדנת התנסות במדע בלווי מחקר פעולה', n: 0.408 },
                '2': {
                    v: 'הקורס מתמקד בהיבטים תיאורטיים ויישומיים של ביצוע מחקר פעולה. הסטודנטים יתנסו בצוותים בביצוע מחקר פעולה מצומצם. ילמדו לאתר בעיה העולה משדה החינוך שברצונם לחקור, ויתנסו בהיבטים של שיטות מחקר איכותניות, יתנסו בפיתוח שאלון, עריכת ראיונות ותצפיות ויישומם בביצוע מחקר פעולה מצומצם בצוות. הקורס ינתן באופו מקוון בשילוב מפגשים סינכרוניים וא-סינכרוניים. בקורס ילמדו הסטודנטים לאתר מאמרים מחקריים בתחום המחקר המתוכנן ויקריאו ספרות מחקרית ותיאורטית בנושא הנחקר ויציגו מאמר בכיתה. הסטודנטים ילמדו לתכנן ולבצע מיני-מחקר הכולל: בחירת נושא, איתור בעיה, הצבת מטרה, ניסוח שאלות ומהלך המחקר ויציגו את תכנון המחקר בכיתה. הסטודנטים יתנסו בפיתוח כלי מחקר, איסוף ועיבוד הנתונים שיתקבלו והצגת המחקר הכולל בסיום הקורס במתכונת של כנס מדעיוכן בכתיבת עבודה מסכמת של המחקר בדומה למאמר מדעי. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. לדעת כיצד לחפש מאמרים מחקריים בנושא המחקר במאגרי מידע אקדמיים ולהעריך את איכותם.\n2. להציג בפני המליאה מאמר מחקרי ולבצע חשיבה ביקורתית על המאמר. 3. כיצד לתכנן מחקר פעולה הכולל את רציונל, מטרה, שאלות, כלים ומהלך המחקר ולהציגו בפני המליאה.\n4. לאסוף נתונים מכלי מחקר שונים ולנתח את הנתונים_.\n5. כיצד להציג מחקר מלא בפני מליאה.\n6. לכתוב עבודה מסכמת כדוגמת מיני מאמר אקדמי בו ידע לדון בממצאים ולכתוב דיון מחקר אקדמי.\n7. לעבוד בשיתוף פעולה בצוות המחקר.',
                    n: 0.072,
                },
            },
        },
        {
            i: 947,
            $: {
                '0': { v: '216135', n: 1 },
                '1': { v: 'סוגיות מתקדמות בהוראת המתמטיקה', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בתיאוריות הלמידה העיקריות הנוגעות להוראת המתמטיקה. בין הנושאים הנלמדים: פילוסופיה של המתמטיקה, תיאוריות למידה מרכזיות והקשר שלהן להוראת המתמטיקה, פרקטיקות מעודדות חשיבה במתמטיקה, קשיים ואתגרים שכיחים בלמידת מתמטיקה ובהוראתה. הסטודנטים יחשפו לשיטות הוראה שונות וידונו בהשלכותיהן.\nתוצאות למידה: בסיום הקורס הסטודנטים יהיו מסוגלים:\n1. להכיר את התיאוריות המרכזיות העומדות בבסיס הוראת המתמטיקה וביניהן: ביהוויוריזם, הגישה הקוגניטיבית והגישה הסוציו תרבותית.\n2 . לדעת להכין מערך שיעור ולקשר אותו לתיאוריות שנלמדו.\n3 . לדעת לנתח אירועי למידה והוראה על פי התיאוריות שנדונו בקורס.\nLEARNING',
                    n: 0.113,
                },
            },
        },
        {
            i: 948,
            $: {
                '0': { v: '216150', n: 1 },
                '1': { v: 'פרויקט אישי במחקר חינוכי', n: 0.5 },
                '2': {
                    v: 'הפרויקט האישי במחקר חינוכי מעניק לסטודנטים בלימודי הסמכה ומוסמכים אפשרות לבצע מחקר זוטא בהנחיית חבר סגל. הסטודנטים ירחיבו את הידע בתחומרי מדע, טכנולוגיה, הנדסה ומתמטיקה, יעמיקו את ההבנה בישטות מחקר מתקדמות וירכשו ניסיון במחקר מעשי ותיאורטי. נדרש להגיש דו"ח מחקר לשם הערכה. תוצאות למידה: עם סיום הקורס הסטודנט יהיה מסוגל: 1. לתכנן מחקר תוך מתן דגש לשימוש בשיטות אמפיריות. 2 לבצע סקירת ספרות עדכנית. 3. לאסוף נתונים בעזרת כלים מגוונים. 4. לנתח נתונים בעזרת שימוש במתודולוגיות מקובלות ויציגו פרשנויות שונות לממצאים. 5. להציג את הממצאים בצורה מגוונת ולכתוב דו"ח מחקר.',
                    n: 0.105,
                },
            },
        },
        {
            i: 949,
            $: {
                '0': { v: '218122', n: 1 },
                '1': { v: "סמינר במחקר חינוכי 1 - שלב א'", n: 0.378 },
                '2': {
                    v: "דיון בסוגיות תיאורטיות ומתודולוגיות של תהליך המחקר החינוכי באמצעות ניתוח של הצעות מחקר. עבודת הסטודנטים מתמקדת בהגשת הצעת מחקר לדוגמה והצגתה לדיון וביקורת של יתר המשתתפים. אפשר להשתתף בסמינר זה לראשונה רק עם תום סמסטר ראשון ללימודים. סמסטר א' תשע\"ז: הצגת מחקרים - המרצה פרופ'ח טלי טל סמסטר ב' תשע\"ח: פרופ' יהודית דורי - הצגת מחקרים של סטודנטים. סמסטר א' תשע\"ט: פרופ' יהודית דורי - סמינר תיזה סמסטר א' תשפ\"א: פרופ' טל טל, סמינר במחקר חינוכי.",
                    n: 0.115,
                },
            },
        },
        {
            i: 950,
            $: {
                '0': { v: '218131', n: 1 },
                '1': { v: 'פרויקט פיתוח תו"ל במדע וטכנולוגיה', n: 0.447 },
                '2': {
                    v: 'הקורס מאפשר התנסות בפיתוח או בהערכה של חומרי לימוד המבוססים על תיאוריות חינוכיות חדשניות. הסטודנטים ישתתפו בפיתוח חומרי לימוד לאחר הקורסים הנלמדים בפקולטה במדעי המחשב או לאחת מיחידות הלימוד הנלמדות בתיכון ויבצעו את הפרויקט בהדרכת חבר/ת סגל בהוראת מדעי המחשב. תוצאות למידה: עם השלמת הקורס בהצלחה, הסטודנטים יהיו מסוגלים ליישם אחת או יותר מהפעולות הבאות: לתכנון ולכתוב יחידת לימוד קצרה, לבצע הערכה של יחידת לימוד, לפתח ולהפעיל יישומון לימודי ממוחשב.',
                    n: 0.12,
                },
            },
        },
        {
            i: 951,
            $: {
                '0': { v: '218143', n: 1 },
                '1': { v: 'נושאים נבחרים בהערכת לומדים', n: 0.5 },
                '2': {
                    v: 'נושאים עדכניים בהערכת הישגים לימודיים כולל מידע על הערכה חילופית, מדדים והערכת ביצועים. הסילבוס ייקבע ע"י המורה באישור הוועדה לפני תחילת הסמסטר בו ינתן המקצוע. סמסטר ב\' תשע"ו: הערכת לומדים.',
                    n: 0.183,
                },
            },
        },
        {
            i: 952,
            $: {
                '0': { v: '218322', n: 1 },
                '1': { v: 'מחקר איכותני: היבטים תיאורטיים', n: 0.5 },
                '2': {
                    v: "הקורס יתמקד בהיסטוריה ובהיבטים מתודולוגיים-תיאורטיים של מחקר איכותני. סקירה על מגוון השיטות האיכותניות לאיסוף נתונים ולניתוחם. דיון ביקורתי והשוואה של שיטות כמותיות ואיכותניות. דיון בשיקולים פילוסופיים ומעשיים ב סגרת המחקר החינוכי.\nתוצאותת למידה: בסיום הקורס הסטודנטים:\n1. יבחינו בין סוגות המחקר האיכותני השונות העיקריות כמו: אתנוגרפיה, תיאוריה מעוגנת בשדה, פנומנולוגיה, מחקר נרטיבי וכו'.\n2. יוכלו להסביר גישות שונות לשמירה על אמינות המחקר האיכותני.\n3. יקראו באופן ביקורתי מאמרי מחקר בהם נעשה שימוש במתודולוגיות איכותניות ולחוות דעה על איכותם.",
                    n: 0.116,
                },
            },
        },
        {
            i: 953,
            $: {
                '0': { v: '218329', n: 1 },
                '1': { v: 'פיתוח והערכה- מיומנויות בינאישיות', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס היא לשפר את הכישורים הבינאישיים )הרכים(, כגון תקשורת בכתב ובעל פה, מתן משוב משמעותי בעקבות קריאה ביקורתית של תקצירים, הצגה בפני קהל מגוון, הערכה עצמית והערכת עמיתים. מתכונת הקורס מבוססת על ממצאי מחקר שהראה כי כישורים בינאישיים התפתחו אך מעט במהלך הלימודים בטכניון. כמו כן, ממחקר שליווה קורס טכניוני לתארים מתקדמים, עלה כי ניתן לפתח מיומנויות אלו באמצעות למידה פעילה והתנסויות. כישורים בינאישיים הוגדרו כחיוניים עד מאד על ידי ארגוני מהנדסים ומדענים מובילים בעולם והפורום לחינוך הנדסי במוסד שמואל נאמן למחקר מדיניות לאומית. הקורס מיועד לכלל הסטודנטים לתארים מתקדמים בטכניון העוסקים במחקר ומהווה הזדמנות לחשיפתם למחקרים ממגוון פקולטות. תוצאות למידה:\nבסיום הקורס הסטודנטים יהיו מסוגלים:\n1. להציג את עצמם בעל פה בפני קהל מגוון בהצגה קצרה )ELEVATOR PITCH( או ארוכה.\n2. להציג את מחקרם בכתב לקהל מגוון, תוך מתן הסבר נגיש על נושא ומטרות המחקר.\n3. לתת ולקבל משוב באופן חיובי ובונה.\n4. להעריך את עצמם ואת עמיתיהם.\n5. לשפר את היכולות המטה קוגניטיביות הקשורות למחקרם.\n6. להיחשף למגוון מחקרים בטכניון שעשויים לקדם שיתופי פעולה בין תחומיים.',
                    n: 0.079,
                },
            },
        },
        {
            i: 954,
            $: {
                '0': { v: '233000', n: 1 },
                '1': { v: 'קורס הכנה למדעי המחשב', n: 0.5 },
            },
        },
        {
            i: 955,
            $: {
                '0': { v: '234114', n: 1 },
                '1': { v: "מבוא למדעי המחשב מ'", n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים למדעי המחשב. המקצוע 234111 (מבוא למדעי המחשב) יענה על הדרישה לקדם בכל מקום שבו נדרש 234114. מבנה המחשב. גישה אלגוריתמית לפתרון בעיות. מושגי יסוד ותכנות בשפת C. פיתוח תכניות מלמעלה למטה. תכנות מבני. כתיבה ובדיקה מלמטה למעלה. ניפוי שגיאות. תכנון הדפסות ביקורת. הוכחת נכונות חלקית ושלמה של תכניות. מדדים ליעילות האלגוריתם: סיבוכיות זמן וזכרון. סיבוכיות פולינומיאלית ואקספוננציאלית. דוגמאות לאלגוריתמים אקראיים. בעיות שלא ניתנות להכרעה. מחסנית. תור. יצוגים של ביטויים אריתמטיים ומימוש חישובם באמצעות מחסנית. רקורסיה ומימושה. חיפוש לעומק. מיון יעיל.',
                    n: 0.11,
                },
            },
        },
        {
            i: 956,
            $: {
                '0': { v: '234117', n: 1 },
                '1': { v: "מבוא למדעי המחשב ח'", n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים של הנדסת חשמל. מבנה המחשב. גישה אלגוריתמית לפתרון בעיות. מושגי יסוד ותכנות בשפת C. פיתוח תכניות מלמעלה למטה. תכנות מבני. כתיבה ובדיקה מלמטה למעלה. ניפוי שגיאות. תכנון הדפסות ביקורת. הוכחת נכונות חלקית ושלמה של תוכניות. מדדים ליעילות האלגוריתם: סיבוכיות זמן וזכרון. סיבוכיות פולינומיאלית ואקספוננציאלית. דוגמאות לאלגוריתמים אקראיים. בעיות שלא ניתנות להכרעה. מחסנית. תור. יצוגים של ביטויים אריתמטיים ומימוש חישובם באמצעות מחסנית. רקורסיה ומימושה. חיפש לעומק. מיון יעיל.',
                    n: 0.12,
                },
            },
        },
        {
            i: 957,
            $: {
                '0': { v: '234118', n: 1 },
                '1': { v: 'ארגון ותכנות המחשב', n: 0.577 },
                '2': {
                    v: 'תכנות מערכות מתקדם: המחשב מרמת האסמבלי ועד רמת סביבת תכנות מתקדמת. מבנה המחשב: זיכרון ערימה, מחסנית. מבוא לשפת אסמבלי. הידור ובניה של פרויקט מרובה קבצים, קישור וטעינה. ניהול זכרון דינמי מתקדם: מצביעים חכמים, מערכות הקצאת זכרון. מבנה אובייקטים בזכרון, סדר הקצאה ושחרור. ניהול משאבים. עבודה סינכרונית ואסינכרונית. הצגה של עמוד בדפדפן.',
                    n: 0.14,
                },
            },
        },
        {
            i: 958,
            $: {
                '0': { v: '234123', n: 1 },
                '1': { v: 'מערכות הפעלה', n: 0.707 },
                '2': {
                    v: 'הקורס מציג את הנושאים המרכזיים של מערכות הפעלה מודרניות, ובפרט: תהליכים וחוטים: זימון והחלפת הקשר, תיאום: בעיית הקטע הקריטי, סמפורים ומשתני תנאי, פסיקות, ניהול זיכרון: דפדוף, זיכרון וירטואלי, מערכת הקבצים. במסגרת התרגול, הסטודנטים יכנסו לעומקה של מערכת הפעלה מתקדמת.',
                    n: 0.16,
                },
            },
        },
        {
            i: 959,
            $: {
                '0': { v: '234124', n: 1 },
                '1': { v: 'מבוא לתכנות מערכות', n: 0.577 },
                '2': {
                    v: 'השלמות שפת C: מצביעים, רשומות, ניהול זיכרון דינמי, רשימות מקושרות. ניהול גרסאות. הידור, קישור, ושימוש בספריות. פקודות SHELL בסיסיות. תכנות בפייתון. מבוא ל-++C: תכנות מונחה עצמים, מחלקות וטיפוסי נתונים מופשטים, מימוש והעמסת אופרטורים, תבניות, חריגות, ירושה ופולימורפיזם. דרישות, תכן ותבניות תכן, בדיקות תוכנה, UML.',
                    n: 0.151,
                },
            },
        },
        {
            i: 960,
            $: {
                '0': { v: '234125', n: 1 },
                '1': { v: 'אלגוריתמים נומריים', n: 0.707 },
                '2': {
                    v: "מערכות משוואות ליניאריות: חילוץ גאוס ופירוק LU, פירוק צ'ולסקי, מטריצות חיוביות מוגדרות, ריבועים פחותים והיפוך מוכלל של מטריצה, ריבועים פחותים משוקללים, רגולריזצית טיכונוב, מרחבי מכפלה פנימית ומרחבים נורמיים, אורתוגונליות, פירוק QR ושימושיו, ערכים עצמיים וערכים סינגולריים, פירוק SVD ושימושיו, שיטות איטרטיביות בסיסיות למערכות ליניאריות ולבעיות ריבועים פחותים, נורמות של מטריצות, משפט גרשגורן, שיטת החזקה, אי יציבות נומרית ושגיאות נומריות, מטריצות טופליץ וסיבובית, פעולת הקונבולוציה, התמרת פורייה הדיסקרטית ואלגוריתם FFT, פתרון איטרטיבי למשוואות אי-לינאריות סקלריות: שיטת החציה, שיטת ניוטון-רפסון, שיטת המיתר, חקר התכנסות.",
                    n: 0.11,
                },
            },
        },
        {
            i: 961,
            $: {
                '0': { v: '234128', n: 1 },
                '1': { v: 'מבוא למחשב שפת פייתון', n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לכלל הסטודנטים בטכניון. מבנה המחשב. חומרה ותכנה. ייצוג נתונים. מושגי יסוד ותכנות בשפת פייתון: ערכים, משתנים, ביטויים, טיפוסי נתונים בפייתון, התניות, חוגים (לולאות), פונקציות, רקורסיה, קלט/פלט (טקסטואלי וגרפי). סביבת הפיתוח של פייתון: שטח העבודה, הרצת תוכניות, ניפוי שגיאות. פיתוח מובנה של תוכניות, ארגון מידע במחשב. אלגוריתמים: פיתוח מונחה נכונות וסיבוכיות בסיסית. פתרונות אלגוריתמים למיון, חיפוש, בעיות במספרים שלמים.',
                    n: 0.129,
                },
            },
        },
        {
            i: 962,
            $: {
                '0': { v: '234129', n: 1 },
                '1': { v: 'מב.לתורת הקבוצות ואוטומטים למדמ"ח', n: 0.5 },
                '2': {
                    v: 'הגדרות בסיסיות, יחסים, פונקציות, יחסי שקילות וסדר, קבוצות בנות מניה ושיטת הליכסון של קנטור, אוטומטים סופיים (דטרמיניסטיים ולא דטרמיניסטיים), ביטויים רגולריים, למת הניפוח, דקדוקים.',
                    n: 0.204,
                },
            },
        },
        {
            i: 963,
            $: {
                '0': { v: '234141', n: 1 },
                '1': { v: 'קומבינטוריקה למדעי המחשב', n: 0.577 },
                '2': {
                    v: 'עקרונות ספירה בסיסיים, הבינום של ניוטון, עקרון ההכלה וההפרדה, רקורסיה ואינדוקציה, פונקציות יוצרות, חלוקות. גרפים מכוונים ולא מכוונים, עצים, ספירת עצים, מסלולים אוילריים, עצים מצביים ומספרי קטלן. הקורס מיועד לסטודנטים של מדעי המחשב.',
                    n: 0.174,
                },
            },
        },
        {
            i: 964,
            $: {
                '0': { v: '234218', n: 1 },
                '1': { v: 'מבני נתונים 1', n: 0.577 },
                '2': {
                    v: 'הקורס יקנה ידע במבני נתונים בסיסיים, באנליזה, ביישומים ובשימושים שונים שלהם. יושם דגש על התאמת מבני הנתונים לצרכי הבעיה הנתונה. סוגי מבנים: חזרה על המבנים הפשוטים (מערכים, רשימות, מחסניות ותורים), רשימות דילוגים, תורי עדיפות, ערמות, עצים דיגיטלים ( TRIES ). מיון וחיפוש. עצים וגרפים וייצוגיהם. הקצאת זכרון, ערבול, איסוף אשפה.',
                    n: 0.141,
                },
            },
        },
        {
            i: 965,
            $: {
                '0': { v: '234221', n: 1 },
                '1': { v: "מבוא למדעי המחשב נ'", n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים בפקולטה להנדסת תעשיה וניהול. מבנה המחשב. חומרה ותוכנה. ייצוג נתונים. מושגי יסוד ותכנות בשפת פיתון: ערכים, משתנים, ביטויים, טיפוסי נתונים בפייתון, התניות, חוגים (לולאות), פונקציות, רקורסיה, קלט/פלט (טקסטואלי וגרפי). סביבת הפיתוח של פייתון: שטח העבודה, הרצת תוכניות, ניפוי שגיאות. פיתוח מובנה של תוכניות, ארגון מידע במחשב. אלגוריתמים: פיתוח מונחה נכונות ואנליזת סיבוכיות בסיסית. פתרונות אלגוריתמים למיון, חיפוש, בעיות במספרים שלמים.',
                    n: 0.126,
                },
            },
        },
        {
            i: 966,
            $: {
                '0': { v: '234230', n: 1 },
                '1': { v: 'השתלמות עצמית 1', n: 0.577 },
                '2': {
                    v: 'מיועד לסטודנטים בשלבי לימודים מתקדמים (שצברו לפחות 80 נקודות) ובעלי השגים טובים בלימודים (ממוצע מצטבר לפחות 80). ההשתלמות תעשה בהנחית חבר סגל הפקולטה ובאישור מרכז לימודי הסמכה בפקולטה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 967,
            $: {
                '0': { v: '234247', n: 1 },
                '1': { v: 'אלגוריתמים 1', n: 0.707 },
                '2': {
                    v: 'הקורס עוסק בשיטות בסיסיות לתיכון וניתוח אלגוריתמים, כולל שיטות סריקה, אלגוריתמים חמדנים, תכנון דינמי, רדוקציות, מסלולים משפרים, אלגוריתמים הסתברותיים, ושיטות אלגבריות. בקורס מציגים אלגוריתמים יעילים לשאלות יסוד בתורת הגרפים ובתחומים אחרים. בין השאר דנים בנושאים הבאים: סריקה לרוחב, סריקה לעומק, עץ פורש מינימום, מסלולים קלים ביותר, זרימה ברשתות, חתכים, התאמת מחרוזות, בעיות גיאומטריות ואלגבריות. הקורס מיועד לסטודנטים של מדעי המחשב.',
                    n: 0.129,
                },
            },
        },
        {
            i: 968,
            $: {
                '0': { v: '234290', n: 1 },
                '1': { v: 'פרויקט 1 במדעי המחשב', n: 0.5 },
                '2': {
                    v: 'מיועד לסטודנטים בסמסטר אחרון ללימודיהם, שחסרה להם 0.5 נקודה להשלמת התואר. הסטודנט יבצע פרויקט בהנחית חבר סגל הפקולטה. קורס זה אינו נחשב כפרויקט לענין קיום דרישות הפרויקטים לתואר.',
                    n: 0.189,
                },
            },
        },
        {
            i: 969,
            $: {
                '0': { v: '234291', n: 1 },
                '1': { v: 'פרויקט 2 במדעי המחשב', n: 0.5 },
                '2': {
                    v: 'מיועד לסטודנטים בסמסטר אחרון ללימודיהם, שחסרה להם 1.0 נקודה להשלמת התואר. הסטודנט יבצע פרויקט בהנחית חבר סגל הפקולטה. קורס זה אינו נחשב כפרויקט לענין קיום דרישות הפרויקטים לתואר.',
                    n: 0.189,
                },
            },
        },
        {
            i: 970,
            $: {
                '0': { v: '234292', n: 1 },
                '1': { v: 'לוגיקה למדעי המחשב', n: 0.577 },
                '2': {
                    v: 'תחשיב הפסוקים ותחשיב היחסים: הגדרת התחשיבים, סמנטיקה, מערכות הוכחה, משפטי שלמות ונאותות, משפטי קומפקטיות ושימושיהם.',
                    n: 0.258,
                },
            },
        },
        {
            i: 971,
            $: {
                '0': { v: '234311', n: 1 },
                '1': { v: "פרויקט שנתי בהנדסת תוכנה-שלב א'", n: 0.447 },
                '2': {
                    v: 'קורס זה אינו נחשב כפרויקט לענין קיום דרישות הסיום. קורס זה יחד עם הקורס פרויקט שנתי בהנדסת תוכנה-שלב ב\' (234312) מהווים יחידה אחת המוקדשת לתכנון ולמימוש של פרויקט תוכנה גדול שיתבצע במשך שני סמסטרים עוקבים. הסטודנטים עובדים בצוותים בהנחיתו של חבר סגל בכיר. בקורס נלמד תהליך פיתוח תוכנה ומבוצעים שלבי ניתוח הדרישות. תכן על, תכן מפורט ובנית אב-טיפוס ראשוני. הציון יקבע על פי דו"חות ביניים, דו"ח מסכם ואיכות אב-טיפוס שימומש בשלב זה.',
                    n: 0.118,
                },
            },
        },
        {
            i: 972,
            $: {
                '0': { v: '234313', n: 1 },
                '1': { v: 'פרויקט תעשייתי', n: 0.707 },
                '2': {
                    v: 'פרויקט תוכנה בהיקף של 3 נק\', המתבצע בעקרון ע"י זוג סטודנטים (120 שעות עבודה לסטודנט). נושאי הפרוייקטים מתקבלים מחברות תוכנה בתחילת הסמסטר במגוון נושאים במדעי המחשב. הנחיית הפרויקט ע"י מנחה מהתעשייה, בפיקוח אחראי אקדמי מטעם הפקולטה. הפרויקט יקנה לסטודנטים נסיון בביצוע פרויקט הנגזר מה"עולם האמיתי" תוך שימוש בכלי פיתוח וסביבות עבודה מודרניות לפיתוח תוכנה והתמודדות עם הבעיות האופייניות המתעוררות בתהליכי פיתוח. בסוף הפרויקט, מוצר התוכנה מוגש בליווי תיעוד הולם ודו"ח מסכם.',
                    n: 0.119,
                },
            },
        },
        {
            i: 973,
            $: {
                '0': { v: '234326', n: 1 },
                '1': { v: "פרויקט בגרפיקה ממוחשבת ה'", n: 0.5 },
                '2': {
                    v: 'יבוצע פרויקט על ציוד גרפי. הפרויקט יבוצע ע"י סטודנטים יחידים או בקבוצות קטנות בהשגחתם של אסיסטנטים ובהדרכת חבר סגל בכיר.',
                    n: 0.224,
                },
            },
        },
        {
            i: 974,
            $: {
                '0': { v: '234329', n: 1 },
                '1': { v: 'פרויקט בעיבוד וניתוח תמונות', n: 0.5 },
                '2': {
                    v: 'קורס זה מיועד לביצוע פרויקט רחב בהיקפו בנושאים של ראיה ממוחשבת ועיבוד תמונות. הסטודנטים יעבדו בצוותים קטנים (2) בהנחיה צמודה של אסיסטנטים ובפיקוח סגל בכיר.',
                    n: 0.2,
                },
            },
        },
        {
            i: 975,
            $: {
                '0': { v: '236201', n: 1 },
                '1': { v: 'מבוא לייצוג ועיבוד מידע', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בשיטות בסיסיות לעיבוד וניתוח מידע בכלים דטרמיניסטיים והסתברותיים. נושאי הקורס: אפיון אותות ןמערכות בשריג בדיד, ניתוח פורייה למערכות ליניאריות קבועות בזמן, ייצוג ועיבוד מידע במרחבים אלגבריים, שערוך סטטיסטי, יסודות באותות אקראיים, מושג הקונבולציה, רעש אקראי, מודלים פרמטריים של תהליכים אקראיים ושערוכם, חיזוי ליניארי ואלגוריתמים אדפטיביים. הוכחת אופטימליות ויחידות של ייצוגי פורייה קצוצים, קירוב לבעיית האשכול, ומבוא למיפויים פונקציונליים. תוצאות למידה: בסיום הקורס הסטודנט ידע: 1. לאפיין מערכת ליניארית קבועה בזמן ולקשור את ניתוחה לתחום התדר. 2. להציג עיבוד מידע כמטריצות המייצגות מערכות ליניאריות ווקטורים המייצגים אותות. 3. להפעיל כלי שערוך סטטיסטי, פרמטרי וישיר למגוון בעיות יסוד בעיבוד מידע. 4. להפעיל אופרטורים ליניאריים לניקוי מידע אקראי רועש.',
                    n: 0.096,
                },
            },
        },
        {
            i: 976,
            $: {
                '0': { v: '236216', n: 1 },
                '1': { v: 'גרפיקה ממוחשבת 1', n: 0.577 },
                '2': {
                    v: 'שימושים של גרפיקה ממוחשבת ומערכות גרפיות מתקדמות. גרפיקה רסטרית וגיאומטריה על הסריג הדיסקרטי. טרנספורמציות דו- ותלת-ממדיות. יצוג ותצוגה של עקומים ומשטחים פרמטריים ושל גופים תלת ממדיים. הסרת הבלתי נראה, מודלים של הצלה והצללה, מיפוי מרקמים, ומודלים של צבע.\nתוצאות למידה: בסיום הקורס הסטודנטים והסטודנטיות יהיו מסוגלים:\n1. לבנות מערכת תוכנה ל RENDERING של מודלים תלת ממדיים (כולל: רסטריזציה, הסרת הנסתר, הצללה, CLIPPING).\n2. להבין את התכונות המתמטיות והשימושים בגרפיקה של טרנספורמציות לינאריות דו-ממדיות ותלת ממדיות.\n3. להבין את הבנייה של עקומים ומשטחים פרמטריים ואת שימושיהם במידול גיאומטרי._\n4. להכיר ולדעת לממש מודלים של יצירת צל ומיפוי מרקמים.\n5. לדעת לתכנת מצלילים באמצעות OPENGL._',
                    n: 0.102,
                },
            },
        },
        {
            i: 977,
            $: {
                '0': { v: '236267', n: 1 },
                '1': { v: 'מבנה מחשבים', n: 0.707 },
                '2': {
                    v: 'מדדי ביצועים והקשר בינם לבין ארכיטקטורות, שיטות למדידת ביצועים. תלויות בקרה וחיזוי קפיצות. עקרון זרם מידע (DATAFLOW), שבירת תלויות מדומות. מעבדים סופרסקלרים ( OUT-OF-ORDER, VLIW). מערכת הזיכרון ומערכת האחסון. טכנולוגיות זיכרון ומגבלותיהן, זיכרונות מטמון, היררכיית מטמונים, קוהרנטיות מטמונים וקונסיסטנטיות זיכרון. זיכרון מדומה, תרגום מהיר של כתובות ,(TLB) הרחבות למכונות וירטואליות. ריבוי חוטים בחומרה ( SMT, GPGPU). מעבדים בעלי קונפיגורציה משתנה (FPGA , CGRA). תוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל להבין:\n1. את אבני הבניין של המחשב, את אופן העבודה של מעבדים מודרנים, ושיטות לתכנון.\n2. מדדים לביצועי מעבדים ומערכת המחשב.\n3. שיקולי תכנון מערכתיים של מערכות מחשב.\n4. הקשרים וההשפעות ההדדיות בין רכיבי המעבד ומערכת המחשב.',
                    n: 0.099,
                },
            },
        },
        {
            i: 978,
            $: {
                '0': { v: '236271', n: 1 },
                '1': { v: 'פיתוח מבוסס אנדרואיד', n: 0.577 },
                '2': {
                    v: 'הקורס יילקח במקביל לקורס "פרויקט פיתוח מבוסס אנדרואיד" ובמסגרתו ילמדו הסטודנטים את עקרונות הפיתוח באנדרואיד, משלב תכנון ועיצוב היישומון (האפליקציה), אל שלב המימוש. בנוסף הקורס ילמד עקרונות פיתוח זמישיים ) AGILE SOFTWARE DEVELOPMENT ( הנחוצים לעבודת צוות על בסיס השיטות SCRUM ו-EXTREME PROGRAMMING. תוצאות למידה:\nבסיום הקורס הסטודנט/ית יהיה/תהיה מסוגל/ת: 1. לתכנן אפליקציית אנדרואיד לפי עקרונות MATERIAL DESIGN.\n2. לממש אפליקציית אנדרואיד המשלבת גישה לרכיבי חומרה ותוכנה בטלפון ובענן.\n3) להסביר את תהליך ניהול הפרויקט האג\'ילי SCRUM, וכן שיטות הנדסיות מתוך מתודולוגית EXTREME PROGRAMMING.',
                    n: 0.111,
                },
            },
        },
        {
            i: 979,
            $: {
                '0': { v: '236272', n: 1 },
                '1': { v: 'פרויקט פיתוח מבוסס אנדרואיד', n: 0.5 },
                '2': {
                    v: 'במסגרת הפרויקט יפתחו הסטודנטים יישומונים (אפליקציות) לטלפונים חכמים מבוססי מערכת ההפעלה אנדרואיד. כתיבת האפליקציה משלבת תכנות בספריות ייעודיות של מערכת ההפעלה, הכולל גישה לרכיבי חומרה, כגון GPS ומצלמה, וכן גישה לשירותי ענן, כגון שירותים לאחסון מידע ולמידה חישובית. העבודה תתבצע בקבוצות של 3 סטודנטים תוך שימוש בשיטות פיתוח זמישיות. ( AGILE SOFTWARE DEVELOPMENT ). בסיום הסמסטר, הסטודנטים יעלו את האפליקציה לחנות האפליקציות של גוגל, יציגו ויתעדו אותה. נדרש ללמוד קורס זה יחד עם הקורס 236271. תוצאות למידה: בסיום הקורס הסטודנט/ית יהיה/תהיה מסוגל/ת: לתכנן ולממש אפליקציות עבור מערכת ההפעלה אנדרואיד המשלבות גישה לרכיבי חומרה ותוכנה בטלפון ובענן.',
                    n: 0.102,
                },
            },
        },
        {
            i: 980,
            $: {
                '0': { v: '236309', n: 1 },
                '1': { v: 'מבוא לתורת הצפינה', n: 0.577 },
                '2': {
                    v: 'מושגי יסוד: תיקון שגיאות, גילוי שגיאות ותיקון מחיקות. קודים לינאריים. קודי HAMMING. מבוא לתורת השדות הסופיים. קודי REED-SOLOMON, קודי BCH וקודי ALTERNANT. אלגוריתמי פענוח. חסמים על הפרמטרים של קודים לתיקון שגיאות.',
                    n: 0.18,
                },
            },
        },
        {
            i: 981,
            $: {
                '0': { v: '236313', n: 1 },
                '1': { v: 'תורת הסיבוכיות', n: 0.707 },
                '2': {
                    v: 'היררכיה של סיבוכיות זיכרון וזמן, וקיום פערים. הרחבות של מושג הרדוקציה היעילה. בעיות ספירה. מכונות טיורינג מתחלפות וההיררכיה הפולינומיאלית. מכונות טיורינג בעלות אוב. סיבוכיות מעגלים בוליאניים וחישובים מקביליים. חישובים המסתייעים בהטלת מטבע. הוכחות אינטראקטיביות.',
                    n: 0.171,
                },
            },
        },
        {
            i: 982,
            $: {
                '0': { v: '236322', n: 1 },
                '1': { v: 'מערכות אחסון מידע', n: 0.577 },
                '2': {
                    v: 'התקני אחסון: זיכרון, פלאש ודיסקים קשיחים, מערכי דיסקים. מסדי נתונים רלציוניים ומאגרי מפתח-ערך. פעולות על קבצים ומסדי נתונים: מיון, תזמון חוצצים, MAPREDUCE. מבני נתונים בזיכרון משני: עצים, ערבול, ערבול מבוזר, ואינדקסים מורכבים. בקרת מקביליות: סדרתיות, מנעולים ופרוטוקולים מבוססי מנעולים וחותמות-זמן, מקביליות במסדי נתונים מבוזרים. שרידות: התאוששות, שיכפול. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להבין את היתרונות והמגבלות של אמצעי אחסון מסוגים שונים.\n2. להשתמש באלגוריתמים ובמבני אינדקס שונים לביצוע פעולות (כגון מיון) וחישוב שאילתות על מידע השמור בזיכרון המשני.\n3. להבין פתרונות שונים לבעיות הנובעות ממקביליות בעיבוד נתונים במערכות אחסון.\n4. להתמודד עם נפילות במערכת ולהשתמש ביומן ובשכפול להשגת שרידות של נתונים.\n5. להבין את העקרונות של מערכות קבצים מבוזרים.',
                    n: 0.097,
                },
            },
        },
        {
            i: 983,
            $: {
                '0': { v: '236323', n: 1 },
                '1': { v: "פרויקט בעיבוד נתונים מ'", n: 0.5 },
                '2': {
                    v: 'בקורס זה יפתחו הסטודנטים פרוייקט גדול בעיבוד נתונים. פיתוח הפרוייקט יכלול את שלבי האיפיון, התיכון והיישום, כאשר כל שלב ילווה בתיק תיעוד מפורט. הפרוייקט ייושם על מערכת ניהול מסד נתונים. העבודה תתבצע בצוותים של 3-4 סטודנטים, בהנחית המרצה. חומר רקע בנושאי הפרויקט יועבר בתחילת הקורס.',
                    n: 0.149,
                },
            },
        },
        {
            i: 984,
            $: {
                '0': { v: '236329', n: 1 },
                '1': { v: 'עיבוד ספרתי של גאומטריה', n: 0.5 },
                '2': {
                    v: 'מושגים כלליים על רשתות פוליגונליות תלת-מימדיות (קישוריות, גאומטריה, טופולוגיה). פישוט וקידוד של רשתות. רשתות פרוגרסיביות. פרמטריזציה של רשתות. הפקת תמונות של רשתות. יצירה של רשתות (מתוך קבוצות של נקודות, מידע נפחי, תאור ע"י שפות). מעבר מרשתות למשטחים ע"י חלוקה רקורסיבית.',
                    n: 0.158,
                },
            },
        },
        {
            i: 985,
            $: {
                '0': { v: '236332', n: 1 },
                '1': { v: 'האינטרנט של הדברים - טכנולוגיות', n: 0.447 },
                '2': {
                    v: 'רקע תאורטי של טכנולוגית ה- IOT וכלים לפיתוח של פרויקט מעשי של מערכות IOT חכמות המשלבות שרותי אחסון ומחשוב עננים, טלפונים חכמים ומיקרו בקרים. הרקע התאורטי מכיל מבוא ל- IOT, מבוא ל- BIG DATA במערכות IOT, פרקים נבחרים בתקשורת מחשבים, רשתות אלחוט ומחשוב עננים, וסקירה של בעיות בהגנת מערכות ממוחשבות עם דגש על IOT. בנוסף, הקורס מכיל מבוא לתכנות מיקרו בקרי IOT ומבוא לאלקטרוניקה בסיסית. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: - להבין את הסביבה שבה פועלים מוצרי IOT, - להבין כיצד עובדת תקשורת נתונים אלחוטית במערכות IOT, - להבין את בעיות אבטחת התוכנה במערכות IOT, - לתכנן מעגל בסיסי באלקטרוניקה ואפליקציות חומרה ותוכנה עם בקרי ארדואינו, - לבנות יישומי IOT בבית חכם, ערים חכמות ועוד, המשתמשים במחשוב עננים ובטלפון חכם. נדרש ללמוד קורס זה יחד עם הקורס 236333.',
                    n: 0.088,
                },
            },
        },
        {
            i: 986,
            $: {
                '0': { v: '236333', n: 1 },
                '1': { v: 'פרויקט באינטרנט של הדברים', n: 0.5 },
                '2': {
                    v: 'במסגרת הפרויקט יפתחו הסטודנטים אב טיפוס למוצר IOT. מוצר זה משלב תכנות מבוסס שירותי ענן, טלפון חכם, מיקרו-בקרים וחומרות שונות. העבודה מתבצעת בקבוצות של 3-2 סטודנטים. בסיום הקורס מוצג מוצר ומוגש דו"ח כתוב. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: לתכנן ולבנות יישומי IOT משולבי חומרה ותוכנה המבוססים על בקרי ארדואינו ומשתמשים במחשוב עננים ובטלפון חכם.נדרש ללמוד קורס זה יחד עם הקורס 233632.',
                    n: 0.126,
                },
            },
        },
        {
            i: 987,
            $: {
                '0': { v: '236334', n: 1 },
                '1': { v: 'מבוא לרשתות מחשבים', n: 0.577 },
                '2': {
                    v: 'רשתות PACKET SWITCHING לעומת רשתות CIRCUIT SWITCHING. מודל השכבות, קודים לגילוי ולתיקון שגיאות, פרוטוקול ARQ לשכת הקו, תורת התורים, תת השכבה לבקרת הגישה לערוצים משותפים, רשתות ETHERNET, רשתות סלולריות, רשתות אלחוטיות, ערוצי SONET ורשתות טבעת, גישור רשתות מקומיות, מבוא לאינטרנט ולפרוטוקולי TCP/IP.',
                    n: 0.154,
                },
            },
        },
        {
            i: 988,
            $: {
                '0': { v: '236340', n: 1 },
                '1': { v: 'פרויקט בתקשורת מחשבים', n: 0.577 },
                '2': {
                    v: 'מטרת הפרויקט להעמיק את הידע של הסטודנטים בפרוטוקולי תקשורת ולאפשר להם להתנסות במחקר ובפיתוח של פרוטוקולים אלה. הסטודנטים יבצעו פרויקט מקיף וחדשני בתחומים שהם בקדמת הטכנולוגיה של רשתות תקשורת מחשבים והאינטרנט. הפרויקט יבוצע בד"כ על פלטפורמת LINUX תוך שימוש בכלים מתקדמים לסימולציה של רשתות. תוצאות למידה: בסיום הפרויקט הסטודנט יהיה מסוגל לבצע מטלות תכנותיות מורכבות הקשורות לפרוטוקולי תקשורת וטכנולוגיות רשת חדשניות.',
                    n: 0.128,
                },
            },
        },
        {
            i: 989,
            $: {
                '0': { v: '236342', n: 1 },
                '1': { v: 'מבוא לאימות תוכנה', n: 0.577 },
                '2': {
                    v: 'הכרת שיטות שונות לאימות תכניות ביחס למפרטים נתונים. הקורס מורכב משני חלקים. החלק הראשון סוקר שיטות דדוקטיביות. החלק השני סוקר שיטות בדיקת מודל. גישה דדוקטיבית (תכניות קלט-פלט): נכונות חלקית ועצירה של תכניות תרשימי זרימה. הגישה המצרפית-נכונות חלקית ועצירה. גישת בדיקת-מודל (תכניות תגובתיות): לוגיקות טמפורליות פסוקיות ומבני קריפקה. בדיקת מודל CTL עם הוגנות. הצגת BDDS ושימושיהם. בדיקת מודל סימבולית מבוססת BDDS. בדיקת מודל סימבולית חסומה, מבוססת SAT. הכרה והפעלה של כלי תוכנה לבדיקת-מודל.',
                    n: 0.118,
                },
            },
        },
        {
            i: 990,
            $: {
                '0': { v: '236343', n: 1 },
                '1': { v: 'תורת החישוביות', n: 0.707 },
                '2': {
                    v: 'מכונות טורינג, מודלי חישוב שונים ושקילותם למכונות טורינג. התזה של צ\'רץ. מושג המכונה האוניברסלית. בעיות בלתי כריעות. סיבוכיות זמן וסיבוכיות מקום. מושג הרדוקציה והרדוקציה הפולינומית. חסמים לחישוב דטרמיניסטי ולא דטרמיניסטי והקשר ביניהם. משפט קוק.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להכיר מודלים של חישוב, בפרט את מודל מכונת טיורינג.\n2. להבדיל בין בעיות כריעות לבעיות בלתי כריעות.\n3. להכיר את מושג החישוב היעיל (בזמן או בזיכרון), ויוכל לסווג בעיות לכאלה הניתנות לפתרון יעיל ובעיות "קשות חישובית".\n4. להבין וליישם את מושג הרדוקציה בין בעיות.',
                    n: 0.11,
                },
            },
        },
        {
            i: 991,
            $: {
                '0': { v: '236346', n: 1 },
                '1': { v: 'פרויקט באימות תכניות בעזרת מחשב', n: 0.447 },
                '2': {
                    v: 'פיתוח כלים (מערכות תוכנה) לאימות של תכניות בעזרת מחשב. שיפור והתאמת כלים קיימים לשימוש בהקשרים רחבים יותר. שימוש בכלים לאימות תכניות מורכבות.',
                    n: 0.213,
                },
            },
        },
        {
            i: 992,
            $: {
                '0': { v: '236349', n: 1 },
                '1': { v: 'פרויקט באבטחת מידע', n: 0.577 },
                '2': {
                    v: 'במסגרת קורס זה הסטודנטים יתכננו, יממשו ויתעדו פרויקטים שונים בנושאי אבטחת מידע. הסטודנטים יעבדו בהנחיה צמודה.',
                    n: 0.25,
                },
            },
        },
        {
            i: 993,
            $: {
                '0': { v: '236350', n: 1 },
                '1': { v: 'הגנה ברשתות', n: 0.707 },
                '2': {
                    v: 'מבוא להגנה על מערכות מתוכנתות. הגנה על רשתות מחשבים. חולשות אבטחה. חומות אש. עקרונות תכן בסיסיים. יסודות: סודיות, פרטיות, שלמות, אימות מקור. רקע בקריפטוגרפיה. פרוטוקולי הזדהות ובקרת כניסה. פרוטוקולי אבטחה ברשתות: IPSEC ו-SSL/TLS. אבטחת תקשורת אלחוטית (כולל WEP וחולשותיה). וירוסים ותולעים. PGP.',
                    n: 0.154,
                },
            },
        },
        {
            i: 994,
            $: {
                '0': { v: '236360', n: 1 },
                '1': { v: 'תורת הקומפילציה', n: 0.707 },
                '2': {
                    v: 'שפות ודקדוק. מבנה מהדר. שיטות פריסה בסיסיות. תרגום מכוון ע"י תחביר. טבלות סמלים. ארגון בזמן ריצה, יצירת קוד. אופטימיזציה מקומית וגלובלית.',
                    n: 0.218,
                },
            },
        },
        {
            i: 995,
            $: {
                '0': { v: '236363', n: 1 },
                '1': { v: 'מסדי נתונים', n: 0.707 },
                '2': {
                    v: 'הנושאים הבסיסיים בתאוריה וישום של ניהול מסדי נתונים: המודלים הרלציוני והלוגי. שפות שאילתה: SQL, אלגברה רלציונית (RA) ותחשיב רלציוני (CRD). תכנון מסדי נתונים: דיאגרמות ישויות וקשרים (ERD), תלויות בין נתונים וצורות נורמליות. מידע מובנה למחצה: שפת XML כולל DTD ושפות השאילתה XPATH ו-XQUERY.',
                    n: 0.152,
                },
            },
        },
        {
            i: 996,
            $: {
                '0': { v: '236366', n: 1 },
                '1': { v: "פרויקט במערכות הפעלה מ'", n: 0.5 },
                '2': {
                    v: 'פרויקט מעשי בנושא מחקרי בתחומים שנוגעים למערכות הפעלה כגון וירטואליזציה, מערכות אחסון, מערכות תקשורת, אבטחת מערכות ומערכות ענן. תוצאות למידה: הסטודנטים יתנסו בעבודה מחקרית בנושא מתקדם במערכות הפעלה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 997,
            $: {
                '0': { v: '236369', n: 1 },
                '1': { v: 'תכנות מערכות ברשת האינטרנט', n: 0.5 },
                '2': {
                    v: 'בניית יישומים ומערכות מורכבות באינטרנט. בפרט, עקרונות (בסיסיים ומתקדמים) וטכנולוגיות פיתוח עבור המרכיבים המרכזיים של מערכות אלו: צד הלקוח (הדפדפן), צד השרת, תקשורת לקוח-שרת ברשת, שירותים משמעותיים כגון מסד הנתונים, ואבטחה באינטרנט. הקורס יתמקד בטכנולוגיות פיתוח כוללות עבור מערכות אלו (FULL STACK), בדגש על מערכות גדולות מורכבות. תוצאות למידה: בסיום הקורס, הסטודנטיות והסטודנטים ידעו:\n1. לתכנן ולפתח יישומים באינטרנט ( FULL-STACK DEVELOPMENT ).\n2. לתכנן מערכות תוכנה מורכבות ומרובות משתתפים.\n3. עקרונות יישומים בצד הלקוח (FRONT END): איך דפדפן עובד וממומש,תכנות אסינכרוני בממשק משתמש, שפות הפיתוח JAVASCRIPT ,CSS ,HTML ו- TYPESCRIPT. 4. לפתח יישומים בספריות מבוססות JAVASCRIPT כגון NODE.JS ו- REACT. 5. עקרונות פיתוח בצד השרת (BACK END): שרתים ופרוטוקולים, HTTP/HTTPS, זיכרון בין פניות ( SESSION, COOKIE ) מיקרו-שירותים ( MICROSERVICES ), אימות משתמשים (AUTHENTICATION), תכנות מונחה אירועים.\n6. להשתמש במסדי נתונים במסגרת יישום באינטרנט.\n7. סיכוני אבטחה באינטרנט, חולשות נפוצות של מערכות באינטרנט, כלים לאבטחת מידע באינטרנט (כגון ערוצים מאובטחים) ושילובם בכלי פיתוח מודרניים.',
                    n: 0.082,
                },
            },
        },
        {
            i: 998,
            $: {
                '0': { v: '236370', n: 1 },
                '1': { v: 'תכנות מקבילי ומבוזר לעיבוד נתונים', n: 0.447 },
                '2': {
                    v: 'סקירת שפות תכנות מקביליות, מנגנונים לסנכרון ולתקשורת בין תהליכים, מודלי זיכרון, חיפוש בגים, שעונים ווקטורים. חומרה מקבילית כולל מאיצים ווקטורים. הקורס כולל תרגילי תכנות. הקורס נותן דגש מיוחד על השימוש בכל הכלים הנ ל לעיבוד מידע מקבילי ומבוזר וכן לשימוש במקביליות לצרכי למידה חישובית, תחת הרציונל שתחומים אילו הם השימושים החשובים ביותר של מקביליות ועיבוד מבוזר כיום.\nתוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל:\n1. להבין איך לנצל משאבי חישוב מקביליים ומבוזרים, ובפרט לצרכי עיבוד מידע ולמידה חישובית ואיך למדוד את האפקטיביות של ניצול כזה.\n2. לדעת את האפשרויות השונות בעיבוד מידע מקבילי ומבוזר וכן את המגמות העדכניות בתחום.',
                    n: 0.102,
                },
            },
        },
        {
            i: 999,
            $: {
                '0': { v: '236374', n: 1 },
                '1': { v: 'שיטות הסתברותיות ואלגוריתמים', n: 0.577 },
                '2': {
                    v: 'שיטות הסתברותיות בקומבינטוריקה ויישומיהן האלגוריתמיים. השיטה הבסיסית - חוק בייס ואיחוד מאורעות. לינאריות התוחלת - שימוש בסיסי והגרלות עם תיקונים. למת הבידוד. שיטות ריכוז - המומנט השני, חסימת סטיות גדולות ומרטינגלים. הלמה הלוקלית. אי-שוויוני קורלציות. שיטת האנטרופיה - המשוואות הבסיסיות ושימושים. מבוא להילוכים מקריים. תוצאות למידה: בסיום הקורס הסטודנט:1. יהיה בעל ידע בשיטות הסתברותיות בניתוח אלגוריתמים ובקומבינטוריקה, כולל הוכחתהמשפטים הדרושים ויישומם. 2. יצבור ידע וניסיון בפתרון בעיות מהסוג המופיע באופן טבעי במחקרים בתאוריה של מדעי המחשב.',
                    n: 0.115,
                },
            },
        },
        {
            i: 1000,
            $: {
                '0': { v: '236378', n: 1 },
                '1': { v: 'עקרונות ניהול מידע חסר ודאות', n: 0.447 },
                '2': {
                    v: 'מושגי יסוד של שפות שאילתה עם דגש על כוח ביטוי וסיבוכיות, ופרט ניצול תכונות של אי מעגליות (או אי מעגליות "מקורב") לצורך מענה על שאילתות. התורה הבסיסית של המרת מידע, ובפרט הדרכים המקובלות להתמודד עם חוסר הוודאות המובנה בתהליך. עקרונות ודרכים לניהול מידע לא ודאי: אוספי מידע לא שלמים, מידע לא עקבי, ומידע הסתברותי. בכל אחת מתצורות חוסר הוודאות, הקורס יתמקד בשפות וסמנטיקה של הייצוג, וחישובי שאילתות. תוצאות למידה: בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין את ההבדלים בין שפות שאילתה, 2. להכיר מושגי יסוד בסיבוכיות תאורטית של ניתוח מידע, 3. להכיר את התורה הבסיסית של המרת מידע, 4. להכיר גישות שונות למידול חוסר ודאות במידע, וגישות שונות לשאילתות מעל מידע חסר ודאות, 5. להכיר ולהבין משפטים מרכזיים בסיבוכיות שאילתות על מידע חסר ודאות.',
                    n: 0.09,
                },
            },
        },
        {
            i: 1001,
            $: {
                '0': { v: '236379', n: 1 },
                '1': { v: 'קידוד ואלגוריתמים לזכרונות', n: 0.577 },
                '2': {
                    v: 'זכרונות ומערכות לאחסון מידע, צפנים לכתיבות חוזרות וצפנים לכתיבה חד פעמית, מבנה זכרונות פלאש, הקשר בין הגברת כתיבה וגודל הזכרון, אלגוריתמים לניקוי זכרונות, מימוש צפנים בזכרונות פלאש, צפנים לתאים תקועים, צפנים עבור אילוצים בזכרונות, אפנון דרגות בזכרונות פלאש וצפנים מעל תמורות, צפנים לתיקון מחיקות, צפני שחזור מילים, צפנים עבור מערכות אחסון מבוססות דנ"א, וחסמים על קודים. תוצאות למידה: בסוף הקורס, הסטודנט יהיה בעל הבנה של: 1) קידודים ואלגוריתמים לזכרונות ומערכות אחסון מידע, 2) בניית צפנים עבור תיקון שגיאות ואילוצים בזכרונות.',
                    n: 0.112,
                },
            },
        },
        {
            i: 1002,
            $: {
                '0': { v: '236381', n: 1 },
                '1': { v: "פרויקט ב- וי.אל.אס.אי. ב'", n: 0.5 },
                '2': {
                    v: 'במסגרת קורס זה הסטודנטים יתכננו, יממשו ויתעדו פרוייקטים שונים בנושאים הקשורים ל-VLSI. לכל פרוייקט צמוד מנחה (בדרך כלל המנחים הם המציעים את הפרוייקט). רשימת הפרוייקטים המוצעים והמנחים מפורסמת בתחילת הסמסטר. הסטודנטים עובדים בזוגות בהנחיה צמודה של המנחה והמהנדס האחראי על המעבדה ל- VLSI.',
                    n: 0.152,
                },
            },
        },
        {
            i: 1003,
            $: {
                '0': { v: '236388', n: 1 },
                '1': { v: 'פרויקט במערכות אחסון', n: 0.577 },
                '2': {
                    v: 'פרויקט מעשי בנושא מחקרי בתחומים שנוגעים למערכות אחסון כגון ניהול זיכרון, מערכות קבצים, מערכות אחסון מבוזרות, דדופליקציה, קודים לתיקון מחיקות, והתקני אחסון פיזיים. תוצאות למידה: בסיום הפרויקט הסטודנט יהיה מסוגל לבצע מטלות תכנותיות מורכבות הקשורות לטכנולוגיות מתקדמות במערכות אחסון.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1004,
            $: {
                '0': { v: '236491', n: 1 },
                '1': { v: 'תכנות מאובטח', n: 0.707 },
                '2': {
                    v: 'חולשות בשפות תכנות ומערכות הפעלה. ניתוח מעמיק של התקפות חריגות ממחסנית ו-ROP (התקפות RETURN ORIENTED ), והגנות כנגדן. התקפות על בסיסי נתונים (כגון SQL INJECTION) והגנות כנגדן. אבטחה על ידי בקרת זרימה. ארגזי חול. ניהול זיכרון מאובטח. שיטות לתכנות בטוח. תכנון לאבטחה ( SECURITY BY DESIGN ). דוגמת שרתי דוא"ל מאובטחים. עקרון ההפרדה לאבטחה. הוכחת אבטחה ( ATTESTATION ). הגנה על תוכן ( DRM ). תוצאות למידה: בסיום הקורס הסטודנט: 1. יכיר את מגוון בעיות האבטחה של תכנות בשפות תכנות ובמערכות הפעלה. 2. ידע איך מתבצעות התקפות מרכזיות נגד תכניות לא מאובטחות. 3. יכיר שיטות ומנגנוני אבטחה שיוכל ליישם במערכות אותן יפתח במהלך לימודיו ואחריהם.',
                    n: 0.098,
                },
            },
        },
        {
            i: 1005,
            $: {
                '0': { v: '236496', n: 1 },
                '1': { v: 'הנדסה לאחור', n: 0.707 },
                '2': {
                    v: 'מבוא. הנדסה לאחור של תוכנה: ניתוח סטטי. ניתוח דינמי. פעולת הדיבגר, BREAKPOINTS. הוקינג. הזרקת קוד, IAT, HOT PATCHING. מבנים שונים של יישומי הוקינג. חולשות ושימוש בהן. טיפול בחריגות. שפות מבוססות עצמים ושפות קודי ביניים, JIT. טכניקות אנטי-רברסינג. הסוואות בנוזקה. התקפות ערוצי צד. הנדסה לאחור של חומרה. המבחן הסופי יערך בשני חלקים בני 3 שעות כ"א מול מחשב. תוצאות למידה: בסיום הקורס הסטודנט: 1. יבין איך מבצעים הנדסה לאחור של תוכנה, ויוכל ליישם מגוון טכניקות להבנת פעולת התוכנה ולשינוי פעולתה. 2. ידע טכניקות למניעת ביצוע הנדסה לאחור לתוכנה, ולהפרעה להנדסה לאחור. 3. יכיר את רוחב התחום, כולל היישום לשפות השונות, התקפות ערוצי צד, והנדסה לאחור של חומרה.',
                    n: 0.097,
                },
            },
        },
        {
            i: 1006,
            $: {
                '0': { v: '236499', n: 1 },
                '1': { v: 'פרויקט בחומות אש', n: 0.577 },
                '2': {
                    v: 'תכנון, מימוש ותיעוד פרויקטים שונים בנושאי חומות אש. הסטודנטים יעבדו בהנחיה צמודה. תוצאות למידה: בסיום הקורס הסטודנט ידע חומר תאורטי ויכולת מימוש של חומת אש.',
                    n: 0.2,
                },
            },
        },
        {
            i: 1007,
            $: {
                '0': { v: '236501', n: 1 },
                '1': { v: 'מבוא לבינה מלאכותית', n: 0.577 },
                '2': {
                    v: 'שיטות יוריסטיות לחיפוש במרחבי מצבים. חיפוש בעצי משחק. שיטות ליצוג ידע באמצעות: לוגיקה, רשתות סמנטיות, מערכות מסגרת, רשתות הסתברותיות. נושאים נוספים לפי בחירת המרצה: מערכות לומדות, עיבוד שפות טבעיות, מערכות מומחה, תכנון.',
                    n: 0.177,
                },
            },
        },
        {
            i: 1008,
            $: {
                '0': { v: '236502', n: 1 },
                '1': { v: 'פרויקט בבינה מלאכותית', n: 0.577 },
                '2': {
                    v: 'קורס זה כולל פרויקט גדול בבינה מלאכותית. הסטודנטים יעבדו יחידים או בצוותים בהנחיה צמודה של אסיסטנט.',
                    n: 0.25,
                },
            },
        },
        {
            i: 1009,
            $: {
                '0': { v: '236503', n: 1 },
                '1': { v: 'פרויקט תכנות מתקדם במדעי המחשב 1', n: 0.408 },
                '2': {
                    v: 'פרויקט מחקר או קדם-מחקר הכולל סקר ספרות, מימוש באמצעות כתיבת תוכנה וכתיבת דו"ח מסכם. הסטודנטים יעבדו בקבוצות קטנות, לעיתים בהנחיית אסיסטנט. נושא הפרויקט יקבע ע"י המנחה בתיאום עם הסטודנטים. סמסטר ב\' תשע"ט: פרויקט בתוכנה.',
                    n: 0.171,
                },
            },
        },
        {
            i: 1010,
            $: {
                '0': { v: '236504', n: 1 },
                '1': { v: 'פרויקט המשך בתוכנה', n: 0.577 },
                '2': {
                    v: 'ביצוע פרויקט תוכנה, תוך הרחבת פרויקט שהתבצע באחד הפרויקטים האחרים בפקולטה.',
                    n: 0.302,
                },
            },
        },
        {
            i: 1011,
            $: {
                '0': { v: '236521', n: 1 },
                '1': { v: 'אלגוריתמי קירוב', n: 0.707 },
                '2': {
                    v: 'אחת הדרכים להתמודד עם בעיות NP קשות היא בעזרת חישוב פתרון מקורב. השאלה הטיפוסית הנשאלת בהקשר זה היא מהו הקרוב הטוב ביותר שניתן להשיג כאשר זמן הריצה פולינומי. בקורס יוגדרו מושגי יסוד הקשורים לאלגוריתמי קרוב כגון: סכימות קרוב וסכימות קרוב פולינומיות מלאות ( FPAS ). נדון בקשת רחבה של טכניקות לקרוב בעיות באופטימיזציה קומבינטורית.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1012,
            $: {
                '0': { v: '236523', n: 1 },
                '1': { v: 'מבוא לביואינפורמטיקה', n: 0.707 },
                '2': {
                    v: 'יסודות אלגוריתמיים, סטטיסטיים ומעולם למידת המכונה המשמשים להבנת הגנום האנושי, האפיגנום, האבולוציה ומנגנוני מחלות. בכל שעור תתואר בעיה מתחום הביואינפורמטיקה, כולל הרקע הביולוגי שלה, ויוצגו עקרונות חישוביים לפתרון הבעיות. היישומים הביולוגיים בהם נעסוק יכללו: ניתוח רצף גנטי, ניתוח ביטוי גנים, רגולציה גנומית ואפיגנומית, קיפול חלבונים, וריאציה ואסוציאציות גנטיות, מיפוי מחלות, גנטיקה של אוכלוסיות, גנומיקה של סרטן וגנומיקה של תאים בודדים. נלמד גם ליישם את העקרונות בעזרת כלים ובסיסי נתונים מרכזיים מעולם הביואינפורמטיקה. במהלך הקורס יינתנו ארבעה תרגילי בית ,ובסוף הקורס התלמידים יבצעו פרויקט מחקרי מודרך ויציגו אותו ביום פוסטרים מרוכז. תוצאות למידה:\nבסיום הקורס הסטודנטים יוכלו:\n1. להסביר עקרונות מרכזיים מעולם מדעי החיים.\n2. להסביר ולהדגים אלגוריתמים וכלים סטטיסטיים מרכזיים הנמצאים בשימוש לפתרון בעיות בביואינפורמטיקה.\n3. לנתח סוגים שונים של מידע ביולוגי בעזרת כלים חישוביים.\n4. לתכנן ולבצע פרויקט מחקרי (קטן היקף) תוך שימוש במאגרי מידע ביולוגיים וכלים חישוביים.',
                    n: 0.086,
                },
            },
        },
        {
            i: 1013,
            $: {
                '0': { v: '236524', n: 1 },
                '1': { v: 'פרוייקט בביואינפורמטיקה', n: 0.707 },
                '2': {
                    v: 'הסטודנטים יתכננו, יממשו ויציגו פרוייקטים שונים בנושאי ביואינפורמטיקה. הפרוייקטים יוצעו על בסיס מאמרים מן הספרות השוטפת, ויכללו מימוש כלים, הרצתם של נתונים סינטתיים (סימולציות), ולבסוף הרצתם על נתונים גנומיים-ביולוגים. רשימת הפרוייקטים המוצעים תפורסם בתחילת הסמסטר. הסטודנטים יעבדו בזוגות בהנחיה צמודה.',
                    n: 0.158,
                },
            },
        },
        {
            i: 1014,
            $: {
                '0': { v: '236605', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי המחשב 5', n: 0.447 },
                '2': {
                    v: 'יוצגו תוצאות חדישות וכיווני מחקר נוכחיים בנושאים הנמצאים בחזית המחקר במדעי המחשב.',
                    n: 0.289,
                },
            },
        },
        {
            i: 1015,
            $: {
                '0': { v: '236606', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי המחשב 6', n: 0.447 },
                '2': {
                    v: 'במסגרת הקורס יוצגו תוצאות חדישות וכיווני מחקר נוכחיים בנושאים הנמצאים בחזית המחקר במדעי המחשב. סמסטר ב\' תשע"ח: למידה עמוקה. סמסטר א\' תשע"ט: למידה עמוקה. סמטר ב\' תשע"ט: אלגוריתמים מבוזרים בגרפים.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1016,
            $: {
                '0': { v: '236607', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי המחשב 7', n: 0.447 },
                '2': {
                    v: 'במסגרת הקורס יוצגו תוצאות חדישות וכיווני מחקר נוכחיים בנושאים הנמצאים בחזית המחקר במדעי המחשב. סמסטר א\' תשע"ו: אבטחת מידע סמסטר ב\' תשע"ז: אבטחת מידע סמסטר א\' תשע"ח: אבטחת מחשבים סמסטר ב\' תשע"ח: אבטחת מחשבים. סמסטר א\' תשע"ט אבטחת מחשבים',
                    n: 0.16,
                },
            },
        },
        {
            i: 1017,
            $: {
                '0': { v: '236608', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי המחשב 8', n: 0.447 },
                '2': {
                    v: 'יוצגו חידושים וכיווני מחקר נוכחיים בנושאים הנמצאים בחזית המחקר במדעי המחשב. סמסטר א\' תשע"ט: קידוד ואלגוריתמים לזכרונות.',
                    n: 0.243,
                },
            },
        },
        {
            i: 1018,
            $: {
                '0': { v: '236609', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי המחשב 9', n: 0.447 },
                '2': {
                    v: 'יוצגו חידושים וכיווני מחקר נוכחיים בנושאים הנמצאים בחזית המחקר במדעי המחשב. סמסטר א\' תשע"ח: תורת המשחקים החישובית (בדגש על תכנון שווקים).',
                    n: 0.218,
                },
            },
        },
        {
            i: 1019,
            $: {
                '0': { v: '236610', n: 1 },
                '1': { v: 'נושאים מתקדמים במדעי המחשב 01', n: 0.447 },
                '2': {
                    v: 'יוצגו חידושים וכיווני מחקר נוכחיים בנושאים הנמצאים בחזית המחקר במדעי המחשב. סמסטר ב\' תשע"ז: אלגוריתמים לבעיות תת-מודולריות. סמסטר ב\' תשע"ח: אלגוריתמים מבוזרים בגרפים.',
                    n: 0.209,
                },
            },
        },
        {
            i: 1020,
            $: {
                '0': { v: '236620', n: 1 },
                '1': { v: "נושאים מתקדמים באלגוריתמים ה'", n: 0.5 },
                '2': {
                    v: 'יוצגו מחקרים וכיווני מחקר עדכניים באלגוריתמים.',
                    n: 0.408,
                },
            },
        },
        {
            i: 1021,
            $: {
                '0': { v: '236621', n: 1 },
                '1': { v: "נושאים מתקדמים באלגוריתמים ה'+ת'", n: 0.5 },
                '2': {
                    v: 'יוצגו תוצאות חדישות וכיווני מחקר נוכחיים באלגוריתמים.',
                    n: 0.378,
                },
            },
        },
        {
            i: 1022,
            $: {
                '0': { v: '236651', n: 1 },
                '1': { v: "נושאים מתקדמים בהנדסת תוכנה ה'+ת'", n: 0.447 },
                '2': { v: 'מחקרים עדכניים בהנדסת תוכנה.', n: 0.5 },
            },
        },
        {
            i: 1023,
            $: {
                '0': { v: '236703', n: 1 },
                '1': { v: 'תכנות מונחה עצמים', n: 0.577 },
                '2': {
                    v: 'גישה השוואתית לתכנות מונחה עצמים בשפות שונות. מושג העצם. מחלקות ומתודות, טיפוסי נתונים מופשטים, תורשה חד-כיוונית ורב-כיוונית. שימוש לצורך מימוש ממשקי משתמש. כתיבת תכניות בשפות תמ"ע שונות כולל JAVA, SMALLTALK ו ++C.',
                    n: 0.177,
                },
            },
        },
        {
            i: 1024,
            $: {
                '0': { v: '236719', n: 1 },
                '1': { v: 'גאומטריה חישובית', n: 0.707 },
                '2': {
                    v: 'טכניקות בסיסיות, מבני נתונים ואלגוריתמים לפתרון בעיות גאומטריות כגון חישובי קמור, חיתוכים של קטעים ישרים, דיאגרמת וורונוי ושילוש דלוני של קבוצת נקודות, שילוש פוליגון, חיפוש בתחום, תכנות לינארי, איתור נקודות במרחבים ממימד כלשהו. כן ילמדו מספר נושאים בגאומטריה דיסקרטית (כגון מספר-החיתוך של גרף).',
                    n: 0.152,
                },
            },
        },
        {
            i: 1025,
            $: {
                '0': { v: '236754', n: 1 },
                '1': { v: 'פרויקט במערכות נבונות', n: 0.577 },
                '2': {
                    v: 'קורס זה מיועד לביצוע פרויקט גדול בהקפו בנושאים של רובוטיקה, ראיה ממוחשבת, עיבוד תמונות ומערכות נבונות. הסטודנטים יעבדו בצוותים קטנים (2-3) בהנחיה צמודה של האסיסטנטים ובפיקוח סגל בכיר.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1026,
            $: {
                '0': { v: '236756', n: 1 },
                '1': { v: 'מבוא למערכות לומדות', n: 0.577 },
                '2': {
                    v: 'שיטות סטטיסטיות לסיווג מידע באמצעות דוגמאות, למידת PAC ומימד VC, אלגוריתם NEAREST NEIGHBORS, עצי החלטה, מפרידים לינאריים, אלגוריתם SVM ושיטת גרעין, אופטימיזציה קמורה על-ידיGRADIENT DESCENT וSTOCHASTIC GRADIENT DESCENT, ולידציה ובחירת מודלים, הנחות גנרטיביות ובייס נאיבי ( NAIVE BAYES ), שיטות מכלול, יצירת מאפיינים ובחירתם, רשתות נוירונים, למידה לא מונחית: הורדת מימד, אישכול מידע. תוצאות למידה: בסיום הקורס הסטודנט/ית יהיה/תהיה מסוגל/ת: 1. להכין נתונים לצורך לימוד מכונה: יצירת מאפיינים, בחירת מאפיינים, הפרדה לקבוצת אימון, ניסוי וולידציה. 2. להשתמש באלגוריתמי למידה מונחית ולא מונחית נפוצים, תוך שימוש בספריות תוכנה סטנדרטית והתנסות בנתונים אמיתיים.\n3. להבין את העקרונות המתמטיים העומדים ביסוד החומר הנלמד בשיעורים, לרבות סיבוכיות מספר דוגמאות, סיבוכיות חישובית, זיהוי התאמת-יתר (OVERFITTING) והתאמת-חסר (UNDER FITTING), למידת PAC ומימד VC והמגבלות של תיאוריות אלה.',
                    n: 0.091,
                },
            },
        },
        {
            i: 1027,
            $: {
                '0': { v: '236757', n: 1 },
                '1': { v: 'פרויקט במערכות לומדות', n: 0.577 },
                '2': {
                    v: 'במסגרת המעבדה יערך פרויקט מקיף במערכות לומדות. קורסה זה מהווה המשך הקורס "מבוא למערכות לומדות" ומשמש להעמקתו. נושא הפרוייקט ילקח מאחד התחומים הנלמדים בקורס "מבוא למערכות לומדות": מערכות ללמידת מסווגים, מערכות ללמידת אסטרטגיות חיפוש, אלגוריתמים גנטיים ונושאים נוספים בתחום. הסטודנטים יעבדו יחידים או בקבוצות, בהנחיה ויעוץ של האסיסטנט והמורה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1028,
            $: {
                '0': { v: '236781', n: 1 },
                '1': { v: 'למידה עמוקה על מאיצים חישוביים', n: 0.447 },
                '2': {
                    v: 'הקורס מכסה מגוון רחב של אלגוריתמי למידה עמוקה ויישום יעיל שלהם על חומרה ייעודית. בפרט הקורס יכסה נושאים הבאים: פרספטרון רב-שכבתי, רשתות קונבולוציה, רשתות רקורסיביות, למידה בלתי מונחית, מודלים גנרטיביים, למידה על גרפים, דחיסת רשתות וכו. בחלק החומרתי נסקור ארכיטקטורות ייעודיות עבור אימון והאצת רשתות עצביות עמוקות. תוצאות למידה: בסיום הקורס הסטודנט: 1. ידע אספקטים תאורטיים ומעשיים של בניית רשתות עצביות עמוקות. 2. ידע לבנות רשתות עצביות עמוקות תוך שימוש בחבילות תוכנה ייעודיות. 3. ידע שיטות אופטימיזציה שונות המאפשרות ביצוע יעיל של אפליקציות למידה על מאיצים חישוביים. 4. יבצע פרויקט מחקרי מסכם.',
                    n: 0.104,
                },
            },
        },
        {
            i: 1029,
            $: {
                '0': { v: '236801', n: 1 },
                '1': { v: 'סמינר במדעי המחשב 1', n: 0.5 },
                '2': {
                    v: 'דרישת קדם: נקבעת בהתאם לנושא הקורס. מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים. נושא הסמינר מתפרסם בתחילת כל סמסטר.',
                    n: 0.18,
                },
            },
        },
        {
            i: 1030,
            $: {
                '0': { v: '236802', n: 1 },
                '1': { v: 'סמינר במדעי המחשב 2', n: 0.5 },
                '2': {
                    v: 'דרישת קדם: נקבעת בהתאם לנושא הקורס. מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים. נושא הסמינר מתפרסם בתחילת כל סמסטר. סמסטר ב\' תשע"ז: סמינר על קידודים למחיקות במערכות אחסון מבוזר. סמסטר א\' תשע"ח: אלגוריתמים הפועלים במידע מוגבל. סמסטר ב\' תשע"ח: סמינר על קידודים למחיקות במערכות אחסון מבוזר. סמסטר א\' תש"פ: סמינר באימות אוטומטי עבור תכונות אבטחה. סמסטר א\' תשפ"א: סמינר בלמידה עמוקה.',
                    n: 0.117,
                },
            },
        },
        {
            i: 1031,
            $: {
                '0': { v: '236803', n: 1 },
                '1': { v: 'סמינר במדעי המחשב 3', n: 0.5 },
                '2': {
                    v: 'דרישת קדם: בהתאם לנושא הקורס. מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים. נושא הסמינר מתפרסם בתחילת כל סמסטר. סמסטר א\' תשע"ח: סמינר במידע וידע. סמסטר ב\' תשע"ט: סמינר מתקדם בתורת המשחקים החישובית בדגש על למידה. סמסטר א\' תש"פ: נושאים בתכנות מקבילי מודרני.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1032,
            $: {
                '0': { v: '236813', n: 1 },
                '1': { v: 'סמינר באלגוריתמים', n: 0.707 },
                '2': {
                    v: 'פיתוח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים עדכניים, בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים.',
                    n: 0.243,
                },
            },
        },
        {
            i: 1033,
            $: {
                '0': { v: '236817', n: 1 },
                '1': { v: 'סמינר בעיבוד שפה טבעית', n: 0.5 },
                '2': {
                    v: 'מטרת הסמינר היא לפתוח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1034,
            $: {
                '0': { v: '236819', n: 1 },
                '1': { v: 'סמינר ברשתות תקשורת מחשבים', n: 0.5 },
                '2': {
                    v: 'מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1035,
            $: {
                '0': { v: '236825', n: 1 },
                '1': { v: 'סמינר באלגוריתמים מבוזרים', n: 0.577 },
                '2': {
                    v: 'מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח נטיות מחקריות של התלמידים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1036,
            $: {
                '0': { v: '236828', n: 1 },
                '1': { v: 'פרויקט במערכות מחשבים', n: 0.577 },
                '2': {
                    v: 'פרויקט מעשי בנושא מחקרי במערכות מחשבים, בתחומים כגון וירטואליזציה, מערכות אחסון, מערכות תקשורת, אבטחת מערכות, ומערכות חישוב ענן. תוצאות למידה: הסטודנטים יתנסו בעבודה מחקרית בנושא מתקדם במערכות מחשבים.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1037,
            $: {
                '0': { v: '236831', n: 1 },
                '1': { v: 'סמינר בגאומטריה דיסקרטית', n: 0.577 },
                '2': {
                    v: 'מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה, ופיתוח יכולות מחקריות של הסטודנטים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1038,
            $: {
                '0': { v: '236833', n: 1 },
                '1': { v: 'סמינר באוטומטים ושפות פורמליות', n: 0.5 },
                '2': {
                    v: 'מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה, ופיתוח יכולות מחקריות של הסטודנטים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1039,
            $: {
                '0': { v: '236836', n: 1 },
                '1': { v: 'סמינר בתמריצים ולמידה', n: 0.577 },
                '2': {
                    v: 'מטרת הסמינר היא לפתח יכולת קריאה, הבנה וביקורת של מאמרים מקצועיים בעלי רמה גבוהה ופיתוח יכולות מחקריות של הסטודנטים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1040,
            $: {
                '0': { v: '236860', n: 1 },
                '1': { v: 'עיבוד תמונות דיגיטלי', n: 0.577 },
                '2': {
                    v: 'מבוא לראיה ממוחשבת ולעיבוד תמונות. אותות ומערכות ליניאריות בדו-מימד. דגימה ושחזור של תמונה בסריגים אפיניים, תיאור תופעת הקיפול. קוונטיזציה סקלרית ווקטורית, קוונטיזציה בשילוב משוב שגיאה לשיקולים חזותיים, טיפול בתמונות צבע. שיפור תמונות בפעולות נקודה, מסננים ליניאריים ולא ליניאריים, ניקוי רעש, שיפור חדות, גילוי שפות. שחזור תמונה - יסודות, שערוך סטטיסטי מבוסס ML ו-MAP, פונקציות הסתברות לתמונות, שימוש בדוגמאות כתחליף. התמרות ליניאריות ושאינן ליניאריות בדו-מימד. ייצוגים פירמידליים לתמונות. מבוא לתורת האינפורמציה, יתירות בתמונות, דחיסת תמונות ללא אובדן ועם אובדן. טומוגרפיה חישובית - התמרת ראדון והיפוכה, שיטות אלגבריות לשחזור מהיטלים. טיפול בסרטי וידאו - שערוך תנועה, ניקוי רעש בסרט, דחיסת וידאו.',
                    n: 0.101,
                },
            },
        },
        {
            i: 1041,
            $: {
                '0': { v: '236861', n: 1 },
                '1': { v: 'ראיה חישובית גאומטרית', n: 0.577 },
                '2': {
                    v: 'שיטות חישוביות גאומטריות ואלגוריתמים בעיבוד והבנת תמונות. נחקור ישומים כגון שחזור צורות, חידוד תמונות צבע, אינטגרצית שפות, חישוב הסטים, צירי סימטריה, גאודטים מינימליים וחתימות אינוואריאנטיות. נלמד כיצד לשלב ולהשתמש בכלים מורפולוגיה מתמטית, גאומטריה דיפרנציאלית, אלגוריתמים בתורת הגרפים, אנליזה נומרית וחשבון וריאציות.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1042,
            $: {
                '0': { v: '236874', n: 1 },
                '1': { v: 'פרויקט בראיה ממוחשבת', n: 0.577 },
                '2': {
                    v: 'הקורס כולל ביצוע פרוייקט הבוחן נושא מראיה ממוחשבת. המשתתפים יתנסו בניתוח תמונות בעזרת מחשב ויבצעו פרוייקט בנושא. בהרצאה ידון החומר התאורטי העדכני וינתן סיוע לביצוע הפרוייקטים.',
                    n: 0.196,
                },
            },
        },
        {
            i: 1043,
            $: {
                '0': { v: '236901', n: 1 },
                '1': { v: 'אלגוריתמים לתכנון תנועה רובוטי', n: 0.5 },
                '2': {
                    v: 'בקורס נלמד שיטות אלגוריתמיות שונות לפתרון בעיות תכנון תנועה רובוטי. נתחיל בשיטות מדויקות למרחבי קונפיגורציה ממימד נמוך ונעבור למרחבים ממימד גבוה. לאחר מכן נלמד גישות אשר יותר מתאימות למרחבים ממימד גבוה (שיטות מבוססות דגימה וכן חיפוש יוריסטי). לבסוף נדגים איך האלגוריתמים הללו משתלבים באפליקציות רובוטיות כגון התקנים רפואיים. תוצאות למידה: בסיום הקורס הסטודנטים נדרשים: 1. להסביר מושגים בסיסיים ואתגרים בתכנון תנועה רובוטי. 2. לנתח את הסיבוכיות של אלגוריתמי תכנון תנועה רובוטי. 3. להבדיל בין גישות אלגוריתמיות שונות לתכנון תנועה רובוטי. 4. לדרג את ההתאמה של אלגוריתמי תכנון תנועה קיימים לבעיית תכנון תנועה נתונה.',
                    n: 0.104,
                },
            },
        },
        {
            i: 1044,
            $: {
                '0': { v: '236927', n: 1 },
                '1': { v: 'מבוא לרובוטיקה', n: 0.707 },
                '2': {
                    v: 'טרנספורמציות הומוגניות, משוואות קינמטיות וקינמטיקה הפוכה, דינמיקה, בקרת סרוו, תכן מסלולים, הענות, ניווט רובוטי, ניווט רובוטי מונחה חיישנים, ראיה רובוטית ממוחשבת, בקרת רובוטים מבוססת ראיה, שפות פיקוד, תכנון פעולות ובינת מכונה.',
                    n: 0.18,
                },
            },
        },
        {
            i: 1045,
            $: {
                '0': { v: '236990', n: 1 },
                '1': { v: 'מבוא לעיבוד אינפורמציה קוונטית', n: 0.5 },
                '2': {
                    v: 'מושגי יסוד בתורת הקוונטים, בחישוב רגיל והפיך, בתורת האינפורמציה, ובתקשורת. הכללת המונח "ביט" ל-"ביט-קוונטי" ( QUANTUM BIT - QUBIT ), והבדלים בין ביטים קוונטים לקלאסיים ( עקרון אי-שכפול, סביכות ). מודלים של תקשורת, חישוב, הצפנה וקידוד, העקביים עם עקרונות תורת הקוונטים. טלפורטציה קוואנטית. שערים קוונטים, חישוב קוונטי והאלגוריתמים הקוונטים של סימון וגרובר. שימוש בחישוב קוונטי לשבירת קודי הצפנה ופתרון בעיות הנחשבות קשות. האלגוריתם של שור. הצפנה קוונטית והעברת מפתחות סודיים בצורה בטוחה. מבוא קצר למימוש ביטים קוונטים ושערים קוונטיים. תוצאות למידה בסיום הקורס הסטודנט:\n1. יכיר אלגוריתמים ופרוטוקולים קוונטיים ויהיה מסוגל לנתח אותם ולהבין את משמעות השיפורים ושינויים בהם. 2. יבין את היתרונות והקשיים בהשוואה לפרוטוקולים ואלגוריתמים קלאסיים.',
                    n: 0.097,
                },
            },
        },
        {
            i: 1046,
            $: {
                '0': { v: '237267', n: 1 },
                '1': { v: 'מבנה מחשבים', n: 0.707 },
                '2': {
                    v: 'מדדי ביצועים והקשר בינם לבין ארכיטקטורות, שיטות למדידת ביצועים. תלויות בקרה וחיזוי קפיצות. עקרון זרם מידע ( DATAFLOW ) שבירת תלויות מדומות.מעבדים סופרסקלרים ( OUT-OF-ORDER) VLIW ) מערכת הזיכרון ומערכת האחסון. טכנולוגיות זיכרון ומגבלותיהן, זיכרונות מטמון, היררכיית מטמונים, קוהרנטיות מטמונים וקונסיסטנטיות זיכרון. זיכרון מדומה, תרגום מהיר של כתובות ,( TLB ) הרחבות למכונות וירטואליות. ריבוי חוטים בחומרה ) SMT, GPGPU (. מעבדים בעלי קונפיגורציה משתנה ( FPGA, CGRA ). תוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל להבין:\n1. את אבני הבנין של המחשב, את אופן העבודה של מעבדים מודרנים ושיטות לתכנון . 2. מדדים לביצועי מעבדים ומערכת המחשב. 3. שיקולי תכנון מערכתיים של מערכות מחשב. 4. הקשרים וההשפעות ההדדיות בין רכיבי המעבד ומערכת המחשב.',
                    n: 0.094,
                },
            },
        },
        {
            i: 1047,
            $: {
                '0': { v: '238125', n: 1 },
                '1': { v: 'אלגוריתמים נומריים מ', n: 0.577 },
                '2': {
                    v: "מערכות משוואות ליניאריות: חילוץ גאוס ופירוק LU, פירוק צ'ולסקי, מטריצות חיוביות מוגדרות, ריבועים פחותים והיפוך מוכלל של מטריצה, ריבועים פחותים משוקללים, רגולריזצית טיכונוב, מרחבי מכפלה פנימית ומרחבים נורמיים, אורתוגונליות, פירוק QR ושימושיו, ערכים עצמיים וערכים סינגולריים, פירוק SVD ושימושיו, שיטות איטרטיביות בסיסיות למערכות ליניאריות ולבעיות ריבועים פחותים, נורמות של מטריצות, משפט גרשגורן, שיטת החזקה, אי יציבות נומרית ושגיאות נומריות, מטריצות טופליץ וסיבובית, פעולת הקונבולוציה, התמרת פורייה הדיסקרטית ואלגוריתם FFT. תוצאות למידה: בסיום הקורס הסטודננטיות והסטודנטים יהיו מסוגלים:\n1. להשתמש בפירוקי היסוד באלגברה ליניארית נומרית - פירוקי LU, QR, SVD - בהתאם לשימושיהם ומורכבותם החישובית.__\n2. לבנות אלגוריתמים לפתרון מערכות משוואות, בעיות ריבועים פחותים, ובעיות ערכים עצמיים, ולהפעיל כלים מתאימים לפתרונם בהתבסס על בנה הבעיה, מימדיה ועוד.\n3. להוכיח התכנסות של שיטות איטרטיביות לפתרון בעיות נומריות בעזרת ניתוח ערכים עצמיים, נורמות אופרטוריות ומשפט גרשגורן. _\n4. לחשב את התמרת הפוריה הדיסקרטית של וקטורים וללכסן מטריצות סיבוביות בעזרתה\n5. להוכיח מגוון תוצאות מתקדמות באלגברה ליניארית הנוגעות בפירוק עצמי של מטריצות סימטריות, סיבוביות, חיוביות מוגדרות.",
                    n: 0.08,
                },
            },
        },
        {
            i: 1048,
            $: {
                '0': { v: '274109', n: 1 },
                '1': { v: 'מבוא לרפואה דחופה', n: 0.577 },
                '2': {
                    v: 'לרפואנים בלבד.\nהקניית ידע בסיסי תאורטי ומעשי, של הכרת מצבים המחייבים טפול ראשוני להצלת חיים. עקרונות ההחייאה הבסיסיים ומיומנות בסיסית בטפול בנפגעים ובהחייאה.',
                    n: 0.213,
                },
            },
        },
        {
            i: 1049,
            $: {
                '0': { v: '274126', n: 1 },
                '1': { v: 'ביוכימיה כללית וקלינית 1 ת"א', n: 0.447 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. חומצות אמינו, חלבונים ואנזימים, אנזימולוגיה קלינית ותפקודי כבד, הצופן הגנטי (שכפול, שעתוק ותרגום), מ- DNA ל-RNA ולחלבון, המוגלובין והמחלות הקשורות בו.',
                    n: 0.174,
                },
            },
        },
        {
            i: 1050,
            $: {
                '0': { v: '274133', n: 1 },
                '1': { v: 'מדעי ההתנהגות/רפואת אורח חיים ת"א', n: 0.447 },
                '2': {
                    v: 'הקורס מספק מבוא להיבטים ביו-פסיכו-סוציאליים של רפואה, רפואת אורח חיים ומדעי ההתנהגות תוך התייחסות מיוחדת לבריאותם ורווחתם של הסטודנטים עצמם בבית הספר לרפואה / כרופאים לעתיד. HEALERS ART הוא קורס מודל גילוי חדשני בהבהרת ערכים ומקצועיות הנמשך לאורך 5 המפגשים האחרונים.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1051,
            $: {
                '0': { v: '274136', n: 1 },
                '1': { v: 'מדעי התנהגות ומקצועיות רפואית ת"א', n: 0.447 },
                '2': {
                    v: 'הרופא והחולה: כאב, לקות ונכות פיזית, מחלה פסיכיאטרית והסטיגמה, הפרעות אישיות ותפקוד חברתי, מוות: הגדרות צוואות בחיים. הרופא והחברה: מערכת בריאות, כלכלה רפואית, ארגונים ומקצועיות. הרופא ועצמו: שימוש בסמים והתאוששות, כישורים קוגניטיבים, התפתחות רגשית, התפתחות המוסר והערכים הקשורים לבריאות.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1052,
            $: {
                '0': { v: '274138', n: 1 },
                '1': { v: "שיטות כמותיות במדעי הרפואה א'", n: 0.447 },
                '2': {
                    v: 'לימוד מושגי יסוד בניתוח אותות ומערכות מעולם הרפואה. דגימה, ייצוג וניתוח נתונים במרחב הזמן והתדר. תכנות מבני: גישה אלגוריתמית לפתרון בעיות, משתנים, לולאות, מבני בקרה, קלט ופלט.',
                    n: 0.192,
                },
            },
        },
        {
            i: 1053,
            $: {
                '0': { v: '274142', n: 1 },
                '1': { v: 'שלישי קליני - להיות רופא 1', n: 0.408 },
                '2': {
                    v: 'מטרת ההתנסות בקורס היא לחשוף את הסטודנטים להיבטים האנושיים והקליניים הקשורים במקצוענות הרפואית זאת על ידי הבנת חוויית החולי, תוך רכישת מיומנויות תקשורת בין אישית הממוקדת במטופל ויכולת רפלקטיבית. הקורס מועבר לסירוגין בקבוצות חניכה של עד 10 סטודנטים שיחשפו לעבודה בבית החולים על מחלקותיה, ובהתנסות קלינית אישית בצמוד ובליווי חונכות אישית של רופא בבית החולים ובמרפאות הקהילה.',
                    n: 0.132,
                },
            },
        },
        {
            i: 1054,
            $: {
                '0': { v: '274145', n: 1 },
                '1': { v: 'חשיפה,תקשורת התפתחות מקצועית1 ת"א', n: 0.5 },
                '2': {
                    v: '1. חשיפה למקצוע הרפואה בסביבה הקלינית 2. חשיפה למגוון מקצועות הרפואה כחלק מחשיבה על קריירה עתידית 3. היכרות והבנת התפקיד המשמעותי של עבודת צוות רב מקצועי בסביבה הקלינית 4. שיפור מיומנויות תקשורת בינאישית, הקשבה וראיון 5. התנסות בלמידה בקבוצה קטנה ומתן משוב משמעותי ללומד',
                    n: 0.151,
                },
            },
        },
        {
            i: 1055,
            $: {
                '0': { v: '274147', n: 1 },
                '1': { v: 'אופקים ברפואה 1 ת"א', n: 0.5 },
                '2': {
                    v: 'הנושאים שילמדו בקורס כל סטודנט יבחר נושא (עד שניים) מתוך הרשימה, קרדיולוגיה ילדים ופגיה רפואת חירום רפואת ילדים התפתחותית גנטיקה קלינית פתולוגיה פעולות כירורגיות תרפיה במוזיקה וליצנות רפואית פיזיותרפיה',
                    n: 0.186,
                },
            },
        },
        {
            i: 1056,
            $: {
                '0': { v: '274167', n: 1 },
                '1': { v: 'ביולוגיה של התא', n: 0.577 },
                '2': {
                    v: 'הקורס יורכב משני חלקים: חלק ראשון-התא מבנה ותפקוד בסיסי ברמת התא: אורגנלות, ממברנות, גרעין, הדוגמה המרכזית יצירה והפרשה של חלבונים, מחזור התא, השלד התוך תאי. חלק שני- הקשר בין התא לסביבתו: העברת אותות, החומר החוץ תאי, קשר בין תאי, דיפרנציאציה וסרטן.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1057,
            $: {
                '0': { v: '274168', n: 1 },
                '1': { v: 'ביופיסיקה ומדעי העצב ת"א', n: 0.5 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. קורס מבוא למבנה הבסיסי ולפונקציה של מערכת העצבים האנושית המשלבת שלושה נושאים עיקריים ביופיזיקה, נוירואנטומיה ונוירופיזיולוגיה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1058,
            $: {
                '0': { v: '274169', n: 1 },
                '1': { v: 'אנטומיה ואמבריולוגיה  1 ת"א', n: 0.5 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. קורס מבוא למבנה הבסיסי והתפקוד של גוף האדם המשלב דיסקציה חזותית ברוטו של גוף האדם עם תמונות רדיולוגיות. סמסטר 1 יתמקד בחזה (הלב והריאות), הבטן והאגן.',
                    n: 0.162,
                },
            },
        },
        {
            i: 1059,
            $: {
                '0': { v: '274171', n: 1 },
                '1': { v: 'התא מבנה ותפקוד ת"א', n: 0.5 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. קורס זה נלמד באנגלית. מטרת הקורס היא להקנות מושגי יסוד בביולוגיה של התא: קרום, אברונים, שלד, גרעין, מיטוזה, מחזור התא ובקרתו, אנדוציטוזה ואקסוציטוזה, צמתים בין התאים, פקטורי גדילה, מנגנוני העברת אותות, תקשורת בין תאית, גנים וסרטן, יצירת גרורות, אנגיוגנזיס, אפופטוזיס, פעילות תרופות אנטי סרטניות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1060,
            $: {
                '0': { v: '274175', n: 1 },
                '1': { v: 'פרמקולוגיה ת"א', n: 0.707 },
                '2': {
                    v: 'הקורס נלמד באנגלית ומיועד לסטודנטים מתוכנית TEAMS. קורס פרמקולוגיה רפואית מתמקד בפירוש הפעולות והשימושים של תרופות מנקודת המבט של רפואה מתקדמת, בדגש על יישום פרמקודינמיקה ותרפיוטיקה. הקורס כולו ילמד באופן אינטראקטיבי של למידת חומרים דידקטיים על בסיס מקרים רפואיים ותרחישים קליניים. מצופה מהסטודנטים להשלים את חובות הקריאה שלהם לפני כל שיעור בכדי שיוכלו להבין את המקרה ולהשתתף בו.',
                    n: 0.131,
                },
            },
        },
        {
            i: 1061,
            $: {
                '0': { v: '274178', n: 1 },
                '1': { v: 'נוירולוגיה ת"א', n: 0.707 },
                '2': {
                    v: 'קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. קביעת הציון תתבצע ע"פ מעקב אחר התקדמות הסטודנטים במחלקות, יכולות פרזנטציה ובחינה בעל פה. תקופת הלימוד הקליני תארך 4 שבועות. כל סטודנט אחראי למספר חולים, לקבלתם, מעקב אחריהם וסיכום הטיפול בהם. מהסטודנטים מצופה להשתתף בכל הפעילויות המחלקתיות (דיאגנוזה, קליניקה ונוירופיזיולוגיה).',
                    n: 0.146,
                },
            },
        },
        {
            i: 1062,
            $: {
                '0': { v: '274179', n: 1 },
                '1': { v: 'סבב קריירה ייחודי ת"א', n: 0.5 },
                '2': {
                    v: 'קורס זה מועבר על ידי מדריכים קליניים בכירים וכולל סבבים במחלקות הבאות: ילדים, כירורגיה כללית, נשים, קרדיולוגיה ותחומים ייחודיים נוספים. קורס זה מספק לסטודנטים הבנה לעומק של פרקטיקה יומיומית בתחום התמחות מסוים. ניסיון זה יתרום לסטודנטים בבואם לבחור את תחום ההתמקצעות בקריירה שלהם, כמו גם במציאת מקום להתמחות.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1063,
            $: {
                '0': { v: '274180', n: 1 },
                '1': { v: 'בחירה קלינית מתקדמת ת"א', n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים שנה רביעית בתוכנית האמריקאית. על הסטודנטים לבצע 18 שבועות בחירה של רוטציות קליניות. ניתן לבצע את הרוטציות בארה"ב ו/או בישראל בכל מחלקה קלינית, בתנאי שהינה מחלקה הוראה מוסמכת המסונפת לבית חולים אקדמאי. הסטודנטים יידרשו לעמוד בכל דרישות המחלקה.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1064,
            $: {
                '0': { v: '274181', n: 1 },
                '1': { v: 'אפידימיולוגיה ת"א', n: 0.707 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. הקורס ידגיש את יישום קורס מבוא לאפידמיולוגיה וביוסטטיסטיקה המשמשים במחקר העקרונות האפידמיולוגיים להבנת המחלה האנושית ולפרשנות ניסויים קליניים אקראיים אנושיים.',
                    n: 0.177,
                },
            },
        },
        {
            i: 1065,
            $: {
                '0': { v: '274183', n: 1 },
                '1': { v: 'מבוא לרפואה קלינית ת"א', n: 0.5 },
                '2': {
                    v: 'בסיום הקורס לסטודנט תהיה הבנה בסיסית של הגישה לבעיות קליניות, יכולת לזהות בעיות קליניות, לחקור מידע בסיסי וידע קליני רלוונטי ולסנתז ידע זה, לפתח הבנה של מחלות נפוצות המשפיעות על מערכות איברים מרכזיות ולהיות מסוגל לזהות טיפולים מתאימים (רפואי/כירורגי/התנהגותי). כמו כן, הסטודנט יהפוך למיומן ובעל ידע באסטרטגיות של רפואה מונעת לגבי הופעת מחלות מסוג זה באמצעות בדיקה גופנית והיסטוריה של המטופל, בדיקות סקר, סמנים ביולוגיים והתערבויות ממוקדות ברמת האוכלוסייה.',
                    n: 0.12,
                },
            },
        },
        {
            i: 1066,
            $: {
                '0': { v: '274216', n: 1 },
                '1': { v: 'היסטולוגיה ת"א', n: 0.707 },
                '2': {
                    v: "מיועד לסטודנטים בתוכנית TEAMS. קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. טכניקות בהיסטולוגיה (מיקרוסקופיה, הכנת פרפרטים, צביעה), מבוא לאנטומיה מיקרוסקופית של רקמות (אפיתל, חיבור, שריר, עצב) ומע' של איברים (שלד, קרדיווסקולרית, נשימה עיכול, עור, הפרשה, אנדוקרינית ורביה).",
                    n: 0.164,
                },
            },
        },
        {
            i: 1067,
            $: {
                '0': { v: '274234', n: 1 },
                '1': { v: 'להיות רופא-חשיפה למקצוע הרפואה 3', n: 0.447 },
                '2': {
                    v: 'חשיפת הסטודנטים לאוכלוסיות מוחלשות בקהילה: קשישים בבתי חולים ובבתי אבות, ילדים עם צרכים מיוחדים ומבוגרים הסובלים מפיגור, מכורים לסמים ולאלכוהול, נשים מוכות במקלטים, פגועי נפש במרפאות ובהוסטלים ועוד. הכרת הצרכים עליהם מופקדים רופאים. הדגשת הממשק המקצועי והאתי. ראיונות עם מטופלים, דיונים ומשוב. מעבר לחובת השתתפות במפגשים הסטודנטים יכתבו יומנים רפלקטיביים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1068,
            $: {
                '0': { v: '274241', n: 1 },
                '1': { v: 'ביוכימיה כללית', n: 0.707 },
                '2': {
                    v: 'חלבונים - מבנה ותפקוד. חומצות אמינו, פפטידים וחלבונים, מבנה מרחבי, עקרונות קיפול, שיטות עבודה, פרוטאומיקה: שיטות ביואינפורמטיות, פעילות חלבונים: המוגלובין, נוגדנים, חלבוני הסרקומר השרירי. אנזימים - פעילות קטליטית, קינטיקה אנזימטית: מיכאליס מנטן, מעכבים, מנגנוני פעולה, אנזימים אלוסטריים, בקרת הפעילות של אנזימים. פחמימות - מבנה, מבוא לביואנרגטיקה ומטאבוליזם, גליקוליזה, מעגל החומצה הציטרית, זירחון חימצוני, גליקוגן, גלוקלנאוגנזה. ליפידים-נתיב הפנטוז - פוספט, מערכת הגלוטטיון, מטאבוליזם של חומצות שומניות, טריגליצרידים, פוספוליפידים, כולסטרול, ליפופרוטאינים.',
                    n: 0.12,
                },
            },
        },
        {
            i: 1069,
            $: {
                '0': { v: '274242', n: 1 },
                '1': { v: 'גנטיקה של האדם', n: 0.577 },
                '2': {
                    v: 'הקורס בגנטיקה של האדם יעסוק בחשיבותה של הגנטיקה ברפואה כיום ובהיבטים מולקולריים ורפואיים של פגמים גנטיים. בקורס יידונו הנושאים הבאים: תורשה רב-גורמית, גנטיקה של אוכלוסיות, יעוץ גנטי וחישוב סיכונים, קביעת המין ותסמונות נלוות. שיטות מולקולריות מתקדמות לבדיקות גנטיות (ברמת המוטציה וברמה הכרומוזומלית), עקרונות המחלות המולקולריות, מחלות מיטוכונדריאליות, מחלות הנגרמות ע"י רצפים חוזרים, טיפול במחלות גנטיות, גנטיקה וסרטן, בדיקות סקר ואבחון טרום-לידתי, גנטיקה, חברה ואתיקה.',
                    n: 0.125,
                },
            },
        },
        {
            i: 1070,
            $: {
                '0': { v: '274243', n: 1 },
                '1': { v: 'ביולוגיה מולקולרית ומנגנוני בקרה', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס היא ללמוד את הבסיס של הביולוגיה המולקולרית ומנגנוני בקרת ביטוי גנטי. הקורס יקנה את הבסיס להבנת מבנה הדנ"א, מבנה הכרומטין, מנגנוני הכפלת הדנ"א, מנגנוני תיקון דנ"א, מנגנוני בקרה של הביטוי הגנטי והתפתחותה של הביולוגיה המולקולרית ושימושה במחקר הביולוגי וברפואה כיום.',
                    n: 0.154,
                },
            },
        },
        {
            i: 1071,
            $: {
                '0': { v: '274252', n: 1 },
                '1': { v: 'פתוגנים אאוקריוטים', n: 0.707 },
                '2': {
                    v: 'הקורס יקנה היכרות עם התכונות הביולוגיות הבסיסיות, הגנטיקה והפתוגנזה של טפילים (תולעים וחד-תאיים) ופטריות פתוגניות (שמרים ועובשים). עבור כל פתוגן או קבוצה יתוארו מחזורי החיים, מנגנוני האלימות, דרכי העברה, אבחון וטיפול.',
                    n: 0.18,
                },
            },
        },
        {
            i: 1072,
            $: {
                '0': { v: '274257', n: 1 },
                '1': { v: "אנטומיה א'", n: 0.707 },
                '2': {
                    v: 'מטרת הקורס לתת מבוא לאנטומיה קלינית, ותיאור מקיף של מבנה הראש והצוואר ושל הגף העליון באדם: המבנה הגרמי, איברים פנימיים, עצבוב, אספקה דמית וניקוז ורידי ולימפטי. בנוסף תילמד באופן שיטתי ובאמצעות תרגילי בית האנטומיה הרדיולוגית וכן הבסיס האנטומי לבדיקה הפיזיקלית של איזורים אלה.',
                    n: 0.152,
                },
            },
        },
        {
            i: 1073,
            $: {
                '0': { v: '274258', n: 1 },
                '1': { v: 'פסיכולוגיה בעולם הרפואה', n: 0.577 },
                '2': {
                    v: 'מבוא על מקום החשיבה הפסיכולוגית בתוך העולם הרפואי, המודל הביו פסיכו סוציאלי לעומת המודל הביו רפואי, קשר רופא חולה בהקשרים שונים וביניהם בהקשר של סוף החיים, סוגי פסיכופתולוגיות בהן נתקל הרופא בעבודתו במחלקות בית החולים, מודל לניתוח אינטראקציות במצבים טעונים רגשית, ההבחנה בין כאב פיזי לכאב נפשי, היכרות עם תיאוריות העוסקות בקידום בריאות וברפואה מונעת.',
                    n: 0.135,
                },
            },
        },
        {
            i: 1074,
            $: {
                '0': { v: '274260', n: 1 },
                '1': { v: 'היסטולוגיה', n: 1 },
                '2': {
                    v: 'קורס המקנה ידע בסיסי בהיסטולוגיה, שימושים ומגבלות של השיטה, לימוד מבנה מערכות ורקמות בגוף האדם, תפקידם הפיסיולוגי ואופן זיהויים בחתכים היסטולוגיים. בקורס ינתנו הרצאות פרונטליות ומעבדות שבהן התלמידים מתבוננים בחתכים היסטולוגיים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 1075,
            $: {
                '0': { v: '274264', n: 1 },
                '1': { v: 'בריאות וחולי ברפואת משפחה בקהילה', n: 0.447 },
                '2': {
                    v: 'הקורס יתמקד ברפואת הקהילה ובקשר בין אורח חיים בריא למניעה, הפחתה וטיפול בחולי כרוני. הסטודנטים יפתחו מודעות לבריאותם וחוסנם האישי וינסו לגבש תכנית אישית לאורח חיים בריא. במקביל ירכשו מיומנויות תקשורת ואימון שיאפשרו להם להכיר וללוות מטופלים המתמודדים עם מחלות כרוניות בשינוי אורחות חיים לבריאותם וחוסנם. הסטודנטים ייחשפו וילוו רופאים , אחיות ואנשי צוות רפואי בטיפול בחולים החיים עם חולי כרוני בגישה כוללנית , ביו-פסיכו-סוציאלית.',
                    n: 0.124,
                },
            },
        },
        {
            i: 1076,
            $: {
                '0': { v: '274271', n: 1 },
                '1': { v: 'פתולוגיה ת"א', n: 0.707 },
                '2': {
                    v: "קורס פתולוגיה מחולק לשני חלקים. חלק א', פתולוגיה כללית, מתייחס לחקר תהליכים פתולוגיים בסיסיים העומדים בבסיס כל המחלות כגון פתולוגיה תאית, דלקת והחלמה, הפרעות נוזלים והמודינמיות, ניאופלזיה, חקר של מחלות גנטיות, אימונולוגיות, מטבוליות , זיהומים וחוסרים בגוף, מחלות תלויות גורמים סביבתיים ומחלות ילדים. חלק ב', פתולוגיה של מערכות, מתייחס לחקר מחלות הפוגעות באיברים ספציפיים ובמערכות שלהם כגון לב וכלי דם, מערכת הנשימה, מערכת העיכול, רקמות לימפואידיות והמאופואטיות, כבד, לבלב ודרכי המרה, המערכת האנדוקרינית, מערכת השתן, איברי מין זכר ונקבה, מערכת העצבים, מערכת השרירים והשלד, מערכת העור.",
                    n: 0.108,
                },
            },
        },
        {
            i: 1077,
            $: {
                '0': { v: '274272', n: 1 },
                '1': { v: 'מיקרוביולוגיה ת"א', n: 0.707 },
                '2': {
                    v: 'קורס מיקרוביולוגיה מעניק מבוא ללימוד על זיהומים חיידקיים, ויראליים, פטרייתיים וטפילים הגורמים למחלות בקרב בני אדם.',
                    n: 0.25,
                },
            },
        },
        {
            i: 1078,
            $: {
                '0': { v: '274319', n: 1 },
                '1': { v: 'וירולוגיה', n: 1 },
                '2': {
                    v: 'הלומדים ידעו לפרט את מנגנוני הרפליקציה השונים של וירוסי DNA ו-RNA, ידעו לזהות מנגנוני אינטראקציה של הוירוס עם התא המאכסן, וכן את מנגנוני ההתמרה הסרטנית ע"י וירוסים ואספקטים שונים של פתוגנזה של הדבקות וירליות ותגובת האורגניזם. הלומדים יכירו נגיפים הקשורים במחלות הומניות- כולל היבטים קליניים ואפידמיולוגים במחלות וירליות. הלומדים ידעו גם לפרט תרופות אנטיוירליות.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1079,
            $: {
                '0': { v: '274323', n: 1 },
                '1': { v: 'פיסיולוגיה 1 - נשימה לב ודם', n: 0.408 },
                '2': {
                    v: 'מבוא להמודינמיקה - שריר הלב - פעילות מכנית וחשמלית, בקרה עצבית והורמונלית, קולות לב, מחזור דם קורונרי, מחזור דם היקפי, בקרה עצבית והורמונלית. לחץ דם עורקי ומרכיביו. אלקטרופיסיולוגיה של שריר הלב, השפעות של טרנסמיטרים אוטונומיים, השפעות של יוני סידן ואשלגן על הפעילות החשמלית של הלב. מכניקה של הנשימה, שחלוף הגזים הראתי, העברת 2CO בדם, בקרה של הנשימה.',
                    n: 0.132,
                },
            },
        },
        {
            i: 1080,
            $: {
                '0': { v: '274326', n: 1 },
                '1': { v: 'להיות רופא-סוגיות תרבותיות אתיות5', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס היא להכיר ולהבין את ההשפעה שיש לחברה ותרבות על בריאות, חולי, הרופא והרפואה. הסטודנט יבחן את הטיותיו החברתיות והתרבותיות וכיצד הן משפיעות על תפישתו את תפקידו ועבודתו העתידית. הסטודנט יפתח מודעות להשפעת חברה ותרבות על חולי ומחלה וכן הקשר הטיפולי עם הרופא, תנאי ואופן עבודתו. ייחשף ויבחן דילמות אתיות אישיות ומקצועיות בהקשרם החברתי תרבותי. יזהה השפעות תרבותיות וחברתיות על גישה ותפישות בעבודת הרופא ובעולם הרפואה. יכיר סקטורים שונים של טיפול ומשמעותם בעבודת הרופא. השיטות והאמצעים להנחלת המטרות הינם מפגשים עם רופאים, מטפלים וחולים, מפגש במרפאת איידס, הכרת רפואה אלטרנטיבית, ביקור במוזיאון לוחמי הגיטאות (שואה ורפואה), סוגיות במסירת בשורה קשה ובהשתלת איברים, הכרת רפואה פליאטיבית וסוגיות אתיות בסוף החיים ועוד. בנוסף לחובת השתתפות בקורס, על כל סטודנט לכתוב יומנים רפלקטיביים אותם יגיש למדריך הקבוצה.',
                    n: 0.089,
                },
            },
        },
        {
            i: 1081,
            $: {
                '0': { v: '274336', n: 1 },
                '1': { v: 'נוירופזיולוגיה מערכתית', n: 0.707 },
                '2': {
                    v: 'מערכות סנסוריות כולל מערכות הראיה, שמיעה, סומטוסנסורית, חושים כימיים, ווסטיבולרית וכאב. מערכות מוטוריות כולל עיבוד ברמת חוט שדרה, מערכת עצבים מרכזית, מוחון וגרעיני בסיס. מערכות מוח לזיכרון ולמידה, רגשות וקוגניציה.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1082,
            $: {
                '0': { v: '274348', n: 1 },
                '1': { v: 'פיסיולוגיה 2 - מערכות ויסות', n: 0.447 },
                '2': {
                    v: 'הקורס יעסוק בתפקידי הכליה לרבות סינון גלומרולרי והפרשת חומרים ע"י הכליה. בנוסף לכך הקורס יקנה ידע אודות בקרת ההימודינמיקה של הכליה ומנגנוני טרנספורט בנפרון, וכן מאזן הנוזלים והמלחים ומאזן חומצי-בסיסי בגוף. חלקו השני של הקורס עוסק בפיזיולוגיה של מערכת העיכול כולל תנועתיות, הפרשות וספיגה של מרכיבי המזון לאורך צינור העיכול. במקביל להרצאות תבוצע הדגמת סימולציה לתגובות ומנגנוני בקרה במערכת הקרדיווסקולרית והכליה עקב העמסת נוזלים ושוק באדם.',
                    n: 0.123,
                },
            },
        },
        {
            i: 1083,
            $: {
                '0': { v: '274372', n: 1 },
                '1': { v: 'בקטריולוגיה', n: 1 },
                '2': {
                    v: "מבנה ותיפקוד התא הפרוקריוטי, פיזיולוגיה, גנטיקה, גנומיקה, אבולוציה וסיסטמטיקה של חיידקים, תקשורת בין חיידקים, בקטריופאג'ים, מנגנוני פעולה של תרופות אנטיביוטיות ומנגנוני עמידות, שיטות עיקור, המיקרוביוטה ואינטראקציות פתוגן-מאכסן, הכרה של קבוצות החיידקים הפתוגניים העיקריות, כולל תכונותיהם, מנגנוני הדבקה ואלימות, דרכי טיפול. המעבדה תדגים שיטות זיהוי וניטור של חיידקים פתוגניים ושל רגישותם לאנטיביוטיקה.",
                    n: 0.14,
                },
            },
        },
        {
            i: 1084,
            $: {
                '0': { v: '274373', n: 1 },
                '1': { v: 'מבוא לרפואה קלינית 1', n: 0.5 },
                '2': {
                    v: 'במהלך הקורס הסטודנטים יתנסו בקבוצות קטנות וילמדו בסבבים את הנושאים הבאים: מרכיבי האנמנזה, אנמנזה מודרכת, הערכה כללית וסימנים חיוניים, בדיקה גופנית של מערכת הנשימה, המערכת הקרדיוסקולארית, ומערכת העיכול.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1085,
            $: {
                '0': { v: '274375', n: 1 },
                '1': { v: 'נוירואנטומיה', n: 1 },
                '2': {
                    v: 'מטרת הקורס לתת תיאור מקיף של מבנה מערכת העצבים המרכזית וההיקפית האנושית. הקורס מתאר את האירועים העיקריים בהתפתחות מערכת העצבים באדם, מבנה המוחות וקשריהם ומבנה העצב הפריפרי, את אספקת הדם והניקוז הורידי של המוח. כמו כן הקורס מלמד באופן שיטתי את האנטומיה הרדיולוגית של המוח וכן את הבסיס האנטומי של הבדיקה הפיזיקלית הנוירולוגית הבסיסית והתקינה (ללא פתולוגיה).',
                    n: 0.132,
                },
            },
        },
        {
            i: 1086,
            $: {
                '0': { v: '274400', n: 1 },
                '1': { v: 'שילוב מערכות פרה קליניקה-קליניקה', n: 0.5 },
                '2': {
                    v: 'דרישות קדם: כל תכנית הלימודים בשנים הפרה קליניות (ראה תקנון פקולטי) כולל סף מעבר על פי דרישות קטלוג הטכניון. הקורס משלב הוראת הקליניקה עם פרה-קליניקה של מערכות הגוף, ויתמקד בהיבט הפיזיולוגי, האנטומי והפתולוגי. כמבוא לקורס יילמדו נושאים כדוגמת EKG, דימות, רפואה מעבדתית ורפואה גרעינית. במסגרת הקורס הסטודנטים ייבחנו בשלשה מקבצים (מבחנים) המשלבים שאלות סביב מקרה קליני. סף מעבר בקורס הוא ציון 65 בכל אחד מ- 3 המקבצים ובנפרד בשאלות הפתולוגיה. * קורס בן 20 שבועות.',
                    n: 0.115,
                },
            },
        },
        {
            i: 1087,
            $: {
                '0': { v: '274402', n: 1 },
                '1': { v: 'מבוא לרפואה קלינית (מר"ק)', n: 0.5 },
                '2': {
                    v: 'הקורס מקנה ללומד את עקרונות הגישה לחולה תוך מיקוד במיומנות נטילת האנמנזה והבדיקה הגופנית. עקרונות המושתתים על יכולות תקשורת בינאישית, אמפתיה, ידע רפואי ואינטגרציה של הידע. במהלך הקורס ילמדו עקרונות האנמנזה והבדיקה הגופנית ובמקביל יתקיים תרגול מעשי. חוברת הקורס היא החומר המחייב וספר הקורס "עקרונות האנמנזה והבדיקה הפיזיקלית של ברברה בייטס".',
                    n: 0.14,
                },
            },
        },
        {
            i: 1088,
            $: {
                '0': { v: '274509', n: 1 },
                '1': { v: 'רפואת נשים ומילדות ת"א', n: 0.5 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. ההוראה ניתנת במחלקות באמצעות הרצאות, סמינריונים, דיונים, והדרכה קלינית. החשיפה הקלינית כוללת התנסות במילדות, גניקולוגיה ופוריות. במיילדות: השתתפות בקבלת לידות, ביקורים במחלקת יולדות וביחידה להריון בסיכון גבוה, צפייה בניתוחים קיסריים ולידות מכשור. צפייה בבדיקות אולטרהסאונד ובטכניקות שונות לאבחון טרום לידתי. בגינקולוגיה: ביקורים מודרכים, קבלת חולות, צפיה בניתוחים ופעולות כירורגיות, ביקורים בחדר מיון ומרפאות חוץ. בפוריות: ביקורים והדרכה קלינית במרפאת פוריות, וביחידה להפריה חוץ גופית. הסטודנטים מתבקשים להשתתף בתורנויות, להכין סמינריון ולהציג חולים. הציון מתבסס על הערכת מחלקה, ועל בחינה בעל פה בסוף הקלרקשיפ.',
                    n: 0.107,
                },
            },
        },
        {
            i: 1089,
            $: {
                '0': { v: '274514', n: 1 },
                '1': { v: 'קרדיולוגיה קלינית', n: 0.707 },
                '2': {
                    v: 'תאור, אבחון ועקרונות הטיפול של מחלות לב.',
                    n: 0.378,
                },
            },
        },
        {
            i: 1090,
            $: {
                '0': { v: '274520', n: 1 },
                '1': { v: 'רדיולוגיה אבחנתית', n: 0.707 },
                '2': {
                    v: 'מטרת הסבב-חשיפת הסטודנט לעולם הדימות, כולל היכרות עם מגוון הפעולות האבחנתיות והטיפוליות המוצעות במכוני הדימות, הכרת היתרונות והחסרונות של אמצעי הדימות השונים, והעקרונות לבחירה מושכלת של אמצעי הדימות ע"פ הנבדק והשאלה קלינית. דגש על הקניית מיומנות בסיסית והכרת מושגי יסוד בצילום חזה, כולל זיהוי אנטומיה נורמלית ופתולוגיות עיקריות, תוך שילוב למידה אישית ופרונטלית, תרגולים אינטראקטיביים והצגות מקרים.',
                    n: 0.132,
                },
            },
        },
        {
            i: 1091,
            $: {
                '0': { v: '274523', n: 1 },
                '1': { v: 'רפואת כירורגיה כללית ת"א', n: 0.5 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. מטרת הקורס בכירורגיה היא להקנות את הידע והמיומנויות הרלוונטיים למחלות הכירורגיה של האברים והמערכות השונים, הנחוצים לתפקוד אופטימלי של הרופא הכללי המצוין. הדגש בהוראה יהיה על הוראה ליד מיטת החולה, כשהסטודנטים משתתפים בעבודה במחלקה, בחדר המיון, בחדר הניתוח ובמרפאות השונות ומשתתפים בתורנויות. הסטודנטים יידרשו להכנת סמינריון, להציג חולים, וייבחנו בבחינה בעל פה בסוף הקלרקשיפ.',
                    n: 0.13,
                },
            },
        },
        {
            i: 1092,
            $: {
                '0': { v: '274526', n: 1 },
                '1': { v: "כירורגיה 1ח'", n: 0.707 },
                '2': {
                    v: 'המקצועות יכללו: כירורגיה כללית, כירורגית כלי הדם. כירורגיה דחופה, כירורגית ילדים ונוירוכירורגיה. השתתפות בכל הפעילויות השוטפות והמדעיות של המחלקה. הסטודנט לומד את הפתופיסיולוגיה, אבחון והביטוי הקליני של המחלות הדורשות ניתוח, ואת ההוראות לניתוח. ההכנה לניתוח והטיפול אחריו, הסיבוכים האפשריים, מניעתם והטיפול בהם.',
                    n: 0.154,
                },
            },
        },
        {
            i: 1093,
            $: {
                '0': { v: '274531', n: 1 },
                '1': { v: 'פסיכיאטריה', n: 1 },
                '2': {
                    v: 'הקנית ידע ומיומנות בתחומי הפסיכיאטריה הקלינית ובריאות הנפש הנחוצים לרופאים כלליים. ההתנסות המעשית תעשה במסגרת המחלקה הפסיכיאטרית ברמב"ם ו/או מחלקות אחרות שתוכרנה כמתאימות לכך. ההתנסות תתמקד על הערכת המצב הנפשי בחולים והטיפול בהם ותכלול השתלבות בפעילות המחלקה ובדיקת חולים בחדר מיון ובמרפאה. סטודנטים יצטרפו ליועצים הפסיכיאטריים ממחלקות שונות בביה"ח הכללי וגם ישתתפו כצופים בטיפול קבוצתי. כמו-כן ייערכו סמינריונים בנושאים בפסיכיאטריה ובחוק לטיפול בחולה הנפש.',
                    n: 0.125,
                },
            },
        },
        {
            i: 1094,
            $: {
                '0': { v: '274532', n: 1 },
                '1': { v: 'יילוד וגינקולוגיה', n: 0.707 },
                '2': {
                    v: 'תכנית 7 שב\'. ההוראה ניתנת במחלקות באנמצעות הרצאות, סמינריונים, דיונים והדרכה קלינית. בתחילת שנת הלימודים מתקיים שבוע הרצאות מרוכז המהווה מבוא לקלרקשיפ. החשיפה הקלינית כוללת התנסות במילדות, גניקולוגיה ופוריות. במילדות: השתתפות בקבלת לידות, ביקורים במחלקת יולדות וביחידה להריון בסיכון גבוה, צפיה בניתוחים קיסריים ולידות במכשור. צפיה בבדיקות אולטרסאונד ובטכניקות שונות לאבחון טרום לידתי. בגינקולוגיה: ביקורים מודרכים, קבלת חולות, צפיה בנתוחים ופעולות כירורגיות, ביקורים בחדר מיון ומרפאות חוץ. בפוריות: ביקורים והדרכה קלינית במרפאת פוריות וביחידה להפריה חוץ גופית. הציון מתבסס על הערכת המחלקה (25), בחינה בע"פ בסיום הקלרקשיפ (25), בחינה סופית בסוף השנה ( 50). הסטודנטים מתבקשים להשתתף בתורנויות (5-6). תנאי לתחילת הקלרקשיפ מעבר בחינה במחלקה על החומר הנלמד במבוא. ציון מעבר של הקלרקשיפ-70.',
                    n: 0.094,
                },
            },
        },
        {
            i: 1095,
            $: {
                '0': { v: '274533', n: 1 },
                '1': { v: "רפואת ילדים 1ח'", n: 0.577 },
                '2': {
                    v: 'רכישת ידע יסודי של מחלות ילדים עם דגש על מצבים שכיחים ומצבים חריפים מסוכנים, רכישת המושג של גדילה והתפתחות וידיעות בשטחים אלה. התכנית כוללת: ביקורים מודרכים, שעורים, סמינריונים, הרצאות, עבודה עם חולים מאושפזים ובחדר קבלה - תורנות, הצגות חולים ונושאים על ידי התלמיד, ביקורים בחדרי יילודים.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1096,
            $: {
                '0': { v: '274534', n: 1 },
                '1': { v: 'רפואה פנימית ת"א', n: 0.577 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. מטרת הקורס בפנימית היא להקנות את הידע והמיומנויות הרלוונטים למחלות הפנימיות של האברים והמערכות השונות, הנחוצים לתפקוד אופטימלי של הרופא הכללי המצוין. הדגש בהוראה יהיה על הוראה ליד מיטת החולה, כשהמידע הכלול בתולדות המחלקה, הבדיקה הפיסיקלית ובדיקות עזר ישמשו עתה בסיס לחמישה שלבי פעולה: 1. זיהוי הרמזים לפיהם ניתן לקבוע את כל הבעיות.2. ניסוח ורשימה מלאה של בעיות. 3. דיון אינטגרטיבי ועריכת תוכנית ראשונית לפתרון כל בעיה. 4. מעקב אחר החולה לפי הבעיות והצעות נוספות לפתרונות. 5. סיכום לפי הבעיות והוצאת מסקנות בהתייחסות לאבחנה. טיפול ופרוגנוזה. הסטודנטים משתתפים בכל פעילויות ובכל עבודות המחלקה, בחדר המיון ובמרפאות השונות ומשתתפים בתורנויות. הסטודנטים יידרשו להכנת סמינריון, להציג חולים, וייבחנו בע"פ בסוף הקלרקשיפ.',
                    n: 0.094,
                },
            },
        },
        {
            i: 1097,
            $: {
                '0': { v: '274536', n: 1 },
                '1': { v: 'רפואת ילדים ת"א', n: 0.577 },
                '2': {
                    v: 'מיועד עבור סטודנטים בתוכנית TEAMS. בקורס ילמדו את האנטומיה, פיסיולוגיה ופתולוגיה של תינוקות, ילדים ובני נוער. הקורס ימשך 8 שבועות. הסטודנטים ישתתפו בדיונים, טיפול וניהול של החולים במחלקה, בחדר מיון ובמרפאות. הסטודנטים ישתתפו בתורנויות. תיערך הערכה מתמשכת על בסיס שבועי ובנוסף מבחן סופי שיבדוק ידע ושיפוט. הערכות הקורס יהוו חלק מהציון הסופי ברפואת ילדים.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1098,
            $: {
                '0': { v: '274539', n: 1 },
                '1': { v: 'כירורגיה אורתופדית', n: 0.707 },
                '2': {
                    v: 'מטרת תכנית הלימודים בכירורגיה אורתופדית היא להקנות לסטודנט גישה רב תחומית ייחודית לחולה המורכב, עם פציעות בחגורת הגפיים ועמוד שדרה. מגוון המטופלים באורתופדיה כולל חולים לאחר טראומה, (תאונות דרכים, תאונות עבודה, פציעות מלחמה, אירועי טרור וכיוצ"ב) מחד ומאידך מחלות ניווניות התפתחותיות על פני המפרקים הגדולים ועמ"ש צווארי ומתני. הדגש בסבב הקליני באורתופדיה הוא על הקניית גישה קלינית למטופל המורכב הנמצא במסגרות שונות בקהילה, באשפוז חריף, בשיקום ובמוסד. הסטודנט יהיה פעיל בקבלת חולים, הצגת חולים, השתתפות בדיונים קליניים, השתתפות במרפאות חוץ ובחדרי הניתוח כמו כן בהכנת סמינרים.',
                    n: 0.108,
                },
            },
        },
        {
            i: 1099,
            $: {
                '0': { v: '274540', n: 1 },
                '1': { v: 'גריאטריה', n: 1 },
                '2': {
                    v: 'מטרת תכנית הלימודים ברפואה גריאטרית היא להקנות לסטודנט גישה רב תחומית ייחודית לחולה הזקן תוך היכרות עם תהליך ההזדקנות ותסמונות גריאטריות. הדגש בסבב הקליני בגריאטריה הוא על הקניית גישה קלינית לחולה הזקן הנמצא במסגרות שונות בקהילה, באשפוז חריף, בשיקום ובמוסד. הסטודנט יהיה פעיל בקבלת חולים, הצגת חולים, השתתפות בדיונים קליניים, ובהכנת סמינרים.',
                    n: 0.139,
                },
            },
        },
        {
            i: 1100,
            $: {
                '0': { v: '274541', n: 1 },
                '1': { v: 'הרדמה וטיפול נמרץ', n: 0.577 },
                '2': {
                    v: 'מטרת תכנית הלימודים בהרדמה וטיפול נמרץ היא להקנות לסטודנט גישה מערכתית ייחודית לחולה הנזקק להרדמה לצרכי ניתוח ו/או לטיפול נמרץ במצבי כשל של מערכות חיים חיוניות. הסטודנט יהיה פעיל בקבלת חולים, הצגת חולים, השתתפות בדיונים קליניים, ובהכנת סמינרים.',
                    n: 0.162,
                },
            },
        },
        {
            i: 1101,
            $: {
                '0': { v: '274542', n: 1 },
                '1': { v: 'נוירולוגיה קלינית', n: 0.707 },
                '2': {
                    v: 'במהלך הקורס, שמשכו חמישה שבועות, ירכוש הסטודנט מיומנות בבדיקה הנוירולוגית וילמד כיצד לאבחן ולטפל במקרים הנוירולוגים השכיחים. ההוראה תינתן הן בצורת הרצאות לכלל הכיתה (שבוע אחד) והן בקבוצות קטנות במחלקות (4 שבועות). במחלקה יבדוק הסטודנט חולים יציגם, ישתתף בפעילות השוטפת במחלקה. בתום הסבב במחלקה יבחן הסטודנט על הבדיקה הנוירולוגית ועל ניתוח מקרים.',
                    n: 0.139,
                },
            },
        },
        {
            i: 1102,
            $: {
                '0': { v: '274544', n: 1 },
                '1': { v: 'קרדיולוגיה קלינית', n: 0.707 },
                '2': {
                    v: 'הסבב יקנה מיומנויות קליניות הדרושות לסטודנט לניהול מקרה שכיח בתחום הקרדיולוגיה בסיום הכשרתו בבית ספר לרפואה.',
                    n: 0.25,
                },
            },
        },
        {
            i: 1103,
            $: {
                '0': { v: '274545', n: 1 },
                '1': { v: 'אונקולוגיה', n: 1 },
                '2': {
                    v: 'גישה בסיסית לאבחון, טיפול ומעקב אחר מטופל במחלקה אונקולוגית. הסטודנט יצפה בעבודת צוות רב מקצועי כחלק מהקניית הגישה והידע למטופל אונקולוגי. הנושאים הנלמדים בסבב כוללים סוגי ממאירויות שכיחות (שד, ריאה, מעי גס, ערמונית). הסטודנט ילמד את עקרונות הטיפול הקרינתי, טיפול פליאטיבי, ויתנסה בעקרונות עליהם מבוססת תקשורת בינאישית עם מטופלים אונקולוגיים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1104,
            $: {
                '0': { v: '274546', n: 1 },
                '1': { v: 'מחלות עיניים', n: 0.707 },
                '2': {
                    v: 'סבב רפואת עיניים יתמקד בהקניית ידע בסיסי הדרוש לכל רופא (בכל תחום שיבחר)ובכלל זה זיהוי מצבים קריטיים/דחופים המחייבים טיפול מיידי בתחום רפואת העיניים, וניהול מצבים שכיחים אשר נמצאים בליבת העיסוק האופתלמולוגי, על היבטיו הרפואיים, הניתוחיים והטכנולוגיים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 1105,
            $: {
                '0': { v: '274547', n: 1 },
                '1': { v: "מחלות א.א.ג וכיר' ראש צוואר", n: 0.447 },
                '2': {
                    v: 'הקניית ידע ומיומנות חשיבה קלינית בתחום מחלות א.א.ג. וכירורגיה ראש-צוואר כולל מצב נורמלי, תחלואה רלבנטית ואמצעי הטיפול התרופתיים והניתוחיים הקשורים למערכות הבאות: מערכות השמיעה ושווי המשקל, אף, פה ולוע, גרון, בלוטות רוק, טעם, ריח, נשימה, דיבור, בליעה, ושינה וכן יכולת אבחון גידולי ראש וצוואר, והכרת מגוון האפשרויות הטיפוליות בגידולים הללו.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1106,
            $: {
                '0': { v: '274602', n: 1 },
                '1': { v: 'פסיכיאטריה ת"א', n: 0.707 },
                '2': {
                    v: 'קורס זה נלמד באנגלית במסגרת התוכנית האמריקאית. הקנית ידע ומיומנות בתחומי הפסיכיאטריה הקלינית ובריאות הנפש הנחוצים לרופאים כלליים. ההתנסות המעשית תעשה במסגרת המחלקה הפסיכיאטרית ברמב"ם ו/או מחלקות אחרות שתוכרנה כמתאימות לכך. ההתנסות תתמקד על הערכת המצב הנפשי בחולים והטיפול בהם ותכלול השתלבות בפעילות המחלקה ובדיקת חולים בחדר מיון ובמרפאה. סטודנטים יצטרפו ליועצים הפסיכיאטריים ממחלקות שונות בביה"ח הכללי וגם ישתתפו כצופים בטיפול קבוצתי. כמו-כן ייערכו סמינריונים בנושאים בפסיכיאטריה ובחוק לטיפול בחולה הנפש.',
                    n: 0.119,
                },
            },
        },
        {
            i: 1107,
            $: {
                '0': { v: '274604', n: 1 },
                '1': { v: 'רפואת המשפחה והקהילה', n: 0.577 },
                '2': {
                    v: 'הקורס יחולק בין לימוד עיוני של נושאים נבחרים בבריאות המשפחה והקהילה וכן נסיון מעשי במסגרת שירותי הבריאות הקהילתיים. נסיון זה יכלול משימות מוגדרות ברמת הפרט, המשפחה והקהילה.',
                    n: 0.192,
                },
            },
        },
        {
            i: 1108,
            $: {
                '0': { v: '274632', n: 1 },
                '1': { v: 'רפואת ילדים 2', n: 0.577 },
                '2': {
                    v: 'רכישת ידע יסודי על מחלות ילדים עם דגש על מצבים שכיחים ומצבים חריפים מסוכנים, רכישת המושג של גדילה והתפתחות וידיעות בשטחים אלה, רכישת ידע ונסיון בלקיחת אנמנזה של הילד (כולל משפחתו וסביבתו) ובבדיקה פיסיקלית (כולל גדילה והתפתחות): רכישת ידע והבנה לצרכיו של הילד הבריא בתנאים הרצויים לילד הבריא והחולה במסגרת המשפחה והחברה ובמניעת מחלות, פיתוח גישה מיוחדת בהתנהגות התלמיד עם הילד ומשפחתו. התכנית כוללת - ביקורים מודרכים, שיעורים, סמינריונים, הרצאות, עבודה עם חולים מאושפזים ובחדר קבלה, תורנות, הצגות חולים ונושאים על-ידי התלמיד, ביקורים בחדרי יילודים. הקלרקשיפ השנה הששית מאפשרת ביסוס וגיבוש הידע הנלמד בשנה החמישית ושילוב הידיעות בנושא רפואת ילדים שנרכשו על ידי התלמיד במסגרת המקצועות האחרים.',
                    n: 0.097,
                },
            },
        },
        {
            i: 1109,
            $: {
                '0': { v: '274633', n: 1 },
                '1': { v: "רפואה פנימית 2ת'", n: 0.577 },
                '2': {
                    v: 'הלימודים הם בקבוצות של 3-4 תלמידים. מתחילת עבודתו משתתף התלמיד בכל פעילויות המחלקה כולל תורנויות. בגמר תקופת הלימודים א. יפגין הסטודנט יכולת מקיפה באיסוף ופיענוח נתונים אנמנסטיים, גופניים ולהוציא מסקנות נכונות לגבי אבחנה וטיפול כולל מינון תרופות ותופעות לוואי. ג. יפגין ידע תיאורטי ומעשי בתחום הרפואה הפנימית בכל המחלות השכיחות והחשובות. ד. יפגין יכולת בזיהוי וטיפול מיידי במצבי חירום כמפורט: דום הלב, בצקת ריאות, משבר היפרטנסיבי, ומעבדתיים ורישומם. ב. יפגין יכולת להגדיר הבעיות הרפואיות כאב חד בחזה, אי ספיקה נשימתית, הלם, נסיון התאבדות, תרדמת, אנפילקסיס, ארוע צרברלי עם שיתוק, בטן חריפה, סטיות חדות במשק המים והאלקטרוליטים כולל חמצת סוכרית, ספסיס. ציון המגן מהווה מרכיב בציון הסופי בבחינת גמר ברפואה פנימית.',
                    n: 0.095,
                },
            },
        },
        {
            i: 1110,
            $: {
                '0': { v: '274642', n: 1 },
                '1': { v: 'טראומה(רפואה דחופה)', n: 0.707 },
                '2': {
                    v: 'קורס הטראומה לשנה שישית ברפואה מיועד להוות חומר יסוד עיוני ומעשי כאחד לשימוש הרופא לעתיד בתפקידיו המגוונים, הקורס מקיף את כל תחומי הטראומה העיקרית כולל הסקר הראשוני והשניוני, הבירור הראשוני, וכן את עקרונות הטיפול בפציעות שונות, כולל בתתי דיציפלינות. הקורס נותן דגש על העבודה בפועל, עיקר ותפל, דחוף ופחות דחוף ונותן את הבסיס לטיפול רפואי נאות ברמת הרופא הכללי. קורס הטראומה מבוסס על ה-ATLS.',
                    n: 0.125,
                },
            },
        },
        {
            i: 1111,
            $: {
                '0': { v: '274649', n: 1 },
                '1': { v: 'מבחן אמריקאי 2', n: 0.577 },
            },
        },
        {
            i: 1112,
            $: {
                '0': { v: '274724', n: 1 },
                '1': { v: 'עבודת גמר מחקרית ת"א', n: 0.5 },
                '2': {
                    v: 'מטרות העבודה: 1. הקניית ידע וניסיון בתכנון ובצוע מחקר עצמאי. 2. תרגול תהליכי עיבוד נתונים וניתוחם בשיטות סטטיסטיות, וכתיבת סיכום מחקר. העבודה תתבצע בתחומים הבאים בלבד: 1. מחקר ניסויי על נושא קליני, פרה-קליני, מדעי יסוד או טכנולוגי -רפואי. 2. לענות על בעיה בעלת עניין בשטח הרפואה. 3. סקר אפידמיולוגי קליני או הקשור למדעי הרפואה. 4. ניתוח מעמיק של הספרות.',
                    n: 0.13,
                },
            },
        },
        {
            i: 1113,
            $: {
                '0': { v: '275109', n: 1 },
                '1': { v: 'רוח חדשה לחסרי מעמד 1', n: 0.447 },
                '2': {
                    v: 'במסגרת הקורס, הסטודנטים יקחו חלק בפעילויות מרכז הבריאות "רוח חדשה" שבו מתקיימת מרפאה המבוססת על טיפול (בהתנדבות) הניתן ע"י רופאים בכירים, שבו מתקיים שילוב של תהליך חינוך רפואי במקביל למתן טיפול לאוכלוסיות חסרות מעמד.',
                    n: 0.171,
                },
            },
        },
        {
            i: 1114,
            $: {
                '0': { v: '275111', n: 1 },
                '1': { v: 'רפואה בעין המצלמה', n: 0.577 },
                '2': {
                    v: 'הקורס יעסוק בנושאים שונים בתחום הרפואה הפסיכולוגיה והסוציולוגיה, על ידי ודרך המדיום הקולנועי. בין הנושאים: אבל ואבדן, בריאות הנפש, יחסי מטפל מטופל, מין ומגדר. אמצעי הלימוד בקורס יכללו הרצאות, צפייה משותפת בסרטים ופרויקט סיום שיכלול הצגת נושא על ידי הסטודנטים.',
                    n: 0.158,
                },
            },
        },
        {
            i: 1115,
            $: {
                '0': { v: '275315', n: 1 },
                '1': { v: 'התמודדות הרופאים עם אלימות במשפחה', n: 0.447 },
                '2': {
                    v: 'אלימות/התעללות במשפחה הינה בעיה שכיחה באוכלוסיה, בעלת השפעות מרחיקות לכת על בריאות הגוף והנפש. שעור אבחון הבעיה ע"י גורמים רפואיים הינו נמוך מאוד, ולכך השפעה על התמשכות הסבל ועל עלויות רפואיות. בקורס ייחשפו המשתתפים לתופעת האלימות במשפחה, מנקודת מבטו של הצוות הרפואי, וילמדו את עקרונות הגישה לנפגעי אלימות במשפחה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1116,
            $: {
                '0': { v: '275317', n: 1 },
                '1': { v: 'ספרות ורפואה', n: 0.707 },
                '2': {
                    v: 'אחת המטרות בחינוך הרפואי היא הבנת החולה, חוויתו את המחלה ודרכי ההתמודדות עמה. בספרות היפה ישנה התייחסות גם לכך, וגם לדמות הרופא, יחסי רופא-חולה וסוגיות אתיות. הספרות מעניקה מבט נוסף על הרפואה, קשריה והקשריה החברתיים, המוסריים וההיסטוריים. בכל שיעור תהיה הצגה ודיון של יצירה. בשיעור האחרון כל סטודנט יידרש לכתוב חיבור על יצירה שקרא בשיעור זה.',
                    n: 0.134,
                },
            },
        },
        {
            i: 1117,
            $: {
                '0': { v: '275320', n: 1 },
                '1': { v: 'מבוא למחקר מדעי ברפואה', n: 0.5 },
                '2': {
                    v: 'ייבחרו 5-4 נושאי מחקר מרכזיים בתחומי הרפואה על פי שיקול דעת מרכז הקורס. הנושאים ייבחנו על פי הנקודות הבאות: עקרונות לתכנון מחקר ברפואה, גישות ושיטות מחקריות שונות, התאמה בין שיטות מחקר לשאלות מחקר, ניתוח תוצאות והסקת מסקנות, דוגמאות ליישומים מחקריים בתחום הרפואה. הציון יינתן על סמך עבודה בתאום עם מרצה מהקורס.',
                    n: 0.14,
                },
            },
        },
        {
            i: 1118,
            $: {
                '0': { v: '275603', n: 1 },
                '1': { v: 'מחלות עיניים', n: 0.707 },
                '2': {
                    v: 'קביעת הציון עפ"י בחינה + ציון מגן. הקנית ידע בסיסי במחלות העיניים אשר יעמוד לסטודנט בעבודתו כרופא כללי או מומחה לכל מקצוע רפואי. למטרה זו ניתנת סדרת הרצאות, סמינרים ודיונים קבוצתיים, בשימת דגש לקשר ההדדי בין מחלות עיניים למחלות סיסטמיות. בנוסף הסטודנט ירכוש ידע הנוגע למחלות עיניים הדורשות טיפול דחוף וכן יהיה מודע לאמצעי הבדיקה המקובלים ברפואת העיניים ולמשמעויות תוצאות הבדיקות המבוצעות ע"י הרופא המומחה. הסטודנטים יעבדו במחלקת העיניים ובמרפאה במשך שבועיים בהם יבדקו חולים בהדרכת מדריך.',
                    n: 0.114,
                },
            },
        },
        {
            i: 1119,
            $: {
                '0': { v: '276011', n: 1 },
                '1': { v: 'פיזיולוגית מערכות הגוף למהנדסים', n: 0.5 },
                '2': {
                    v: "פיזיולוגיה של הלב, מחזור הדם, המודינמיקה, נשימה, כליה, עיכול וויסות הורמונלי של הסביבה הפנימית של הגוף. ניתוח כמותי של תפקוד מערכות הגוף. זרימה בכלי דם ובדרכי האוויר, פעילות מכנית וחשמלית של הלב, מחזור הדם הכלילי, הריאתי וההיקפי, בקרת הלב ומחזור הדם, שיחלוף גזים בריאה וברקמה, נשיאת חמצן ודו-תחמוצת הפחמן בדם, מכניקה של הנשימה, בקרת הנשימה, מאזן הנוזלים, האלקטרוליטים ויון מימן בגוף, הפרשת חומרים על ידי הכליה, בקרת תפקוד הכליה, ספיגת חומרי מזון במערכת העיכול, מכניקה של תנועתיות מע' העיכול, בקרת מערכת העיכול, ויסות הורמונלי של מערכות הגוף - בלוטות ההפרשה הפנימית ומערכות משוב פיזיולוגיות.",
                    n: 0.103,
                },
            },
        },
        {
            i: 1120,
            $: {
                '0': { v: '276307', n: 1 },
                '1': { v: 'פיסיולוגיה של על-לחץ וצלילה', n: 0.5 },
                '2': {
                    v: 'עקרונות פיסיקליים ופסיולוגיים של על-לחץ וסביבה מיימית. השפעות פסיולוגיות ורעילות של גזים בלחץ גבוה. הרעלת חמצן ריאתית ומוחית. פתופסיולוגיה של תאונות צלילה ועקרונות הרפואה ההיפרברית.',
                    n: 0.2,
                },
            },
        },
        {
            i: 1121,
            $: {
                '0': { v: '276413', n: 1 },
                '1': { v: 'אימונולוגיה בסיסית', n: 0.707 },
                '2': {
                    v: 'מבוא לחסינות טבעית ונרכשת. נוגדנים: קבוצות ותת קבוצות - מבנה ותפקיד. גנטיקה וביוסינטזה של נוגדנים. אידיוטיפ, אלוטיפ, אזוטיפ של הנוגדן. היברידומות. משלים בחסינות הומורלית ובדלקת. תבחינים אימוניים. גנטיקה ותפקוד האתר העיקרי לסווג רקמות. מהות האנטיגנים. מערכת הלימפטית: איברים, רקמות, תאים. הקולטן של תאי T. תאים ותפקידים ביולוגיים בתגובות חיסון. תאי עזר, ציטוקינים, לימפוקינים, דלקת, מולקולות הדבקה. נדידת תאים ויחסי גומלין בין תאים. סבילות טבעית ונרכשת. אוטואימוניות. ביולוגיה של השתלות. אלרגיות ורגישויות יתר. תסמונת הכשל החיסוני (AIDS). תנגודת לזיהומים. חסינות של מערכת הריריות. חסינות בילוד. הבסיס המולקולרי של חסרים חיסוניים ראשוניים. תוצאות למידה: 1. הכרת מושגי יסוד באימונולוגיה. 2. הבנה של תהליכי יצירה התמיינות והפעלה של תאים חיסוניים. 3. הבנת תפקידה של מערכת החיסון אופן פעולה ויחסי הגומלין עם מערכות פיזיולוגיות אחרות. 4. יכולת לקשר בין תהליכים חיסוניים ומצבים קלינים.',
                    n: 0.088,
                },
            },
        },
        {
            i: 1122,
            $: {
                '0': { v: '277210', n: 1 },
                '1': { v: 'בריאות הציבור ומערכת הרפואה בארץ', n: 0.447 },
                '2': {
                    v: 'עקרונות הבריאות, בריאות הציבור, חוקי הבריאות, מבנה מערכת הבריאות, ניטור חולי, בריאות סביבה, פיקוח אם וילד, בריאות העובד, מבוא לכלכלת בריאות, קבוצות חלשות באוכלוסיה.',
                    n: 0.204,
                },
            },
        },
        {
            i: 1123,
            $: {
                '0': { v: '277301', n: 1 },
                '1': { v: 'מנגנוני עיבד כאב כמודל למחקר', n: 0.447 },
                '2': {
                    v: 'אנטומית מערכת העצבים המרכזית והעברת גירויים תחושתיים בכלל וגירויי כאב בפרט. תיאוריות בסיסיות של העברת גירויי כאב כגון תיאוריית בקרת השער של וול ומלזק. שיטות מחקר בסיסי וקליני של כאב המבוססות על: פסיכופיזיקה, נוירופיזילוגיה, הדמיה וקישוריות עצבית, נוירוטרנסמיטורים, גנטיקה, ביופסיכוסוציולוגיה חקר אוכלוסיות בריאות כנגד פתולוגיות. תוצאות למידה: 1. הסטודנטים יגלו הבנה של שילוב מנגנונים תחושתיים וקוגניטיביים במערכת העצבים כפי שמתבטאים בתהליכי עיבוד כאב. 2. ידעו להעריך שאלות מחקר, תכנון ניסויים, עיבוד נתונים וכן פרשנות ממצאים.',
                    n: 0.115,
                },
            },
        },
        {
            i: 1124,
            $: {
                '0': { v: '277311', n: 1 },
                '1': { v: 'אלקטרופיזיולוגיה של שריר הלב', n: 0.5 },
                '2': {
                    v: 'פוטנציאל פעולה איטי ומהיר - ההבדלים ביניהם. הבסיס היוני של פוטנציאל הפעולה. זרם הנתרן והתפשטות פוטנציאל הפעולה בלב. זרם הסידן - תפקידו ביצירת ההתכווצות. זרמים החוצה. הפרעות קצב - מנגנונים אפשריים.',
                    n: 0.18,
                },
            },
        },
        {
            i: 1125,
            $: {
                '0': { v: '278005', n: 1 },
                '1': { v: 'פרקים באימונולוגיה מודרנית', n: 0.577 },
                '2': { v: 'הנושאים יבחרו לפי הספרות השוטפת.', n: 0.447 },
            },
        },
        {
            i: 1126,
            $: {
                '0': { v: '278018', n: 1 },
                '1': { v: 'נושאים עדכניים במדעי הרפואה 2', n: 0.447 },
                '2': {
                    v: 'הקורס הינו מסגרת למרצים אורחים המתארחים בפקולטה ומאפשרת להעשיר את מגוון הקורסים הקיים בחידושים מחזית המדע. הסילבוס יקבע על ידי כל מרצה.',
                    n: 0.213,
                },
            },
        },
        {
            i: 1127,
            $: {
                '0': { v: '278023', n: 1 },
                '1': { v: 'בקרת הביטוי הגנטי מחיידק לאדם', n: 0.447 },
                '2': {
                    v: 'מורכבות בקרת הביטוי הגנטי: עקרונות ומנגנוני בקרת השעתוק, התרגום והאיכות המפקחים עליהם במערכות פרוקריוטיות ואאוקריוטיות. בקרות אאוקריוטיות ייחודיות (שחבור RNA ). יושם דגש על הצימוד שהתגלה לאחרונה בין מנגנוני הבקרה השונים ועל מעורבות בקרות הביטוי הגנטי ביכולת התאר להגיב למצבי סביבה משתנים.',
                    n: 0.154,
                },
            },
        },
        {
            i: 1128,
            $: {
                '0': { v: '278300', n: 1 },
                '1': { v: 'עבודה סמינריונית בביופיסיקה', n: 0.577 },
                '2': {
                    v: 'הקורס מאפשר למשתלמים ללמוד באופן יסודי נושא ספציפי בתחום הבעיות השייכות לביופיסיקה, לרכז את המידע הקיים הקשור לאותו נושא ולהגיש את החומר בצורה מסודרת כדו"ח בכתב ובדרך כלל הרצאה סמינריונית.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1129,
            $: {
                '0': { v: '278301', n: 1 },
                '1': { v: 'עבודה סמינריונית בפיסיולוגיה', n: 0.577 },
                '2': {
                    v: 'הקורס מאפשר למשתלמים ללמוד באופן יסודי נושא ספציפי בתחום הבעיות השייכות לפיסיולוגיה של מערכות קרדיווסקולריות ומערכות ויסות, לרכז את המידע הקיים בקשר לאותו נושא ולהגיש את החומר בצורה מסודרת כדו"ח בכתב ובדרך כלל גם ע"י הרצאה סמינריונית.',
                    n: 0.164,
                },
            },
        },
        {
            i: 1130,
            $: {
                '0': { v: '278306', n: 1 },
                '1': { v: 'עקרונות בניסויים הומניים בבע"ח', n: 0.5 },
                '2': {
                    v: 'השקפות רווחות בחברה כלפי ניסויים בבעלי חיים, תרומה של ניסויים בבעלי חיים לידע ורווחה אנושיים, ביולוגיה של חיות מעבדה, ביולוגיה של חיות מהונדסות גנטית, מבוא לסטטיסטיקה ותיכנון של ניסויים בבעלי חיים, רווחה ומצוקה של חיות מעבדה, פיזיולוגיה ופרמקולוגיה של כאב, עקרונות של עבודת מעבדה נכונה, מעקב ניסויים בבעלי חיים, בטיחות בניסויים בבעלי חיים',
                    n: 0.137,
                },
            },
        },
        {
            i: 1131,
            $: {
                '0': { v: '278415', n: 1 },
                '1': { v: 'סמינר באימונולוגיה 1', n: 0.577 },
                '2': {
                    v: 'נושאים מובחרים מהספרות השוטפת על התקדמויות באימונולוגיה. הנושאים יהיו בשטחים: אימונוכימיה אימונולוגיה תאית, פרמקו-אימונולוגיה, הכרה עצמית וסבילות גנטיקה של התגובה החיסונית ופתו-אימונולוגיה אימונולוגיה התפתחותית.',
                    n: 0.204,
                },
            },
        },
        {
            i: 1132,
            $: {
                '0': { v: '278466', n: 1 },
                '1': { v: 'מבוא אינטגרטיבי לייעוץ גנטי', n: 0.5 },
                '2': {
                    v: 'גישה מעשית לקראת השתלבות במכונים לגנטיקה, כולל עקרונות ניהול שיחה ואתיקה של ייעוץ גנטי, חוק גנטיקה, סוגי הפעילות במכון, אנמנזה רפואית משפחתית וציור עצי משפחה, עקרונות הייעוץ לקרובי משפחה, לאור גיל האשה, לאור ממצאים חריגים של בדיקות בהריון, למשפחות עם היסטוריה של מומים או מחלות גנטיות שכיחות, חישובי סיכון, תהליך קבלת החלטות של הנועצים.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1133,
            $: {
                '0': { v: '278467', n: 1 },
                '1': { v: 'סמינריון מחקר בגנטיקה רפואית 1', n: 0.447 },
                '2': {
                    v: 'תכנון עצמאי והכנה של הצעת מחקר באחד משטחי הגנטיקה הרפואית, בהנחיית מומחה בגנטיקה רפואית. על הסטודנט להגיש חיבור ערוך בצורת הצעת מחקר אשר יוגש למנחה, ויוצג במסגרת סמינריון. החיבור יכלול רקע מדעי וסקירה של הספרות העדכנית הקשורה להצעת המחקר, שאלת מחקר, מטרות המחקר, שיטות ותכנון מתודולוגיה שתיתן מענה לשאלה המדעית / מחקרית שהוצגה, חשיבות המחקר וסקר התכנות בסיסי לבצוע המחקר.',
                    n: 0.129,
                },
            },
        },
        {
            i: 1134,
            $: {
                '0': { v: '278469', n: 1 },
                '1': { v: 'ייעוץ גנטי קליני ומעבדתי 1', n: 0.447 },
                '2': {
                    v: 'עקרונות יסוד ביעוץ גנטי כולל: היסטוריה משפחתית, תורשה רציסבית, אחוזה ב-X, מיטוכנדריאלית ומולטיפקטוריאלית. ייעוץ גנטי רלוונטי להפרעות מספריות ומבניות של כרומוזומים. בדיקות סקר גנטיות. מאפינים תרבותיים ודתיים של אוכלוסיות אתניות שונות. ייעוץ גנטי במחלות ממאירות. גורמי סיכון למחלות גנטיות ומומים מולדים. שימוש מושכל ופרשנות של בדיקות ציטוגנטיות, מולקולריות, בדיקות תאחזיה גנטית, בדיקות ביוכימיות. העברת בשורה מרה.',
                    n: 0.134,
                },
            },
        },
        {
            i: 1135,
            $: {
                '0': { v: '278479', n: 1 },
                '1': { v: 'מודלים התנהגותיים', n: 0.707 },
                '2': {
                    v: 'נושאים: התשתית הביולוגית של תופעות התנהגות, והשימוש במודל התנהגותי בחיות מעבדה. המנגנון המולקולארי,מסלולים עצביים ותהליכים המתרחשים במערכת העצבים הקשורים לתופעות התנהגותיות מורכבות. תהליך הפיתוח והעבודה עם מודלים של בעלי חיים הרלוונטים להפרעות פסיכיאטריות. שיטות שונות לצירת עכברי נוקאאוט ועכברים טרנסגניים, באפיון פנוטיפי התנהגותי.',
                    n: 0.152,
                },
            },
        },
        {
            i: 1136,
            $: {
                '0': { v: '278489', n: 1 },
                '1': { v: 'דימות בחיה השלמה- תאוריה ומעשה', n: 0.447 },
                '2': {
                    v: 'היבטים תיאורטיים ומעשיים בתחום מדעי החיים של דימות רב מערכתית בחיה השלמה כולל במערכות אופטיות לזיהוי סיגנלים פלורוסנטים ולומינסטים באופן לא פולשני, אולטרסאונד ומערכות (MAGNETIC RESONANCE IMAGING ) MRI .',
                    n: 0.183,
                },
            },
        },
        {
            i: 1137,
            $: {
                '0': { v: '278501', n: 1 },
                '1': { v: 'ביולוגיה התפתחותית', n: 0.707 },
                '2': {
                    v: 'נושאים בסיסיים בביולוגיה התפתחותית, התפתחות מוקדמת של העובר, יצירת רקמות ואיברים, תאי גזע, רגנרציה, אבולוציה והתפתחות, פגמים התפתחותיים בעובר.תוצאות למידה:\nבסיום הקורס הסטודנטים ילמדו ויכירו את: 1. יצירת תכנית הגוף של זבוב הדרוזופילה, דג, צפרדע, תרנגול, עכבר והאדם. 2. תפקיד מולקולות סיגנלים ופקטורי שיעתוק חשובים בהתפתחות עוברית. 3. מנגנונים מולקולריים המשפיעים על מורפוגנזה בעובר. 4. תפקיד תאי הגזע בהומאוסטזיס של רקמה. 5. תופעת הרגנרציה והבקרה המולקולרית שלו.',
                    n: 0.123,
                },
            },
        },
        {
            i: 1138,
            $: {
                '0': { v: '278507', n: 1 },
                '1': { v: 'ביוסטטיסטיקה וניתוח נתונים', n: 0.577 },
                '2': {
                    v: 'הסתברות והתפלגויות, סטטיסטיקה תיאורית, מבחני השערות פרמטריים ואפרמטריים, ניתוח שונות, רגרסיה, סיווג, הורדת מימד, אישכול. תוצאות למידה: בסיום הקורס הסטודנט יוכל:\n1. להציג נתוני מחקר באמצעות מדדים כמותיים וכלים גרפיים מתאימים.\n2. לבחור וליישם את שיטת הניתוח הסטטיסטי המתאימה לנתונים.\n3. להשתמש בתוכנת RSTUDIO לביצוע המבחנים הסטטיסטיים.\n4. להבין את תוצאות הניתוחים הסטטיסטיים המוצגים בספרות המחקרית.',
                    n: 0.139,
                },
            },
        },
        {
            i: 1139,
            $: {
                '0': { v: '278953', n: 1 },
                '1': { v: 'נושאים עדכניים במדעי הרפואה', n: 0.5 },
                '2': {
                    v: 'קורס סמינרים בו בכל שבוע מרצה אחר/ת יעבירו סמינר, הסטודנטים יהיו פעילים במהלך הסמינר וגם ישארו עם המרצה לדיון לאחר ההרצאה. בתום הקורס הסטודנטים יגישו עבודה כתובה בהתאם לשאלות מנחות. הקורס ילמד את הסטודנטים הבנה בסיסית של עבודות מחקר וביקורתיות על מחקרים אקדמיים. בנוסף, הקורס יקנה לסטודנטים מיומנויות תקשורת עם מדענים.\nתוצאות למידה:\n1. הבנה בסיסית של מחקר מדעי.\n2. דרכי תקשורת עם מדענים, שאלת שאלות ודיון פתוח.\n3. חשיבה ביקורתית על עבודות מדעיות. _',
                    n: 0.119,
                },
            },
        },
        {
            i: 1140,
            $: {
                '0': { v: '278955', n: 1 },
                '1': { v: 'רדיקלים חופשיים בביולוגיה ורפואה', n: 0.5 },
                '2': {
                    v: "הביוכימיה של רדיקלים חופשיים, של צורונים מחמצנים אחרים ושל נוגדי חמצון. התגובה התאית לעקה חמצונית: תהליכי יצירת נזק תאי ותיקונו, מנגנוני בקרה, אוטופאג'י, ומוות תאי. תפקידם ודרכי פעולתם של צורונים מחמצנים ונוגדי חמצון בגוף, בדגש על מערכת החיסון ויחסי פתוגן-מאכסן. עקה חמצונית בתהליכים פתופיזיולוגיים: דלקת, מחלות כלי דם, מחלות ניווניות של מערכת העצבים, הזדקנות, סרטן.\nתוצאות למידה: בסיום הקורס הסטודנטיות והסטודנטים יהיו מסוגלים:\n1. לפרט את הסוגים והתפקידים הפיסיולוגיים של חומרים מחמצנים פעילים ונוגדי חמצון.\n2. לפרט אודות התגובה התאים לעקה חמצונית.\n3. להכיר את המעורבות של חומרים מחמצנים פעילים בתגובה החיסונית ובמחלות בבני אדם.",
                    n: 0.105,
                },
            },
        },
        {
            i: 1141,
            $: {
                '0': { v: '314003', n: 1 },
                '1': { v: 'מבוא למכניקת המוצקים', n: 0.577 },
                '2': {
                    v: 'מאמץ ועיבור ממוצע. מאמץ ועיבור בנקודה. טרנספורמציה של מאמצים ועיבורים, מצב מאמץ ועיבור מישורי. מאמצים תלת-מימדיים. חוק HOOK המוכלל. מאמצים בחומר רב שכבתי רב חומרי, כפיפה של קורות. מאמצים בשכבות דקות, פתרון בעית תנאי שפה.',
                    n: 0.169,
                },
            },
        },
        {
            i: 1142,
            $: {
                '0': { v: '314006', n: 1 },
                '1': { v: 'אפיון מבנה והרכב חומרים', n: 0.5 },
                '2': {
                    v: "קשר בין מבנה ומיקרו מבנה החומרים. אנליזת מבנה קריסטלוגרפי: סריג ישר, סריג הופכי, דיפרקצית קרני-X ודיפרקצית אלקטרונים. מיקרוסקופיה אופטית: עקרון יצירת הדמות, רזולוציה וקונטרסט עוצמה, קונטרסט פאזה. מיקרוסקופית אלקרונים: עקרונות יצירת דמות, רזולוציה וקונטרסט במיקרוסקופית אלקטרונים, חודרים, סורקים, יונים. אנליזת הרכב חומרים: ספקטרוסקופית קרני-X, אלקטרוני אוז'ה לאנליזת פני השטח.",
                    n: 0.143,
                },
            },
        },
        {
            i: 1143,
            $: {
                '0': { v: '314009', n: 1 },
                '1': { v: "מעבדה בחומרים הנדסיים ח'", n: 0.5 },
                '2': {
                    v: 'מבנה ותכונות של חומרים: שיטות בדיקה של תכונות מכניות, מטלוגרפיה אופטית, גורמי פריכות, התעייפות. הכרת חומרים הנדסיים והכרת תהליכים: דיאגרמת פאזות, פולימרים, עבודה עם מחשב במדע והנדסה של חומרים, אלסטומרים, חיסום והרפיה, זיקון.',
                    n: 0.174,
                },
            },
        },
        {
            i: 1144,
            $: {
                '0': { v: '314014', n: 1 },
                '1': { v: 'חומרים ביו-רפואיים', n: 0.707 },
                '2': {
                    v: 'חומרים ביורפואיים מתכתיים. חומרים ביורפואיים קרמיים,זכוכיתיים וזכוכית-קרמיים. חומרים ביורפואיים פולימריים בלתי מתכלים ומתכלים. תגובת הגוף המארח והתאמה ביולוגית. תכונות פני השטח והשפעתן על האינטראקציה עם הסביבה הביולוגית. מטריצה חוץ תאית. אימונולוגיה ותגובה אימונית לחומרים ביורפואיים. זיהומים קשורים לחומרים ביורפואיים. מערכות נדבקות רירית (מוקן-דביקות). הנדסת רקמות. תרפיה תאית ואימונו-בידוד.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1145,
            $: {
                '0': { v: '314100', n: 1 },
                '1': { v: 'עקרונות ודרכי למידה בהנ. חומרים', n: 0.447 },
                '2': {
                    v: 'הגדרת המקצוע הנדסת חומרים, תחומי הנדסת חומרים: מטלורגיה, חומרים קרמיים, חומרים פלסטיים, חומרים ביולוגיים וחומרים אלקטרוניים. מבוא והכרה כללית של שיטות האפיון הראשיות לחומרים. מקומו של מהנדס החומרים בתעשיה שימוש בספריות בטכניון ודליית נתונים אלקטרונית. שיטות למידה והכנה לבחינות. הקורס נלמד שעה אחת לשבוע.',
                    n: 0.151,
                },
            },
        },
        {
            i: 1146,
            $: {
                '0': { v: '314124', n: 1 },
                '1': { v: 'נושאים מתקדמים בהנדסת חומרים 1', n: 0.447 },
                '2': {
                    v: 'קורס מתקדם שנועד ללימוד מעמיק בשטח ספציפי במדע והנדסת החומרים. סילבוס מפורט נקבע באותו סמסטר בו ניתן הקורס.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1147,
            $: {
                '0': { v: '314309', n: 1 },
                '1': { v: 'תהליכי ייצור ועיבוד חומרים', n: 0.5 },
                '2': {
                    v: 'מבוא: שיטות יציקה, התמצקות מהירה, קשר בין קצבי קירור ומיקרומבנה, שיטות ריתוך והלחמה, מיקרומבנה באזורים המושפעים תרמית, זיקוק אזורי וגידול גבישים, טכנולוגית (מטלורגית) אבקות, תיאורית הסינטור, סינטור בפאזה נוזלית, שיטות טכנולוגית אבקות מתקדמת: סגסוג מכני, HIP, חישול אבקות, יצור חומרים מרוכבים, עיצוב בהזרקה, תהליך סול-גל, תהליכים כימיים לייצור אבקות, טיפולי פני שטח: הקשייה, ציפויים נגד קורוזיה, מחסומי דיפוזיה, מחסומים תרמיים. שיטות CVD ו- PVD, השתלת יונים, ליטוגרפיה, חיבורים במיקרואלקטרוניקה, עיבוד שבבי וחיתוך, עיצוב פלסטי, יצור ועיצוב מוצרי זכוכית, חומרים פלסטיים ומרוכבים.',
                    n: 0.111,
                },
            },
        },
        {
            i: 1148,
            $: {
                '0': { v: '314312', n: 1 },
                '1': { v: 'מבוא לחומרים פולימריים', n: 0.577 },
                '2': {
                    v: 'הגדרות, מנגנוני ותהליכי פילמור, משקלים מולקולריים, פולימרים אמורפיים וגבישיים, אפיונים תרמיים, ויסקואלסטיות, תכונות מכניות, ראולוגיה, עיבוד, בחירת חומרים פולימריים.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1149,
            $: {
                '0': { v: '314532', n: 1 },
                '1': { v: 'אלקטרוכימיה, קורוזיה ושיטות הגנה', n: 0.5 },
                '2': {
                    v: 'עקרונות אלקטרוכימיים ותרמודינמיים של תהליכי קורוזיה: פוטנציאל אלקטרודה, זרם החלפה, קיטוב, פוטנציאל מעורב, תאי קורוזיה, דיאגרמות POURBAIX, מנגנון תהליכי קורוזיה, פסיביות. הגורמים המשפיעים על קצב הקורוזיה ושיטות למדידת הקצב. עמידות סגסוגות שונות בתנאי קורוזיה. תהליכי קורוזיה אופיינים, גימום ( PITTING ), קורוזיה בין גרעינית, קורוזית מאמצים. שיטות למניעת קורוזיה: שיטות אלקטרוכימיות, הגנה קתודית ואנודית, טיפול בפני השטח: פסיבציה. טיפול בסביבה הקורוזיבית: אינהיביטורים, סילוק חמצן, בחירת חומרים ותכנון הנדסי מאספקט הקורוזיה.',
                    n: 0.12,
                },
            },
        },
        {
            i: 1150,
            $: {
                '0': { v: '314533', n: 1 },
                '1': { v: "מבוא להנדסת חומרים מ'1", n: 0.5 },
                '2': {
                    v: 'סוגי הקשרים בין האטומים ומבנה הגביש. דיאגרמת הפאזות. המסיסות. התפתחות מיקרומבנה. דיאגרמת ברזל-פחמן ודיאגרמת TTT. חומרים קרמיים ופולימריים. תכונות מכניות: עקומות מאמץ-עיבור. מאמץ הכניעה, הקשיית מעוותים, השפעת הטמפרטורה וקצב העיבור. פגמים בגבישים והקשר בין התכונות המכניות והמיקרומבנה. תיאוריית גריפיט לשבר פריך. חסינות השבר. התעייפות. זחילה. עקרונות לבחירת חומרים.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1151,
            $: {
                '0': { v: '314535', n: 1 },
                '1': { v: 'מבוא להנדסת חומרים', n: 0.577 },
                '2': {
                    v: 'מבוא, סוגי קשרים, מבנה גבישי ופגמים במיקרומבנה. תכונות מכניות: עקומת מאמץ-עבור, תכונות אלסטיות ופלסטיות, שבר משיך ופריך, גורמי פריכות, תאורית גריפית לשבר פריך, חסינות השבר התעיפות מכנית, זחילה, דיאגרמות הפאזות. סגסוגות ברזליות (דיאגרמת ברזל-פחמן ו-TTT), סגסוגות אל-ברזליות. זיקון, חומרים קרמיים. פולימרים.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1152,
            $: {
                '0': { v: '315001', n: 1 },
                '1': { v: "מעבדת חומרים מתקדמת 1ח'", n: 0.5 },
                '2': {
                    v: 'הערה: קביעת הציון תיעשה ע"פי הגשת דוחות והצגת פוסטר מסכם. שיטות איפיון: מיקרוסקופיה אופטית, מיקרוסקופית אלקטרונים חודרת, מיקרוסקופית אלקטרונים סורקת, דיפרקצית קרני-X, מיקרוסקופית כח אטומי. ייצור: נידוף וליתוגרפיה.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1153,
            $: {
                '0': { v: '315014', n: 1 },
                '1': { v: 'פרויקט מתקדם בחומרים', n: 0.577 },
                '2': {
                    v: 'הסטודנטים יבצעו מחקר ניסויי או עיוני באחד מתחומי הנדסת החומרים בהנחיית חבר סגל (אפשרי בשיתוף עם התעשייה). על הסטודנט למצוא נושא מחקר לפני תחילת הסמסטר. היקף המחקר הינו 8 שעות שבועיות במשך סמסטר אחד. בסוף הסמסטר על הסטודנטים להציג את עבודתם בפוסטר באירוע כלל פקולטי ולהגיש דו"ח מסכם.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1154,
            $: {
                '0': { v: '315016', n: 1 },
                '1': { v: 'התקני מוליכים למחצה להנדסת חומרים', n: 0.447 },
                '2': {
                    v: 'מבוא. מעגלים משולבים, קבל מתכת - תחמוצת-מוליך למחצה תלות קיבול במתח לקבל אידאלי וריאלי. טרנזיסטור MOS: אופיין זרם, מגבר לאות קטן, מהפך לוגי, שערים לוגיים וחישוב בוליאני, טרנזיסטור בעל תעלה קצרה, צילום באמצעות התקני מל"מ, זכרונות נדיפים ובלתי נדיפים, התקני מתח גבוה והתקנים מתקדמים.',
                    n: 0.151,
                },
            },
        },
        {
            i: 1155,
            $: {
                '0': { v: '315025', n: 1 },
                '1': { v: 'פרויקט מתקדם בחומרים 2', n: 0.5 },
                '2': {
                    v: 'הסטודנטים ימשיכו את המחקר שהתחילו במסגרת המקצוע "פרויקט מתקדם בחומרים", תוך העמקה נוספת בתחום המחקר, ובתום הסמסטר ידווח על עבודתם וממצאיה בכתב ובע"פ. בנוסף, יהיה עליו להציג את עבודתם בפוסטר באירוע כלל פקולטי. הערה: ההחלטה לגבי הסטודנטים שיוכלו לבצע את המשך הפרויקט בקורס הנ"ל תקבע ע"י מרכז/ת לימודי הסמכה ומרכז/ת הפרויקטים לאחר הצגת תוצאות הפרויקט בסמינר המסכם של חלק א\'.',
                    n: 0.129,
                },
            },
        },
        {
            i: 1156,
            $: {
                '0': { v: '315034', n: 1 },
                '1': { v: 'תהל.עבוד וייצור של חומרים קרמיים', n: 0.447 },
                '2': {
                    v: 'חומרים קרמיים מתקדמים, סיווג לפי תיפקוד, חומרי גלם קרמיים, אפיוני האבקה, אפיוני הנקבוביות, תוספים לתהליכי העיבוד, אריזת האבקות ואחידות, תהליכי טחינה וערבוב, תהליכי עיצוב יבשים, פלסטיים ותרחיפים, יציקה, הזרקה, שיחול, יציקת שכבות, כבישה צירית ואיזוסטטית, עיצוב גוף ירוק, עיצוב בפילמור ממוחשב, כבישה חמה, כבישה איזוסטטית חמה, סינטור במיקרוגל, סינטור בשדה חשמל, שיטות ייצור בתגובה כימית, תהליכי ציפוי והדפסה, מנגנוני סינטור וגידול גרעינים, תהליכי עיבוד סופיים.',
                    n: 0.124,
                },
            },
        },
        {
            i: 1157,
            $: {
                '0': { v: '315035', n: 1 },
                '1': { v: 'פרויקט בחירה בהנדסת חומרים', n: 0.5 },
                '2': {
                    v: 'עבודה עצמאית בהנחיית חבר סגל בטכניון בנושאים ספציפיים (חומרים מתכתיים, חומרים אלקטרוניים, חומרים קרמיים, חומרים פלסטיים, ביו-חומרים, חומרים קוונטיים, חומרים מרוכבים, מדע חישובי של חומרים, וכו\'). הערה: סטודנטים שהשלימו את הקורס "פרויקט מתקדם בחומרים 2" לא יוכלו להרשם לקורס זה. בסוף הסמסטר על הסטודנטים להציג את עבודתו בפוסטר באירוע כלל פקולטי ולהגיש דו"ח מסכם.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1158,
            $: {
                '0': { v: '315037', n: 1 },
                '1': { v: 'תכונות ושימושים של חומרים מתכתיים', n: 0.447 },
                '2': {
                    v: 'מטלורגיה פיזיקאלית. סגסוגות מגנזיום. סגסוגות אלומיניום. פלדות. יצקות ברזל. פלדות מתקדמות בעלות חוזק גבוה ( ADVANCED HIGH STRENGTH STEELS )( AHSS ).',
                    n: 0.213,
                },
            },
        },
        {
            i: 1159,
            $: {
                '0': { v: '315039', n: 1 },
                '1': { v: 'מעבר תנע, חום ומסה להנדסת חומרים', n: 0.408 },
                '2': {
                    v: 'מבוא למכאניקה פלואידים, נפח בקרה, רצף, קווי זרימה, פלואידים סטאטיים, חוקי שימור אינטגראליים, ברנולי, חוקי שימור דיפרנציאליים, נאוויה-סטוקס, אוילר, זרימה צמיגה חיצונית, זרימה למינארית וטורבולנטית, מספר ריינולדס, גרר, שכבת גבול, מבוא למעבר חום, מעבר חום בקרינה, מעבר חום בהולכה, חוק פורייה, משוואת החום, הולכה יציבה חד-ממדית, ייצור חום, הולכה יציבה רב-ממדית והולכה לא יציבה, שיטת קיבול חום המקובץ, מספר ביו, מספר פורייה, הסעה מאולצת, מקדם הסעה, סימילאריות תנע, חום ומסה, מספרי פרנדטל, שמידט, נוסלט ושרווד, זרימה חיצונית ופנימית, הסעה חופשית, רתיחה ועיבוי.',
                    n: 0.11,
                },
            },
        },
        {
            i: 1160,
            $: {
                '0': { v: '315040', n: 1 },
                '1': { v: 'מבוא למדע הזכוכית', n: 0.577 },
                '2': {
                    v: 'מוצקים גבישיים ואמורפיים, מאפיינים ספציפיים של זכוכית, מבנה של זכוכית, הרכבים כימיים, סיליקטים, בורטים, פוספטים, אל-תחמוצות, טכנולוגיות ייצור, תכונות, זכוכית קרמית, יישומים, ספקטרוסקופיה של יוני מעבר במארח מוצק, טווח שקיפות של קרמיקות, בליעה, החזרה, העברה ופיזור קרינה, חומרים קרמיים שקופים, הנדסה, מיגון, חלונות אינפרא-אדום, קרמיקה למערכות לזירה, זרחנים, חומרים פרואלקטריים.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1161,
            $: {
                '0': { v: '315041', n: 1 },
                '1': { v: 'תופעות אופטיות בחומרים', n: 0.577 },
                '2': {
                    v: 'בליעה במוצקים. אקסיסטונים. לומינסנציה במוצקים. בליעה ופליטה במוצקים במימדים נמוכים. בליעה ופליטה בחומרים מולקולריים. תהליכים אופטיים בפולימרים מצומדים. מרכזי מבע במוצקים. יונים כמרכזי פליטה במוצקים.',
                    n: 0.2,
                },
            },
        },
        {
            i: 1162,
            $: {
                '0': { v: '315042', n: 1 },
                '1': { v: 'מבוא לננומדע וננוטכנולוגיה', n: 0.577 },
                '2': {
                    v: 'מבוא, מיון ננוחומרים, קוהזיה, אנרגית שטח, ייצור ננוחומרים, ליתוגרפיה וננוליתוגרפיה, אפיון ננוחומרים - מיקרוסקופית סריקה ומיקרוסקופית אלקטרונים, תכונות ננוחומרים (מבנה פסים, תכונות חשמליות ואופטיות, תכונות מכניות), ננוצינוריות פחמן, גרפין, ננוחוטים של מוליכים למחצה, שימושים של ננוחומרים.',
                    n: 0.167,
                },
            },
        },
        {
            i: 1163,
            $: {
                '0': { v: '315044', n: 1 },
                '1': { v: 'חומרים אופטיים', n: 0.707 },
                '2': {
                    v: 'תכונות אופטיות של חומרים והקשר שלהן למבנה החומר, אובדנים אופטיים, מקדם שבירה ודיספרסיה, מקדם אלקטרו-ותרמו-אופטי, מעבר אור בגבישים. חומרים ותהליכי ייצור אופטיים נפוצים. אפיון תכונות אופטיות של חומרים. יישומים: חומרי מבנה למערכות אופטיות בנראה ובאינפרה אדום, ציפויים ופילטרים אופטיים, סיבים אופטיים, שבבים אופטיים.',
                    n: 0.152,
                },
            },
        },
        {
            i: 1164,
            $: {
                '0': { v: '315045', n: 1 },
                '1': { v: 'תהליכי יצור במיקרואלקטרוניקה', n: 0.577 },
                '2': {
                    v: 'גידול גבישים, דיפוזיה והשתלת יונים, חמצון, דיפוזיות מעבר מואצת, איכול יבש, איכול רטוב ותהליכי ניקוי, פוטוליטוגרפיה, שקוע שכבות דקות, (פולי סיליקון, אלומיניום, נחושת), טיפולים טרמים מהירים, איכול מכני-כימי, אינטגרציה ותנובה.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1165,
            $: {
                '0': { v: '315046', n: 1 },
                '1': { v: 'מבוא לאריזות לרכיבי ולסי מתקדמות', n: 0.447 },
                '2': {
                    v: 'הקוס מלמד על פיסיקה, חומרים , טכנולוגיה ומידול של האריזות לרכיבי VLSI מתקדמים. הקורס מציג את הטכנולוגיות המוכרות כמו אריזות WIRE-BOND ו- FLIP-CHIP יחד עם טכנולוגיות חדישות ומתפתחות כמו אריזות CHIP-SCALE ו- HYBRID PACKAGE. הקורס מציג את שיטות המידול התרמי, המכני והחשמלי של האריזות.',
                    n: 0.151,
                },
            },
        },
        {
            i: 1166,
            $: {
                '0': { v: '315049', n: 1 },
                '1': { v: 'ביומינרליזציה וחומרים ביולוגיים', n: 0.577 },
                '2': {
                    v: 'מבוא לביומינרליזציה, מושגים ומנגנונים בסיסיים, נוקליאציה וגידול של גבישים ביוגניים, סדר לטווח קצר וארוך, מבנה צדפים ימיים, מבנה עצם ושיניים, תכונות מכניות, מגנטיות, אופטיות של חומרים ביולוגיים, הרטבה של משטחים בטבע, ניקוי עצמי של עלים, נושאים חדשניים בתחום.',
                    n: 0.162,
                },
            },
        },
        {
            i: 1167,
            $: {
                '0': { v: '315052', n: 1 },
                '1': { v: 'קינטיקת טרנספורמציות בחומרים', n: 0.577 },
                '2': {
                    v: 'הכח המניע לטרנספורמציות במוצקים. אנרגית גיבס ופוטנציאל כימי. שינויי מבנה גבישי, הרכב ושינויים מורפולוגיים. מעברים מסיביים. מעברים דיפוזיוניים. קינטיקה פנומנולוגית. מעברים פולימורפיים. נוקלאציה הומוגנית והטרוגנית. השפעת שינוי נפח. התבדלות מתמיסות מוצקות. התבדלות קוהרנטית ולא קוהרנטית. מבנה WIDMANNSTATTEN. פרוק ספינודלי. תופעת ההתגסות. פאזות מטסטביליות. מעברים סלולריים ואוטקטואידיים. החלמה וגיבוש מחדש, גידול גרעינים. מעברים ללא דיפוזיה, טרנספורמציה מרטנסיטית.',
                    n: 0.134,
                },
            },
        },
        {
            i: 1168,
            $: {
                '0': { v: '315058', n: 1 },
                '1': { v: 'שיטות לניתוח חומרים באמצעות מחשב', n: 0.447 },
                '2': {
                    v: 'פרמטרים נומריים ופיסיקליים למידול חומרים, אינטרפולציה של פוטנציאלים של חומרים, מציאת שורש עבור יחס דיספרסיה של חומרים, פתרון משוואות אינטגרליות ודיפרנציאליות לחישוב שטף בחומרים, פתרון משוואות דיפרנציאליות רגילות, אלגוריתם מנבא-מתקן, דינאמיקה מולקולארית של חומרים ויישום ליצירת פגם מכני, יישום שיטות לפתרון לחוקי התרמודינמיקה ודיפוזיה הקינטית בחומרים.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1169,
            $: {
                '0': { v: '315059', n: 1 },
                '1': { v: 'חומרים פונקציונלים-תכונות והתקנים', n: 0.577 },
                '2': {
                    v: 'כיצד ניתן להפוך חומר להתקן-בכדי להשיב על שאלה מסקרנת זו, בקורס נכיר את התכונות הפונקציונליות הבסיסיות של חומרים: דיאלקטריות ,מגנטיות, אופטיות. נלמד כיצד מבנה החומר משפיע על תכונות אלו, ואף נלמד את עקרונות הפעולה של מספר התקנים וטכנולוגיות המבוססים על תכונות אלו (למשל, התקני זיכרון, MRI וגלאים שונים- אופטיים, מגנטיים, ביולוגיים).',
                    n: 0.14,
                },
            },
        },
        {
            i: 1170,
            $: {
                '0': { v: '315242', n: 1 },
                '1': { v: 'הנדסת חומרים מרוכבים', n: 0.577 },
                '2': {
                    v: 'הצגת סוגים שונים של חומרים מרוכבים ויישומים. מיקרומכניקה: קבועים אלסטיים, חוזק, מקדמי התפשטות. סיבים: סוגים ותכונות מכניות. מטריצות: דגש על סוגי מטריצות פולימריות, גיאומטריות שריון. מקרומכניקה: תכונות אלסטיות של למינה ותכונות אלסטיות של למינט. תהליכי ייצור: כבישה, אוטוקלב, ליפוף סיבים, פולטרוזיה. שיקולי תכן בחומרים מרוכבים. שיטות אפיון ובדיקה: שיטות הרסניות. בדיקה ללא הרס.',
                    n: 0.137,
                },
            },
        },
        {
            i: 1171,
            $: {
                '0': { v: '316241', n: 1 },
                '1': { v: 'יסודות הקריסטלוגרפיה ת', n: 0.577 },
                '2': {
                    v: 'עיקרי התאוריה של סימטריה, מבנים גבישיים עיקריים, המבנה של גבישים במציאות, גאומטרית השריג ושריג הפוך, אנליזת מבנה של גבישים. תוצאות למידה: הסטודנט יוכל לעבוד באופן מתמטי עם סריגים גבישיים במרחב הישיר וההופכי, יוכל לחשב כיוונים, מישורים, אוריאנטציה, זויות ויחסים גאומטריים אחרים בסריג גבישי, יכיר כל סריגי ברווה, קבוצות הסימטריה ואופרציות סימטריות, יוכל לבצע טרנספורמציות של טנזורים וחישוב תכונות פיסיקליות',
                    n: 0.13,
                },
            },
        },
        {
            i: 1172,
            $: {
                '0': { v: '318221', n: 1 },
                '1': { v: 'מבנה והרכב פני שטח מוצקים', n: 0.447 },
                '2': {
                    v: "מבוא, אפיון פני השטח בעזרת אלומת אלקטרונים, דיפרקצית אלקטרונים מהשטח- LEED, REEHR. ספקטרוסקופית אוג'ר. EELS: ספקטרוסקופית אבודי אנרגיה של אלקטרונים. חקירת פני השטח בעזרת אלומת יונים - פיזור יונים, פיזור רתרפורד, תעול ( CHANNELING ), התזת ( SIMS ( SPUTTERING - ספקטרומטרית מסות של יונים משניים. חקירת פני השטח בעזרת פוטונים: XPS - ספקטרוסקופית פוטואלקטרונים הנוצרים עקב הקרנה בקרני-UPS , X ספקטרוסקופית פוטואלקטרונים הנוצרים עקב הקרנה באור אולטרא-סגול. מיקרוסקופית פני השטח ברזולוציה אטומית: AFM - מיקרוסקופית כוח אטומי, STM - מיקרוסקופית מנהור ( TUNNELING ) סורקת.",
                    n: 0.108,
                },
            },
        },
        {
            i: 1173,
            $: {
                '0': { v: '318320', n: 1 },
                '1': { v: 'תרמודינמיקה וקינטיקה של משטחי בינ', n: 0.447 },
                '2': {
                    v: 'גישת גיבס לתרמודינמיקה של משטחי ביניים. אנרגיית עודף במשטח ביניים. מודלים תרמודינמיים למשטחי ביניים. פוטנציאל כימי ואקטיביות לאלמנטים בשכבות ביניים. הרכב שכבות ביניים. קוים שווי סגרגציה. דיפוזיה בגבולות גרעינים. מודל פישר: משוואות בסיסיות ופתרונן. הערכת דיפוזיביות בגבולות גרעינים מתוך נתונים ניסיוניים. השפעת הסגרגציה על דיפוזיה בגבולות גרעינים. דיפוזיה בגבולות בין פאזות. דיפוזיה בשכבות דקות. דיפוזיה ראקטיבית במשטחי ביניים. דיפוזיית פני שטח. משוואה MULLINS. אי-יציבות משטחי ביניים.',
                    n: 0.123,
                },
            },
        },
        {
            i: 1174,
            $: {
                '0': { v: '318527', n: 1 },
                '1': { v: 'דיפרקציה דינמית ושימושיה בקרני-', n: 0.5 },
                '2': {
                    v: 'סימטריה מרחב וזמן וחוקי שימור.שימור קוואזי-תנע ודיפרקציה. כדור אולד. שטח דיספרסיה. ROCKING CURVES. אפקט PENDELLOSUNG. כבוי. גלים עומדים של קרני-X. דיפרקטומטרים רב גבישיים. החזרה גמורה. הגיאומטריה של דיפרקצית לחיכה. שימושים למבנים שכבתיים.',
                    n: 0.177,
                },
            },
        },
        {
            i: 1175,
            $: {
                '0': { v: '318529', n: 1 },
                '1': { v: 'מיקרוסקופית אלקטרונים סורקת אנליט', n: 0.5 },
                '2': {
                    v: 'האינטראקציה בין אלומת האלקטרונים וחומר, אלקטרונים משניים, אלקטרונים מוחזרים, מנגנוני פיזור אלקטרוניים, אלקטרונים חודרים, פליטה פוטונית. מיקרוסקופית אלקטרונים סורקת ( SEM ), מקורות אלקטרונים, עקרון יצירת דמות, אלקטרואופטיקה של קרן סריקה קטנה, יחס של אות לרעש, קונטרסט ומרחק הפרדה, עיבוד אותות, אנליזת פני-שטח חומרים. ספקטרוסקופית קרני-X, אנליזת פיזור אורכי גל ואנליזת פיזור אנרגיה. אנליזת הרכב חומרים. הקורס כולל מעבדה.',
                    n: 0.13,
                },
            },
        },
        {
            i: 1176,
            $: {
                '0': { v: '318532', n: 1 },
                '1': { v: 'מעבר מטען וחום בחומרים', n: 0.5 },
                '2': {
                    v: 'מבוא: האפקט התרמואלקטרי: יסודות פיסיקליים ויישומים. תרמודינמיקה של התמרה תרמואלקטרית והתקנים. קשרי KELVIN. תכונות טרנספורט אלקטרוניות ותרמיות: גישות מאקרוסקופיות ומיקרוסקופיות. מערכות בעלות סטיה קלה ממצב שיווי משקל תרמודינמי. התיאוריה של BOLTZMANN לייצוג תכונות טרנספורט. פיתוח של מקדמי הטרנספורט האלקטרוניים והתרמיים. מקדמי SEEBECK ו- PELTIER. מספר LORENZ. הפורמליזם של LANDAUER לייצוג תכונות טרנספורט. הולכה תרמית גבישית. מודל CALLAWAY למוליכות תרמית גבישית ומנגנוני פיזור פונונים במצב מוצק. התפקיד של פגמי גביש ומבנים בעלי מימדיות נמוכה. שיטות נסיוניות למדידת תכונות טרנספורט. מיון וסקירה של קבוצות חומרים תרמואלקטריים: קלקוגנידים, תחמוצות וחומרים מסובכי-מבנה. תוצאות למידה:בסיום הקורס הסטודנט ידע:\n1. להכיר את התופעות התרמואלקטריות וכיצדלנצל אותן להמרת אנרגיה.\n2. להכיר את המנגנונים המיקרוסקופים והמאקרוסקופיםהאחראים להולכת מטען וחום בחומרים גבישיים. 3. לדעת ליישם גישות שונות ליצוגשל אותן תכונות טרנספורט בקירוב של סטיות קלות ממצבי שיווי משקל. 4. לדעת כיצד משפיעים פגמי גביש על תכונות טרנספורט אלקטרוניות ותרמיות, וכיצד ניתן לנצל אותם באופן מכוון לעיצוב תכונות פונקציונליות. 5. להכיר שיטות בסיסיות של אפיון תכונות טרנספורט. 6. להכיר את הסוגים העיקריים של חומרים תרמואלקטריים.',
                    n: 0.078,
                },
            },
        },
        {
            i: 1177,
            $: {
                '0': { v: '318541', n: 1 },
                '1': { v: 'יסודות של מיקרוסקופיה סורקת בשדה', n: 0.447 },
                '2': {
                    v: 'תורת אלקטרונים של פני שטח מוצקים. מכאניקה קוונטית של אפקט מנהור. עקרונות הפעלת מיקרוסקופ מנהור סורק. ספקטרוסקופית מנהור. מיקרוסקופית כוח סורקת. שיטות הפעלה במגע וללא מגע. מיקרוסקופיות של כוחות אלקטרוסטאטיים וכוחות מגנטיים. מיקרוסקופיה אופטית קצרת טווח סורקת. עקרונות נאנואינדנטציה רגישת עומק. מגע בין שני מוצקים (בעיית הרץ). שיטת אוליבר-פהרר. נאנוליתוגרפיה. מדידות תכונות מכניות של שכבות דקות. נאנוטריבולוגיה.',
                    n: 0.132,
                },
            },
        },
        {
            i: 1178,
            $: {
                '0': { v: '318600', n: 1 },
                '1': { v: 'חומרים דיאלקטרים: מבנה  תכונות', n: 0.5 },
                '2': {
                    v: 'מנגנוני קיטוב, תאוריות מעבר מקיטוב מיקרוסקופי לקיטוב מקרוסקופי, פרמיטיביות קומפלקסית, רלקסציה, רזוננס, חוזק דיאלקטרי, חומרים דיאלקטרים לינארים ולא לינארים, שכבות דקות דיאלקטריות, התנהגות דיאלקטרית דו- מימדית, סריגי-על פרואלקטרים, השפעת מיקרומבנה והרכב על תכונות דיאלקטריות, רלקסורים, תכונות אופטיות של חומרים דיאלקטרים, חומרים פיאזואלקטרים, שיטות איפיון תכונות דיאלקטריות, יישומים של חומרים דיאלקטרים כדוגמת קבלים, מפסקים, גלאים, זכרונות ועוד.',
                    n: 0.134,
                },
            },
        },
        {
            i: 1179,
            $: {
                '0': { v: '318724', n: 1 },
                '1': { v: 'תערובות פולימרים: מבנה ותכונות', n: 0.5 },
                '2': {
                    v: 'תרמודינמיקה, מורפולוגיה, ראולוגיה, מעברים תרמיים, התנהגות מכנית, ערבוב ראקטיבי, משטחי בינפנים, הצפדה (TOUGHENING), מבנה ליבה-קליפה, תופעות מעבר, פולימרים גבישים נוזלים, מלאנים, תערובות בסקלה ננומטרית.',
                    n: 0.204,
                },
            },
        },
        {
            i: 1180,
            $: {
                '0': { v: '321001', n: 1 },
                '1': { v: 'קורס בסין 2', n: 0.577 },
            },
        },
        {
            i: 1181,
            $: {
                '0': { v: '321002', n: 1 },
                '1': { v: 'קורס בסין 3', n: 0.577 },
            },
        },
        {
            i: 1182,
            $: {
                '0': { v: '321003', n: 1 },
                '1': { v: 'קורס בסין 4', n: 0.577 },
            },
        },
        {
            i: 1183,
            $: {
                '0': { v: '321004', n: 1 },
                '1': { v: 'קורס בסין 5', n: 0.577 },
            },
        },
        {
            i: 1184,
            $: {
                '0': { v: '321005', n: 1 },
                '1': { v: 'קורס בסין 6', n: 0.577 },
            },
        },
        {
            i: 1185,
            $: {
                '0': { v: '321006', n: 1 },
                '1': { v: 'קורס בסין 6', n: 0.577 },
            },
        },
        {
            i: 1186,
            $: {
                '0': { v: '324032', n: 1 },
                '1': { v: "אנגלית למתקדמים א'", n: 0.577 },
                '2': {
                    v: "הקורס מיועד לסטודנטים שסווגו לאנגלית מתקדמים א' על פי הבחינה הפסיכומטרית או בחינת אמי\"ר. הקורס מתרכז באנגלית מקצועית ואקדמית. בקורס נלמדים טקסטים מקצועיים אקדמיים ומושם דגש על מיומנויות תקשורת מקצועית בדיבור, שמיעה, קריאה וכתיבה. דקדוק ומבנה המשפט יילמדו במטרה לתמוך בהבנת הנקרא ובכתיבה. הקורס מכוון לשיפור האנגלית המקצועית וכקדם והכנה לקורס אנגלית מתקדמים ב'.",
                    n: 0.136,
                },
            },
        },
        {
            i: 1187,
            $: {
                '0': { v: '324033', n: 1 },
                '1': { v: "אנגלית טכנית-מתקדמים ב'", n: 0.577 },
                '2': {
                    v: "הקורס מיועד לסטודנטים שסווגו לאנגלית מתקדמים ב' על פי הבחינה הפסיכומטרית או בחינת אמי\"ר ולבוגרי אנגלית מתקדמים א'. הקורס מתרכז באנגלית מקצועית ואקדמית. נלמדים טקסטים מקצועיים אקדמיים ומושם דגש על מיומנויות תקשורת מקצועית בדיבור, שמיעה, קריאה וכתיבה. דקדוק ואוצר מילים יילמדו כתמיכה בארבע מיומנויות אלו. הקורס מיועד לשיפור ארבע המיומניות, לתמיכה באנגלית במקום העבודה וכהכנה לקורסים שיילמדו באנגלית ולאנגלית הנדרשת בתארים מתקדמים.",
                    n: 0.127,
                },
            },
        },
        {
            i: 1188,
            $: {
                '0': { v: '324053', n: 1 },
                '1': { v: 'עברית 3', n: 0.707 },
                '2': {
                    v: 'תוכנית הלימודים כוללת: שיפור ההבעה בכתב ובעל-פה, כתיבת תמצית, דיווח ותכתובת רשמית. הדגש מושם על הבנת מאמרים בנושאים טכניים ומדעיים. המקצוע הוא מקצוע חובה המיועד לסטודנטים שאין להם תעודת בגרות ישראלית, ולסטודנטים שנבחנו בבחינה הפסיכומטרית בשפה זרה. הסיווג למקצוע נעשה על-סמך בחינת יע"ל. סטודנטים המסווגים לרמה זו, חייבים ללמוד את המקצוע בשנה הראשונה ללימודיהם על-מנת למלא את חובותיהם במקצועות העברית הנדרשים בטכניון.',
                    n: 0.127,
                },
            },
        },
        {
            i: 1189,
            $: {
                '0': { v: '324062', n: 1 },
                '1': { v: 'עברית לרפואה - מתחילים 2', n: 0.447 },
                '2': {
                    v: '"עברית לרפואה 2" הוא קורס המשך ל"עברית לרפואה - מתחילים 1". בתוכנית הקורס: ביסוס 4 מיומנויות הלשון - הבנה, קריאה, כתיבה ודיבור. הרחבת אוצר המילים הכללי(שמות עצם, מילות יחס, מילות קישור, פעלים וצירופי לשון) והקניית תבניות לשון ונושאים לשוניים נוספים כגון: סמיכות, שם המספר, שמות תואר, שמות פעולה, דיבור ישיר ועקיף.',
                    n: 0.14,
                },
            },
        },
        {
            i: 1190,
            $: {
                '0': { v: '324063', n: 1 },
                '1': { v: 'עברית לרפואה - רמה בינונית 3', n: 0.408 },
                '2': {
                    v: '"עברית לרפואה 3" הוא קורס המשך ל"עברית לרפואה 2". בתוכנית הקורס: הרחבת אוצר המילים העברי הכללי, הקניית אוצר מילים ראשוני בתחום הרפואה, הקניית היכולת לקרוא מאמר בסיסי ולהבין הרצאה בנושאי מדע ורפואה וטיפוח התקשורת המילולית ובמיוחד התקשורת בתחום הרפואה.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1191,
            $: {
                '0': { v: '324064', n: 1 },
                '1': { v: 'עברית לרפואה מתקדמים 4', n: 0.5 },
                '2': {
                    v: '"עברית לרפואה 4" הוא קורס המשך ל"עברית לרפואה 3". בתוכנית הקורס: העשרת המילון הרפואי, פיתוח יכולת ההבנה של הרצאות ומאמרים רפואיים, פענוח וחיבור של מסמכים רפואיים דוגמת רישום תולדות מחלה, קבלה לבית חולים, מכתבי שחרור, הפניה לרופא מקצועי וכדומה.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1192,
            $: {
                '0': { v: '324065', n: 1 },
                '1': { v: 'עברית לביה"ס הבינלאומי 2', n: 0.5 },
                '2': {
                    v: 'הקורס הוא המשכו של אולפן הקיץ ומיועד לסטודנטים מביה"ס הבינ"ל בלבד. במסגרת הקורס נלמדים נושאים בסיסיים בלשון העברית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1193,
            $: {
                '0': { v: '324069', n: 1 },
                '1': { v: 'עברית לביה"ס הבינלאומי 33', n: 0.5 },
                '2': {
                    v: 'הקורס הוא המשכו של עברית לבינ"ל 2 (324065) ומיועד לסטודנטים מביה"ס הבינ"ל בלבד. בתוכנית הלימודים: הרחבת אוצר מילים (שמות עצם, מילות יחס, מילות קישור ופעלים) והקניית תבניות לשון בסיסיות.',
                    n: 0.186,
                },
            },
        },
        {
            i: 1194,
            $: {
                '0': { v: '324227', n: 1 },
                '1': { v: "אלתור ג'אז למתחילים", n: 0.577 },
                '2': {
                    v: "מטרת הקורס: הקנית ידע תיאורטי ומעשי ביסודות האלתור, פתוח יכולת אלתור על יצירות מתוך רפרטואר הג'אז, והכרת תפקידי הכלים בהרכב גאז תוך האזנה מודרכת לנגני ג'אז שונים.",
                    n: 0.192,
                },
            },
        },
        {
            i: 1195,
            $: {
                '0': { v: '324228', n: 1 },
                '1': { v: "נגינה ואלתור בהרכב ג'אז-למתקדמים", n: 0.5 },
                '2': {
                    v: "מטרת הקורס: יצירת הרכב ג'אז פעיל תוך הרחבת והעמקת הידע התיאורטי והמעשי באלתור, פתוח הרגישות לקצב ולהרגשת הזמן, ופתוח האנטראקציה המוזיקלית בין הנגנים כפי שבא לידי ביטוי בהקלטותיהם של הרכבי ג'אז שונים. הנושאים הנלמדים: סולמות ג'אז, הרמוניה מורחבת, שכתוב וניתוח אלתורים של נגני ג'אז ידועים ושילוב אלמנטים מתוכם בנגינה ובאלתור. דרישות קדם: סטודנטים בעלי רקע באלתור שעברו מבחן מיון ראשוני הכולל נגינת קטע קלאסי ושני קטעי ג'אז כולל אלתור.",
                    n: 0.12,
                },
            },
        },
        {
            i: 1196,
            $: {
                '0': { v: '324235', n: 1 },
                '1': { v: 'תקשורת בין-אישית באמצעי תיאטרון', n: 0.5 },
                '2': {
                    v: 'הקורס משלב לימוד עבודות תאורטיקנים בתקשורת האמנותית, מסטניסלבסקי ועד בארבה, עם תרגילים וסצינות קצרות אשר מטרתן פיתוח המודעות החברתית והאישית. גילום דמויות שונות יעשירו את יכולת התקשורת הבין אישית ויתרום לשיפור המיומנויות הנדרשות צוות ומנהיגות.',
                    n: 0.169,
                },
            },
        },
        {
            i: 1197,
            $: {
                '0': { v: '324236', n: 1 },
                '1': { v: 'תזמורת נשיפה', n: 0.707 },
                '2': {
                    v: "תזמורת הנשיפה הינה גוף ביצוע המורכב מכלי נשיפה מעץ, מתכת וכלי הקשה. הרפרטואר של תזמורות הנשיפה מגוון ונע בין מוזיקה קלאסית, מוזיקה מקורית לתזמורות נשיפה, מוזיקה לסרטים, ג'אז, מוזיקה פופולרית ושירי לכת. במהלך הקורס תיפגש התזמורת לחזרה שבועית. על חברי התזמורת להשתתף בחזרות ולהגיע מוכנים עם התפקידים. בכל סוף סמסטר תזמורת הנשיפה תופיע בקונצרט ובו חובת השתתפות. בנוסף, תזמורת הנשיפה של הטכניון מוזמנת להופיע באירועים נוספים- המועדים יועברו בתחילת כל סימסטר.",
                    n: 0.119,
                },
            },
        },
        {
            i: 1198,
            $: {
                '0': { v: '324250', n: 1 },
                '1': { v: 'עיצוב גרפי ותקשורת חזותית', n: 0.5 },
                '2': {
                    v: 'קורס זה עוסק בעולם העיצוב, היצירתיות והתקשורת החזותית, כולל תהליך העיצוב וכיצד ליישם אותו. הקורס עוסק גם בהבנת ההרכב של יצירה גרפית והכרת העיצוב על התמיכות והפורמטים השונים שלו, וכיצד להשתמש בו כדי לתקשר.',
                    n: 0.171,
                },
            },
        },
        {
            i: 1199,
            $: {
                '0': { v: '324251', n: 1 },
                '1': { v: 'עברית כשפה זרה למתחילים', n: 0.5 },
                '2': {
                    v: 'בקורס נלמד אותיות האלף בית, אוצר מילים, הצגה עצמית, שמות עצם, מילות יחס ויסודות הפועל העברי. בנוסף: הקניית כלים לקריאה, כתיבה, הבנת הנשמע ודיבור.',
                    n: 0.204,
                },
            },
        },
        {
            i: 1200,
            $: {
                '0': { v: '324262', n: 1 },
                '1': { v: 'תולדות הפילוסופיה והמדע בעת החדשה', n: 0.447 },
                '2': {
                    v: 'מטרת הקורס היא ללמוד את התהוות של המדע והפילוסופיה המודרנית בעת החדשה באמצעות קריאת הטקסטים של ההוגים המשפיעים ביותר בתקופה. זה יאפשר להבין טוב יותר את האיפיונים המרכזיים של המדע והפילוסופיה בני זמננו, כפי שנדגים באמצעות סוגית היחסים שבין הגוף לנפש.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1201,
            $: {
                '0': { v: '324266', n: 1 },
                '1': { v: 'מדע וביקורות המדע', n: 0.577 },
                '2': {
                    v: 'נלמד להכיר את מאפייניו הייחודיים של המדע, את כוחו, וגם את מגבלותיו. בין השאר, נעסוק בשאלות: מה מבחין תיאוריות מדעיות מתיאוריות אלטרנטיביות, מתי הסבר יחשב למדעי, איך מוכיחים שתיאוריה היא שגויה, האם אפשר להוכיח שתיאוריה היא נכונה, אם לא, האם זה אומר שהמדע הוא בסך הכל השערה כמו כל השערה אחרת.',
                    n: 0.14,
                },
            },
        },
        {
            i: 1202,
            $: {
                '0': { v: '324267', n: 1 },
                '1': { v: 'יחסי גוף נפש:מאפלטון ועד מדעי המח', n: 0.408 },
                '2': {
                    v: 'הקורס יבחן את סוגית הקשר שבין הגוף לנפש מהיבט פילוסופי. נציג את העמדות המרכזיות מאפלטון ועד ימינו ונתמקד בשאלה כיצד נוצר הפער בין הגוף לנפש בתפיסת טבע האדם בעת החדשה ומהן הדרכים האפשריות לפתרון הבעיה. לקראת סיום הקורס נדון בגישות מדעיות ובגישה פרקטית יותר לבחינת היחסים בין גוף לנפש באמצעות תרגול יוגה.',
                    n: 0.139,
                },
            },
        },
        {
            i: 1203,
            $: {
                '0': { v: '324269', n: 1 },
                '1': { v: 'אתיקה בפעולה', n: 0.707 },
                '2': {
                    v: 'לצמיחה הכלכלית הגלובלית יש גם צד שלילי: השמדה של יערות, הרס המוני של אדמות ובתי גידול ימיים, ירידה במגוון הביולוגי ופליטה מאסיבית של גזי חממה המערערים את היציבות באקלים העולמי. האנושות מתמודדת עם בעיות אקולוגיות חדשות, ועם מחלות זיהומיות חדשות כגון, נגיף ה- COVID-19 שמאיים על העולם.',
                    n: 0.146,
                },
            },
        },
        {
            i: 1204,
            $: {
                '0': { v: '324273', n: 1 },
                '1': { v: 'טכנולוגיה וחברה:אתגרים אתיים', n: 0.577 },
                '2': {
                    v: 'הנוכחות הגוברת של טכנולוגיה בחיינו מייצרת צומת חדש ומורכב, בו להחלטותיהם המקצועיות של מדעני מחשב ומהנדסים עשויות להיות השלכות אתיות, משפטיות וחברתיות מרחיקות לכת ולא צפויות. על מנת להתמודד עם האתגרים הללו בתחומי הבינה המלאכותית, ביג דאטא ורשתות, נצטרך לחדד עקרונות אתיים ומוסריים, ולבחון פתרונות נועזים ויצירתיים.',
                    n: 0.146,
                },
            },
        },
        {
            i: 1205,
            $: {
                '0': { v: '324274', n: 1 },
                '1': { v: 'מבוא להאזנה מודרכת-ענקי הפסנתר', n: 0.5 },
                '2': {
                    v: "תמיד היווה הפסנתר משל לתזמורת שלמה. מהו קסמו של הכלי המפואר הזה שגרר אחריו את המספר העצום ביותר של יצירות, הקורס מיועד לחובבי המוסיקה ללא צורך בידע מוסיקאלי מוקדם, המעוניינים לרכוש כלים לפיתוח והעשרת יכולות האזנה. הוא יבחן יצירות מופת לפסנתר מתקופת הבארוק, דרך הקלאסיקה, הרומנטיקה והאימפרסיוניזם ועד המודרניזם והג'אז.",
                    n: 0.141,
                },
            },
        },
        {
            i: 1206,
            $: {
                '0': { v: '324279', n: 1 },
                '1': { v: 'סוקרטס וממשיכיו', n: 0.707 },
                '2': {
                    v: 'הקורס מוקדש להשקפותיהם של אחדים מגדולי הפילוסופים היוונים, ובפרט סוקרטס, אפלטון, אריסטו, ואחרים, בנוגע לקשרים העמוקים בין ידיעה לאושר. מטרתינו תהיה להבין מהי ידיעה אמיתית, מה זה להיות טוב, ומהו אושר, ואיך הם קשורים ותלויים זה בזה, לפי תפישות ההוגים האלה.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1207,
            $: {
                '0': { v: '324282', n: 1 },
                '1': { v: 'פוליטיקה של זהויות בישראל', n: 0.5 },
                '2': {
                    v: 'למורכבותה של החברה הישראלית ביטויים יומיומיים רבים ותהליכים דמוגרפיים ותרבותיים מעצבים ומשנים את פניה. שינויים אלה מעלים סוגיות מורכבות כגון מהי תרבות ישראלית והאם יש מקום לתרבות ישראלית אחת דומיננטית. הקורס יעסוק בשלושה תחומים מרכזיים בהם סוגיות אלה באות לידי ביטוי בחיי היומיום בישראל: תקשורת ופוליטיקה, משפחה, חינוך ותרבות פופולארית.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1208,
            $: {
                '0': { v: '324283', n: 1 },
                '1': { v: 'כלכלה וחברה:מבט בין-תרבותי', n: 0.577 },
                '2': {
                    v: 'קורס זה בוחן את היחסים המורכבים שבין תהליכים כלכליים כגון ייצור, חליפין וצריכה ותרבות ושינוי חברתי. נדון במונחים שגורים כמו "כלכלה" ו"שינוי חברתי" באמצעות הבנת המימדים התרבותיים והחברתיים שלהם. במהלך הקורס יעסקו התלמידים בדיונים על חייהם הכלכליים של אנשים, נושאים הקשורים בעוני, פיתוח, עבודה והגירה.',
                    n: 0.149,
                },
            },
        },
        {
            i: 1209,
            $: {
                '0': { v: '324284', n: 1 },
                '1': { v: 'חינוך בסין ובישראל', n: 0.577 },
                '2': {
                    v: 'בשלושת העשורים האחרונים חווה סין את השפעתו של שיח חדש המדגיש את החשיבות של חינוך ליצירתיות וחופש אישי. יחד עם זאת, מערכת החינוך בסין נתפשת בהיעדר יצירתיות וחדשנות. מהן הסיבות העיקריות לכך, בקורס נעסוק בשינויים שבמקומו של הילד בחברה הסינית העכשווית תוך התבוננות על החברה הישראלית. התבוננות זו מעניינת שכן הן החברה הישראלית והן החברה הסינית, על אף השוני הרב ביניהן, רואות בחינוך כלי מהותי לעיצוב העתיד.',
                    n: 0.122,
                },
            },
        },
        {
            i: 1210,
            $: {
                '0': { v: '324292', n: 1 },
                '1': { v: 'משפט, שוויון וצדק חברתי', n: 0.5 },
                '2': {
                    v: 'מבוא, רקע היסטורי, סוגי צדק במשפט, חלוקת משאבים חברתיים וכלכליים לתושבי המדינה, מאבק האפרו-אמריקאים לשוויון, התפתחות הזכות לשוויון בארץ בחקיקה ובפסיקת הבג"צ, העדפה מתקנת, שוויון למיעוטים בארץ, זרמים בפמיניזם משפטי, שוויון וצדק במשפט הפרטי, שוויון במקום העבודה, הפליה מחמת גיל (גילנות), שוויון זכויות לאנשים עם מוגבלות.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1211,
            $: {
                '0': { v: '324293', n: 1 },
                '1': { v: 'תובנות יסוד בפילוסופיה של הרמב"ם', n: 0.447 },
                '2': {
                    v: 'הסטודנט ייחשף לתפיסת עולמו של הרמב"ם ויעמוד על המתח והשילוב בין ההגות והמעשה תוך הכרת שני החיבורים המרכזיים של הרמב"ם: משנה תורה ומורה נבוכים. נתרגל קריאה בספרים תוך שימת לב לגבי הדרך הראויה לקריאתו ולפתרון סודותיו. נעסוק בנושאי מנהיגות ופרט, סוגיית הטוב והרע בעולם והפולמוס על הרמב"ם.',
                    n: 0.146,
                },
            },
        },
        {
            i: 1212,
            $: {
                '0': { v: '324295', n: 1 },
                '1': { v: 'הגות יהודית בימי הביניים', n: 0.5 },
                '2': {
                    v: 'בקורס זה נלמד נושאים נבחרים בהגות ימי הביניים. נלמד קטעים נבחרים מתוך כתבי רבי יהודה הלוי, הרמב"ם, רמב"ן ואחרים. נעמוד על הרקע התרבותי וההשלכות של הרעיונות והכתבים על היהדות בימינו. אופי הלימוד יהיה על ידי קריאה ולימוד מתוך הספרים והשירים המרכזיים שנכתבו, דיון במחקרים מאוחרים על כתביה, ניתוח של טקסטים. תוצאות למידה: 1. היכרות עם הוגי הדעות המרכזיים בימי הביניים. 2. היכרות עם ההתמודדויות התרבותיות המרכזיות בתקופה זו. 3. התמודדות עם קריאה ולימוד של טקסטים מתקופה זו. 4. הבנת הרלוונטיות של הוגי הדעות לימינו.',
                    n: 0.109,
                },
            },
        },
        {
            i: 1213,
            $: {
                '0': { v: '324297', n: 1 },
                '1': { v: 'אישים בתנ"ך לאור זמננו', n: 0.5 },
                '2': {
                    v: 'במהלך הקורס ניפגש עם מספר מגוון של דמויות בתנ"ך, מוכרים יותר ומוכרים פחות, נעמוד על הרקע בו הם פעלו, על פעלם והשפעתם בעיצוב ההיסטוריה. תהליך הציונות וחזרת עם ישראל לארצו מקרבים אותנו מחדש למציאות התנכית ולהבנת עולמם. עם כל זאת הלימוד יהיה מעמיק תוך שימוש במקורות מגוונים שנכתבו לאורך אלפי השנים על דמויות אלו.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1214,
            $: {
                '0': { v: '324305', n: 1 },
                '1': { v: 'היסטוריה של המדע', n: 0.577 },
                '2': {
                    v: 'הקורס יסקור את ההיסטוריה של המדע מהעת העתיקה ועד למאה ה- 19 דרך עיון ברעיונות ובצמתים מרכזיים במדע. נדון בשאלה כיצד ידע מדעי מתפתח, מועבר, ומשתנה לאורך הדורות. נעסוק בתפיסת המושג מדע בתקופת שונות בהיסטוריה ונדון במהפכות המדעיות שעיצבו את הדרך בה אנו חושבים על ידע ומדע.',
                    n: 0.146,
                },
            },
        },
        {
            i: 1215,
            $: {
                '0': { v: '324306', n: 1 },
                '1': { v: 'הגנום האנושי-אתיקה, משפט וחברה', n: 0.5 },
                '2': {
                    v: 'ההיבטים האתיים, המשפטיים והחברתיים המלווים את פרויקט הגנום האנושי מראשיתו לפני כשלושים שנה, כולל סוגיות כגון פטנט ובעלות על גנים לעומת שייכותם לכלל המין האנושי, חקיקה והגנה מפני אפליה ברמת הפרט האוכלוסייה, צדק חלוקתי במשאבי רפואה מותאמת אישית, תינוקות מעוצבים גנטית, שיבוט ועריכת הגנום בעוברים ורגולציה למניעת מצבי "מדרון חלקלק", ועוד.',
                    n: 0.14,
                },
            },
        },
        {
            i: 1216,
            $: {
                '0': { v: '324307', n: 1 },
                '1': { v: 'צוהר לספרות המדרש והאגדה', n: 0.5 },
                '2': {
                    v: 'הקורס פורס את ספרות המדרש והאגדה של חז"ל על חיבוריו העיקריים והסוגות הספרותיות הנפוצות שבו, תוך קריאה צמודה בטקסטים נבחרים. יושם דגש על התפתחות דרכי המדרש וסגנונו מהמדרש הקלאסי במאות הראשונות לספירה ועד למדרש המאוחר. ספרות זו והתפתחותה תיבחן על רקע ההקשר ההיסטורי והתרבותי שבו נוצרה.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1217,
            $: {
                '0': { v: '324310', n: 1 },
                '1': { v: 'סוגיות ביחסים בינלאומיים', n: 0.577 },
                '2': {
                    v: 'בראשית הקורס נעסוק בהתפתחות חקר היחב"ל במאה ה-20 ונציג את שתי התיאוריות הבולטות שפותחו במסגרתו-הומניזם וריאל-פוליטיק. בהמשך נדון במאפייני המערכת הבינ"ל ונתחקה אחר אחת התופעות הבולטות ביחב"ל - תופעת המלחמה - ואחר סיבותיה והדרכים האפשריות למניעתה. עוד נעסוק בנושאים דוגמת דיפלומטיה ביחב"ל, הפוליטיקה מאחורי המלחמה הקרה, ומירוץ החימוש הגרעיני.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1218,
            $: {
                '0': { v: '324385', n: 1 },
                '1': { v: 'תקשורת בעל-פה ובכתב באנגלית', n: 0.5 },
                '2': {
                    v: 'קורס מתקדם באנגלית לסטודנטים להסמכה שמטרתו לפתח את מיומנויות הדיבור והכתיבה על ידי חשיפה לאותן המיומנויות הנדרשות בעולם הטכנולוגי והמדעי. הקורס כולל מטלות פעילות כגון: הרצאה, הצגת פרוייקט, משא ומתן מקצועי, כתיבת דו"חות, הצעת מחקר והתכתבות. הערה: דרישות הקדם הן פטור מאנגלית או ציון 75 באנגלית טכנית.',
                    n: 0.146,
                },
            },
        },
        {
            i: 1219,
            $: {
                '0': { v: '324397', n: 1 },
                '1': { v: 'סוגיות בפילוסופיה של מדעי החיים', n: 0.447 },
                '2': {
                    v: 'הקורס יתמקד בהיבטים המדעיים והפילוסופיים של תאורית האבולוציה של דרווין ובשינויים ההיסטוריים במדע, בפילוסופיה ובחברה, שאפשרו את עלייתה של התיאוריה במאה ה-19. נדון בייחודו של הארגון הביולוגי ובהסברים האבולוציוניים להתפתחותה של מורכבות ואדפטציה כנגד התקפותיהם של חסידי התכנון העל-טבעי.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1220,
            $: {
                '0': { v: '324430', n: 1 },
                '1': { v: 'נשים יהודיות בימ"ב-מעמד,הלכה,חברה', n: 0.577 },
                '2': {
                    v: 'בימי הביניים מעמדן של הנשים היה משני לזה של הגברים. עם זאת, תמונה זו אינה חד-גונית, ולה יוצאים מן הכלל רבים ומשמעותיים. במהלך הקורס ייבחנו נושאים שונים כגון: דרכי וגיל הנישואין, מונוגמיה מול פוליגמיה, קיום מצוות, אלימות וניצול נשים, וזאת תוך השוואה עקבית עם הנוהג בחברות הנוצריות והמוסלמיות המקבילות.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1221,
            $: {
                '0': { v: '324432', n: 1 },
                '1': { v: 'פסיכולוגיה של המוזיקה', n: 0.577 },
                '2': {
                    v: 'הצגת התחומים השונים הקשורים להשפעות השונות של המוזיקה על התנהגות האדם. הנושאים כוללים יסודות פסיכו-אקוסטיים, האופנים בהם אנו מגיבים למוזיקה, התפתחות יכולת מוזיקלית, יכולות מוזיקליות יוצאות דופן, אלמנטים קוגניטיביים ומוטוריים של ביצוע מוזיקלי והשימוש שנעשה במוזיקה הן למטרות מסחריות והן בתחום הבריאות.',
                    n: 0.154,
                },
            },
        },
        {
            i: 1222,
            $: {
                '0': { v: '324442', n: 1 },
                '1': { v: 'משפט העבודה בישראל', n: 0.577 },
                '2': {
                    v: 'מהנדס/ת, מנהל/ת ויזם/ית הייטק זקוקים לידע משפטי בשני נושאים: פטנטים ומשפט העבודה. הקורס יעסוק בתיאוריה, העקרונות והפרקטיקה המשפטית בנושאים אלה תוך שילוב היבטים אתיים, חברתיים והיסטוריים.',
                    n: 0.196,
                },
            },
        },
        {
            i: 1223,
            $: {
                '0': { v: '324444', n: 1 },
                '1': { v: "לוחמה פסיכול'-מתעמולה ללוחמת מידע", n: 0.5 },
                '2': {
                    v: 'הלוחמה הפסיכולוגית כמרכיב מרכזי בניהול עימותים. הקורס יחשוף את מרכיבי התחום לאורך השנים ויתמקד במלחמות המאה ה-20. ינותחו מוצרי תעמולה כגון: כרוזים, פוסטרים, סרטים, קריקטורות ועוד.',
                    n: 0.196,
                },
            },
        },
        {
            i: 1224,
            $: {
                '0': { v: '324445', n: 1 },
                '1': { v: 'הסתגלות למצבי לחץ', n: 0.577 },
                '2': {
                    v: 'בקורס יבחנו הבטים שונים על לחץ, ובכללן תגובות דחק. נלמד להבחין בתבניות סוציולוגיות ופסיכולוגיות, וחברתיות של דחק ושל התמודדות. במסגרת הקורס הסטודנטים יוכלו לאתר את מקורות הלחץ האישיים, לנתח את דפוסי ההתמודדות שלהם, ולרכוש כלים ומיומנויות להתמודדות אפקטיבית עם לחץ, על מנת לשפר את איכות חייהם כסטודנטים ובכלל.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1225,
            $: {
                '0': { v: '324453', n: 1 },
                '1': { v: 'אהבה וחוק בעידן הטכנולוגי', n: 0.5 },
                '2': {
                    v: 'לאור פרשיות משפטיות עדכניות המעוררות דילמות חוקיות, מוסריות ופילוסופיות נכיר אתת עולם ההולדה האולטרא חדשני הכולל הולדה מן המתים, פונדקאות, סחר בתאי רבייה וחלקיהם, ברירות עוברים וגנטיקה. בעולם זה מעורבים אהבות, תקוות, מאבקי כוחות, אינטרסים, פוליטיקה ואף רווחים כספיים. נלמד אודות המשפט הישראלי בהקשרים אלו ואת ההשפעות התרבותיות, החברתיות והבינלאומיות.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1226,
            $: {
                '0': { v: '324456', n: 1 },
                '1': { v: 'חשיבה: ביקורת ויצירה', n: 0.577 },
                '2': {
                    v: 'הקורס מציג חשיבה ביקורתית ויצירתית תוך מתן כלים של לוגיקה לא-פורמלית והתבוננות בנתונים. חקירת שיטות חשיבה ומושג החשיבה עצמו תציג תהליכים , מכשולים וכשלים בצד דרכים בהן ניתן לשפר הערכת נתונים והשגת מסקנות וכן ביטוי עצמי. דיונים כיתתיים ושימוש בקטעים ספרותיים ופילוסופיים קצרים יאפשרו למידה ותרגול ערניים.',
                    n: 0.146,
                },
            },
        },
        {
            i: 1227,
            $: {
                '0': { v: '324457', n: 1 },
                '1': { v: 'מוזיאולוגיה וטכנולוגיה', n: 0.707 },
                '2': {
                    v: 'הקורס מציג את תחום המוזיאולוגיה תוך הדגשת הקשר בין טכנולוגיות שונות והמרחב/התערוכה/המבקרים. מוזיאונים יוצגו כמעין מיקרוקוסמוס המאפשר הבנת היחסים בין מרכיבים תכניים מרובים וכן הבנת ארכיטקטורה וטכנולוגיה בתוך הקונטקסט שלהם. מעבר להיכרות עם מוזיאולוגיה בכלל, יתן הקורס תרגיל בהתערבות במוזיאון/תצוגה. הקורס יציג מוזיאונים מרחבי העולם בנוסף לביקורים במוזיאונים המקומיים.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1228,
            $: {
                '0': { v: '324462', n: 1 },
                '1': { v: 'ברלין בקולנוע-מהנאציזם ועד ימינו', n: 0.5 },
                '2': {
                    v: 'הקורס יציג את הדרך בה שימש הקולנוע את הממסד הנאצי להעברת מסריו באמצעות סרטים שהציגו את עוצמתו של המנהיג ועליונות הגזע הארי לצד העברת מסרים אנטישמיים בדבר האיום היהודי לשלמות ולבריאות החברה הגרמנית הארית. כן יוצג הדיאלוג המתקיים סביב סרטים אלו בגרמניה העכשווית.',
                    n: 0.152,
                },
            },
        },
        {
            i: 1229,
            $: {
                '0': { v: '324463', n: 1 },
                '1': { v: 'היסטוריה של המזרח התיכון', n: 0.5 },
                '2': {
                    v: 'הקורס סוקר את הכוח של הלאומיות הדתית והחילונית במזרח התיכון, כיצד נוצרו קבוצות הלאום ומה היחס בין הקבוצות השונות, בפרט הלאומיות האסלאמית החילונית, הפונדמנטליזם האסלאמי והלאומיות היהודית אשר עודנה בקונפליקט עם החברה הערבית האסלאמית.',
                    n: 0.171,
                },
            },
        },
        {
            i: 1230,
            $: {
                '0': { v: '324476', n: 1 },
                '1': { v: 'מדע ובדיה', n: 0.707 },
                '2': {
                    v: 'הקורס יעשיר אוצר מילים טכני תוך קריאה וניתוח ספרו של ליו סיצין בעיית שלושת הגופים. נבחן הבדלים בין פנטזיה ומדע בדיוני, נעקוב אחר אמיתות מדעיות, נבחן קריאה אינטרטקסטואלית של הטקסט, נבדוק מונחי יסוד, נציע אלטרנטיבות לבעיות הנידונות בטקסט, וננתח דמויות מרכזיות בספר.',
                    n: 0.154,
                },
            },
        },
        {
            i: 1231,
            $: {
                '0': { v: '324478', n: 1 },
                '1': { v: 'תכנון וניהול קריירה', n: 0.577 },
                '2': {
                    v: 'קורס זה מציג לסטודנטים את שיטת החשיבה העיצובית ואת יישומה בתכנון ופיתוח קריירה. התלמידים ילמדו לחקור ולעצב את הקריירה והחיים שלהם לאחר לימודם בטכניון בגישה חשיבה עיצובית. הם גם יעריכו את יכולות הקריירה שלהם ויפתחו תוכנית פעולה כדי להתכונן ולהשיק את הקריירה הרצויה להם. במהלך הקורס התלמידים יבינו את תהליך עיצוב הקריירה, את הקשר בין מיומנויות קריירה למסלולי קריירה שונים, יפתחו טכניקות לביצוע חיפושים מוצלחים / יישומי בית ספר לתארים מתקדמים, ויזהו אסטרטגיות הנחוצות לפיתוח קריירה מתמשך במקום העבודה של ימינו. שיעור חוויתי זה יועבר מדי שבוע תוך שימוש בהרצאות, דיונים בסגנון סמינריון, כתבי העת להשתקפות, דוברי אורחים ומנטורינג / אימון אישי.',
                    n: 0.099,
                },
            },
        },
        {
            i: 1232,
            $: {
                '0': { v: '324482', n: 1 },
                '1': { v: 'רישום ביד חופשית למתקדמים', n: 0.5 },
                '2': {
                    v: "מטרת הקורס: המשך פיתוח יכולת הרישום המעשי. לימוד תיאורטי מתקדם של מערכת עקרונות הרישום, הקניית יכולת לרישום אובייקטים מורכבים, הצגת אור וצל, שילוב פרספקטיבה אווירית, הכרת טכניקות שונות ברישום, כולל אקוורל מונוכרום, וכו'.",
                    n: 0.174,
                },
            },
        },
        {
            i: 1233,
            $: {
                '0': { v: '324483', n: 1 },
                '1': { v: 'ציור למתחילים', n: 0.707 },
                '2': {
                    v: "מטרת הקורס: פיתוח יכולת ראשונית לציור המעשי, לימוד תיאורטי של מערכת המושגים והעקרונות באמנות הציור, הקניית יכולת בסיסית לציור אובייקטים שונים: צורות בסיסיות, דומם, אובייקטים מורכבים (נוף), הצגת אור וצל, פרספקטיבה אווירית, קומפוזיציה, וכו'. לימוד הטכניקה של אקוורל (צבע מים).",
                    n: 0.158,
                },
            },
        },
        {
            i: 1234,
            $: {
                '0': { v: '324487', n: 1 },
                '1': { v: 'חשיבה ופיתוח בתלת מימד', n: 0.5 },
                '2': {
                    v: 'מפיתרון קיפולי המבנה של חלבונים ועד תכנון פרמטרי של מערכות מורכבות - ההדמיה התלת מימדית הפכה לכלי מחקר וביטוי אפקטיבי והכרחי המאפשר נקודות מבט חדשות במגוון תחומי הנדסה מדעים עיצוב ואמנות. הקורס יתן בסיס תיאורטי ומעשי לביטוי, פיתוח ובחינה של רעיונות, אובייקטים, מערכות והתנהגויות בתלת-מימד-וירטואלי באמצעות ממשק "בלנדר" (תוכנת תלת-מימד בקוד פתוח המוכרת בסין). נכיר מגוון גישות למידול בתלת מימד, חומריות דיגיטלית, תאורה וצילום במרחב וירטואלי. נתנסה בבחינת תהליכים בעזרת אנימציה וסימולציה פיזיקלית. נתנסה בייצוא הפרוייקט כדימוי וכהדפסה תלת מימדית.',
                    n: 0.112,
                },
            },
        },
        {
            i: 1235,
            $: {
                '0': { v: '324489', n: 1 },
                '1': { v: 'המעצב הטוב בעולם-למידה מהטבע', n: 0.5 },
                '2': {
                    v: 'הקורס יאפשר תרגול מעשי של תהליך מחקר ופיתוח של מוצר\\שירות תוך יישום שיטות של חשיבה עיצובית. הקורס מתאים לסטודנטים להנדסה היות והוא מאפשר בחינה ושילוב בין קונספט, מבנה, תפקוד וצורה. ננתח תהליכים ביולוגיים ופיזיקליים ונראה כיצד להגדיר ולמצות מהם "ד.נ.א" עיצובי ופונקציונלי. נתנסה בשיטות פיתוח קונספטואלי וחזותי כדי להמציא מוצר\\שירות המיישם את תוצאות המחקר.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1236,
            $: {
                '0': { v: '324513', n: 1 },
                '1': { v: 'מחזה-הצגה-מופע', n: 1 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים שמעוניינים לקחת חלק במופע תיאטרלי. מטרת הקורס, לאפשר התנסות חווייתית בתהליכי עבודה באמצעותם נבנה אירוע תיאטרוני. העבודה היצירתית תתבסס על הכירות עם בין מרכיבי היצירה הבימתית ויחסי הגומלין ביניהם שחקן, במאי, טקסט ,חלל וקהל. נתנסה במגוון טכניקות מופע ונעבד קטעים ספרותיים מתוך מחזות ספרים וסרטים, ונשלב ביצירה חומרים מעולמם הרגשי/ אישי והתרבותי של המשתתפים. מתוך כך יבנה אנסמבל קשוב וחקרני שיצור מופע תיאטרוני ייחודי. המופע יעלה במחלקה בסוף הסמסטר.',
                    n: 0.118,
                },
            },
        },
        {
            i: 1237,
            $: {
                '0': { v: '324520', n: 1 },
                '1': { v: 'יזמות עסקית', n: 0.707 },
                '2': {
                    v: 'הקורס עוסק בהצגת התפיסה הכוללת של מיזם עסקי, בדגש על שלב הייזום וההקמה. במהלך הקורס יוקנו הידע והמיומנויות הבסיסיות הנדרשים לבניית תכנית עסקית למיזם בהקמה. במסגרת הקורס יוצגו לסטודנטים תכניות עסקיות חלקיות ושלמות, כאשר ההצגה תתבסס על החומר התיאורטי הנלמד בקורס, ויתבצע ניתוח משותף של התכניות ע"י המרצה והסטודנטים.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1238,
            $: {
                '0': { v: '324521', n: 1 },
                '1': { v: 'יזמות בארגונים-התפתחויות ומגמות', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק בארגונים על סוגיהם השונים, הקשר בין ארגון וסביבה בכלל ובחינת המקרה הישראלי בפרט. בקורס ידונו מגוון נושאים הנוגעים לסוגיות תיאוריות בחקר ארגונים, תהליכים ושינויים ארגוניים, תרבות של ארגון, קבלת החלטות בארגונים, ארגון גלובליזציה ופוסט פורדיזם, הארגון והפרט, עבודה ומשמעות ופוסט ביורוקרטיה ואחריות חברתית.',
                    n: 0.149,
                },
            },
        },
        {
            i: 1239,
            $: {
                '0': { v: '324527', n: 1 },
                '1': { v: 'יסודות היזמות', n: 0.707 },
                '2': {
                    v: 'הקורס כיתת אומן ביזמות ( NNOVATION MASTERCLASS ), הינו קורס ליזמות ולחשיבה יזמית. הקורס נועד להקנות ארגז-כלים של חשיבה יזמית, בדגש על יזמות טכנולוגית, בינתחומית, דיסרפטיבית ובעלת-אימפקט. מאז הקמתו, הטכניון מצטיין בהכשרת מהנדסים שהובילו ומובילים מהפכות טכנולוגיות בתחומים אלה. הקורס מעניק היכרות ותרגול בסיסי של עקרונות החשיבה היזמית שהינם חיוניים על מנת להגיע למצוינות זו. מטרת הקורס אינה מוגבלת להכשרת יזמים עסקיים. אף שהקורס בנוי סביב הקמת מיזם עסקי, מטרתו להקנות כלים של חשיבה יזמית שהינם חיוניים למצוינות בוגרי טכניון באשר הם: בתעשייה, בניהול, ובאקדמיה, ובייזום.',
                    n: 0.108,
                },
            },
        },
        {
            i: 1240,
            $: {
                '0': { v: '324528', n: 1 },
                '1': { v: 'מנהיגות יזמית', n: 0.707 },
                '2': {
                    v: 'מטרת הקורס היא להקנות יכולות הובלה למנהיגות יזמית, תוך רכישה ושילוב של כלים למנהיגות, וחשיבה יזמית ויצירתית: כלים המוכוונים לפתרון אתגרים הנדסיים, טכנולוגים, ומדעיים, במהלך הקריירה המקצועית - בחברת הזנק, בתעשייה האזרחית או הביטחונית. הקורס יעניק תפישה רחבה ומבוא לחינוך ובניה של מהנדסים ומדענים שיהוו את שדרת המנהיגות לחדשנות טכנולוגית.',
                    n: 0.141,
                },
            },
        },
        {
            i: 1241,
            $: {
                '0': { v: '324539', n: 1 },
                '1': { v: 'מחקרי שוק', n: 0.707 },
                '2': {
                    v: 'מטרתו העיקרית של הקורס היא לחשוף את הסטודנטים לתהליך מובנה של חקר שווקים. במסגרת הקורס יילמדו הנושאים: הגדרת בעיית המחקר, תכנון המחקר, שיטות לאיסוף נתונים, תכנון שאלון, שיטות דגימה וניתוח נתונים',
                    n: 0.18,
                },
            },
        },
        {
            i: 1242,
            $: {
                '0': { v: '324540', n: 1 },
                '1': { v: 'היבטים משפטיים ביזמות עסקית', n: 0.5 },
                '2': {
                    v: 'תחום "המשפט המסחרי" הוא אחד מתחומי המשפט המקיפים והעיקריים, והוא מאגד בתוכו מגוון רחב של דינים שיש להם השפעה רבה על חיי היום יום של כולנו. קורס זה יעסוק בסוגיות המרכזיות המרכיבות את דיני העסקים והיזמות העסקית בישראל, ובמסגרת זאת נכיר את העקרונות היסודיים של דיני החוזים, הקניין, התאגידים, המכרזים וההגבלים העסקיים של מדינת ישראל, זאת בנוסף להכרת מערכת המשפט האזרחי מסחרי של מדינת ישראל.',
                    n: 0.124,
                },
            },
        },
        {
            i: 1243,
            $: {
                '0': { v: '324567', n: 1 },
                '1': { v: 'סדנת צילום: שפה וכלים', n: 0.5 },
                '2': {
                    v: 'סדנה זו תתמקד בהתפתחות יכולת ההסתכלות והיישום שלה לצילום, שפת הצילום והטכניקות שלה כגון אור, נקודת המבט, תזמון וקומפוזיציה, יחד עם תיקון ומניפולציה של התמונה. הסדנה תשלב תרגול מונחה בכיתה ובחוץ ותציג מגוון של נושאים הכוללים דיוקן, דיוקן עצמי, טבע דומם, צילומי טבע וצילומי סביבה עירונית.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1244,
            $: {
                '0': { v: '324600', n: 1 },
                '1': { v: 'גרמנית 1', n: 0.707 },
                '2': {
                    v: 'הקנית יסודות השפה המדוברת, הקריאה, הכתיבה והדקדוק הבסיסי.',
                    n: 0.354,
                },
            },
        },
        {
            i: 1245,
            $: {
                '0': { v: '324602', n: 1 },
                '1': { v: 'יפנית למתחילים', n: 0.707 },
                '2': {
                    v: 'הקורס יכלול הקדמה לגבי השפה היפנית, לימוד שיטות הכתב הפונטיות, לימוד של כ- 100 - 50 סימונים סינים, הסבר על מבנה המשפט היפני, תרגול שיחה לגבי מצבים בסיסיים, וקריאה של דיאלוגים קצרים.',
                    n: 0.177,
                },
            },
        },
        {
            i: 1246,
            $: {
                '0': { v: '324603', n: 1 },
                '1': { v: 'גרמנית 2', n: 0.707 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים אשר סיימו גרמנית מתחילים 1, ובעלי ידע בסיסי בקריאה, בכתיבה ובדקדוק.',
                    n: 0.267,
                },
            },
        },
        {
            i: 1247,
            $: {
                '0': { v: '324604', n: 1 },
                '1': { v: 'גרמנית 3', n: 0.707 },
            },
        },
        {
            i: 1248,
            $: {
                '0': { v: '324609', n: 1 },
                '1': { v: 'צרפתית 11', n: 0.707 },
                '2': {
                    v: 'הקנית ידיעה ראשיתית של הלשון. הקורס מיועד למתחילים בלבד.',
                    n: 0.333,
                },
            },
        },
        {
            i: 1249,
            $: {
                '0': { v: '324621', n: 1 },
                '1': { v: 'רוסית למתחילים 1', n: 0.577 },
                '2': { v: 'הקנית יסודות השפה.', n: 0.577 },
            },
        },
        {
            i: 1250,
            $: {
                '0': { v: '324626', n: 1 },
                '1': { v: 'ערבית (כשפה זרה) 1', n: 0.5 },
                '2': { v: 'לשון העתונות, הטלויזיה והרדיו.', n: 0.5 },
            },
        },
        {
            i: 1251,
            $: {
                '0': { v: '324627', n: 1 },
                '1': { v: 'ערבית (כשפה זרה) 2', n: 0.5 },
                '2': {
                    v: 'הקנית שליטה בשפה המדוברת ברמה בסיסית (המשך למתחילים 1).',
                    n: 0.333,
                },
            },
        },
        {
            i: 1252,
            $: {
                '0': { v: '324628', n: 1 },
                '1': { v: 'ערבית מדוברת', n: 0.707 },
                '2': {
                    v: 'הקורס מיועד להקניית ערבית מדוברת בלהג הפלסטיני, כולל תקשורת בסיסית בשמיעה ודיבור. הקורס מיועד למתחילים בלבד. ההוראה באותיות עבריות כולל הקנייה ראשונית של יכולת קריאה בערבית. בין נושאי השיחות הנלמדים: ברכות, נימוסים ומנהגים, שיחה בשוק, היכרות, התמצאות בשטח, המשפחה ועבודה. הקורס מקנה הכרה של הדקדוק והכנה להמשך לימוד השפה באופן עצמאי.',
                    n: 0.14,
                },
            },
        },
        {
            i: 1253,
            $: {
                '0': { v: '324630', n: 1 },
                '1': { v: 'איטלקית למתחילים 1', n: 0.577 },
                '2': { v: 'הקנית יסודות הלשון.', n: 0.577 },
            },
        },
        {
            i: 1254,
            $: {
                '0': { v: '324631', n: 1 },
                '1': { v: 'איטלקית למתקדמים', n: 0.707 },
                '2': {
                    v: 'הקנית יסודות הלשון (המשך למתחילים 1).',
                    n: 0.408,
                },
            },
        },
        {
            i: 1255,
            $: {
                '0': { v: '324675', n: 1 },
                '1': { v: 'ספרדית למתחילים', n: 0.707 },
                '2': { v: 'הקנית יסודות השפה הספרדית.', n: 0.5 },
            },
        },
        {
            i: 1256,
            $: {
                '0': { v: '324679', n: 1 },
                '1': { v: 'ספרדית ברמה בינונית', n: 0.577 },
                '2': { v: 'הקנית השפה הספרדית ברמה בינונית.', n: 0.447 },
            },
        },
        {
            i: 1257,
            $: {
                '0': { v: '324685', n: 1 },
                '1': { v: 'שיחה באנגלית למתקדמים', n: 0.577 },
                '2': {
                    v: 'הפגישות בכיתה יכללו שיחה ספונטנית באנגלית אידיומטית ותחביר תואם. בנוסף תדרש עבודה אישית במעבדה הלשונית, בעזרת תוכניות מוקלטות מראש, התואמות את שטח התמחות הסטודנטים. השיחה הקבוצתית בנויה על גירויים חברתיים, קלטות וידאו, טקסטים הבודקים ניבים ומילים שימושיות. מיועד למתקדמים, וההרשמה לקורס רק לאחר ראיון.',
                    n: 0.151,
                },
            },
        },
        {
            i: 1258,
            $: {
                '0': { v: '324692', n: 1 },
                '1': { v: 'סינית למתחילים', n: 0.707 },
                '2': {
                    v: 'הקורס מיועד למתחילים ומטרתו היא לאפשר לסטודנט לתקשר בסינית לצרכים פרקטיים יום-יומיים. תוך הדגשת התקשורת בעל-פה. הוא יקנה לסטודנט את הידע הבסיסי הנחוץ ללימוד מתקדם של השפה.',
                    n: 0.192,
                },
            },
        },
        {
            i: 1259,
            $: {
                '0': { v: '324697', n: 1 },
                '1': { v: 'עקרונות מעשיים לעיבוד תמונה', n: 0.5 },
                '2': {
                    v: 'הקורס עוסק בעקרונות של עיבוד ותיקון צילומים, בעזרת תוכנות עיבוד תמונה. במהלכו יחשפו הסטודנטים למגוון נושאים אשר יעניקו יכולות מקצועיות מתקדמות בתחום עיבוד התמונה, תוך מתן דגש על גישות נכונות לשיפור צילומים והצגת הכלים אותם צריך צלם בעבודתו, וכן כלים לעיבוד תמונה בתחום הכנת צילומים למאמרים ולפוסטרים אקדמיים.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1260,
            $: {
                '0': { v: '324864', n: 1 },
                '1': { v: 'יזמות 1', n: 0.707 },
                '2': {
                    v: 'מומחים ירצו בנושאים הבאים: מקום היזמות במשק הישראלי, חדשנות, טכנולוגיה וצמיחה, עריכת סקר ישימות, מערכות תמיכה, דיני עסקים, חדשנות טכנולוגית, פטנטים ורישום פטנטים, הנעה ליזמות, חשיבה יוצרת, מקורות מידע וסקר שווקים, ניתוח ארועים.',
                    n: 0.174,
                },
            },
        },
        {
            i: 1261,
            $: {
                '0': { v: '324881', n: 1 },
                '1': { v: 'פרקים נבחרים בתולדות ישראל', n: 0.5 },
                '2': {
                    v: 'קורס זה נלמד באנגלית. נושאים נבחרים מתולדות בית שני, מתורה שבע"פ, מתקופת ספרד, מתקופת האמנציפציה ומראשית הציונות. הקורס חסום לבעלי תעודת בגרות ישראלית. אם קורס זה לא ניתן, יש לקחת קורס בנושא זה מרשימת קורסי העשרה שניתנים המחלקה ללימודים הומניסטיים ואמנויות בתיאום עם מרכזת לימודי העברית.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1262,
            $: {
                '0': { v: '324946', n: 1 },
                '1': { v: 'הרנסנס באיטליה:מסע אמנותי ותרבותי', n: 0.5 },
                '2': {
                    v: 'הרנסנס מהווה את תקופת המעבר בין ימי הביניים לעת החדשה, בה התחולל שינוי מהותי בזהותו והשקפותיו של האדם, בסביבתו החומרית, האירגונית והגיאוגרפית. הקורס סוקר את "תרבות החצר", כציר שסביבו התפתחה תרבות הרנסנס ומתמקד בחצרות באורבינו, פ\'ררה, מנטואה, פירנצה, מילנו ורומא, תוך התייחסות לאומנות, האדריכלות, תכנון הערים, הגנים והחקלאות. תוצאות למידה: בוגרי הקורס ירכשו מושגי יסוד וידע על תקופת הרנסנס באיטליה, דרך תיאור וניתוח מידגם מייצג של תרבות החצר. הם יהיו מסוגלים לזהות את יצירות האומנות, האדריכלות והגנים המובחרים בתקופה זו. בנוסף, תורחבנה התובנות לגבי הרקע ההיסטורי, הפילוסופי, החברתי והמדעי האפייני לתקופת הרנסנס, המהווה חלק משמעותי בתולדות התרבות.',
                    n: 0.102,
                },
            },
        },
        {
            i: 1263,
            $: {
                '0': { v: '324962', n: 1 },
                '1': { v: 'מבוא לפסיכולוגיה', n: 0.707 },
                '2': {
                    v: 'הקורס מציג את הפסיכולוגיה, ונועד להכיר לתלמידיו מהי חשיבה פסיכולוגית. בקורס נסקור את הגישות המרכזיות בפסיכולוגיה המודרנית, ונכיר את שטחי העניין המרכזיים שלה. נשאל האם הפסיכולוגיה היא מדע, ונכיר את תחומי העניין המעסיקים פסיכולוגים בני זמננו-אישיות, פסיכופתולוגיה, התפתחות, למידה, זיכרון, רגשות ועוד. ההוראה תיעשה באמצעות הרצאות וקריאת החומר המלווה.',
                    n: 0.143,
                },
            },
        },
        {
            i: 1264,
            $: {
                '0': { v: '324978', n: 1 },
                '1': { v: 'תפישת הביטחון הלאומית בישראל', n: 0.5 },
                '2': {
                    v: 'הקורס יעסוק בתפישת הביטחון הלאומית של ישראל, התגבשותה לאורך השנים והגורמים המעצבים אותה. בראשית הקורס נגדיר מהי תפישת ביטחון ומהם מרכיביה, הצבאיים והאזרחיים. בהמשך נעסוק בעקרונות תפישת הביטחון כפי שהוגדרו בידי דוד בן-גוריון ונסביר מדוע אלו נותרו מקובעים לאורך השנים. תשומת לב מיוחדת נקדיש לממסד הביטחוני בישראל ומאפייניו הייחודיים, ובכללם המרכזיות הרבה של צה"ל בחברה, בפוליטיקה, בקביעת המדיניות ובגיבוש הערכת המודיעין הלאומית בישראל.',
                    n: 0.126,
                },
            },
        },
        {
            i: 1265,
            $: {
                '0': { v: '324992', n: 1 },
                '1': { v: 'סוגיות אתיות במרחב האישי והציבורי', n: 0.447 },
                '2': {
                    v: 'מטרת הקורס היא לדון בהיבטים הפרקטיים של המוסר באמצעות דיון בסוגיות פילוסופיות מוסריות. הדיונים יתמקדו בענפי האתיקה היישומית ובסוגיות הנוגעות לצד האפל של פריצות דרך טכנולוגיות, בהקשר האישי והציבורי. בין הנושאים שיידונו: סחר וחופש המידע, אבטחת מידע, עיבוד מידע מוטה מטרה, השלכות אתיות של בינה מלאכותית, וההשלכות של הצטברות מאגרי הדאטה על האינדיבידואל ופרטיותו.',
                    n: 0.136,
                },
            },
        },
        {
            i: 1266,
            $: {
                '0': { v: '325001', n: 1 },
                '1': { v: 'סטודיו אומן בקמפוס 1', n: 0.5 },
                '2': {
                    v: 'תכנית אמן בקמפוס מציעה קורס אמנות או מוזיקה המשתנה בכל סמסטר. הקורס מציע חשיפה הן לרקע התיאורטי והן להתנסות המעשית בהתמחות המקצועית של האמן האורח. הקורס יכלול תחומי מוזיקה, פיסול, רישום ו/או כל צורה אחרת של אמנות.',
                    n: 0.164,
                },
            },
        },
        {
            i: 1267,
            $: {
                '0': { v: '326004', n: 1 },
                '1': { v: 'פילוסופיה של זמן ומרחב', n: 0.5 },
                '2': {
                    v: 'הקורס יחקור סוגיות פילוסופיות בנוגע לזמן ולמרחב, לאור תיאוריות פיסיקליות מודרניות. החל מהוויכוח בין ניוטון ללייבניץ, עבור בחוק השני של התרמודינמיקה, ועד לתורת היחסות הפרטית והכללית. תוצאות למידה:\n1. הבנת סוגיות ומושגים פילוסופיים בנוגע למטפיזיקה של זמן ומרחב._\n2. הבנת האופן שבו תיאוריות פיזיקליות שונות עיצבו את תפיסותינו לגבי זמן ומרחב.\n3. רכישה ו/או שיפור הידע של מושגי יסוד בגיאומטריה אוקלידית ובגיאומטריה לא-אוקלידית, במכניקה ניוטונית, במכניקה סטטיסטית וביחסות של איינשטיין. 4. העמקת הידע בנוגע ליחס שבין המציאות כפי שאנו חווים אותה לבין התיאור המדעי של המציאות.\n5. הבנה בסיסית של בעיית הגוף-נפש, בעיית הרצון החופשי ובעיית זהות האישיות.',
                    n: 0.103,
                },
            },
        },
        {
            i: 1268,
            $: {
                '0': { v: '328013', n: 1 },
                '1': { v: 'אנגלית מורחבת לתארים מתקדמים', n: 0.5 },
                '2': {
                    v: 'הקורס נועד לפתח מיומנויות מתקדמות של הבנה, הנדרשות להתמודדות יעילה עם קריאת חומרים אקדמיים באנגלית. יושם דגש על קריאה וניתוח של טקטסים אקדמיים, העשרת אוצר המלים ותרגול של מבנים דקדוקיים. לצד זאת, תינתן תשומת לב גם לטיפול יכולות הבנת הנשמע והביטוי בעל-פה בשפה.\nתוצאות למידה: בסיום הקורס, הסטודנטיות והסטודנטים יגיעו לרמת שליטה באנגלית המקבילה לרמת B2 ב- ב- EUROPEAN FRAMEWORK OF REFERENCE FOR LANGUAGES, ויהיו מסוגלים:\n1. לקרוא טקסטים אקדמיים באנגלית בתחומי המדע ולהפיק מהם את הרעיונות העיקריים ואת הפרטים ברמות הבנה שונות - מפורשות ומרומזות.\n2. להבין טקסטים מושמעים באנגלית בתחומי המדע ולהפיק מהם את הרעיונות העיקריים ואת הפרטם ברמות הבנה שונות - מפורשות ומרומזות.',
                    n: 0.099,
                },
            },
        },
        {
            i: 1269,
            $: {
                '0': { v: '328014', n: 1 },
                '1': { v: 'העשרה - אנגלית מורחבת למתקדמים', n: 0.447 },
                '2': {
                    v: 'הקורס נועד לפתח מיומנויות מתקדמות של הבנה והפקה, הנדרשות לתקשורת אקדמית באנגלית. קריאה וניתוח של טקטסים אקדמיים, העשרת אוצר המלים ותרגול של מבנים דקדוקיים ייערכו, כמו גם צפייה בקטעי וידאו רלוונטיים ודיון בהם. לאחר שלב הלימוד של כל אחת משש המודולות של הקורס, הסטודנטים והסטודנטיות יבטאו את עמדתם, יפתחו טיעונים ביחס לנושאים הנלמדים וישוו ביניהם, תוך שימוש במיומניות הנלמדות.\nתוצאות למידה: בסיום הקורס, הסטודנטיות והסטודנטים יגיעו לרמת שליטה באנגלית המקבילה לרמה B2 ב- EUROPEAN FRAMEWORK OF REFERENCE FOR LANGUAGES, ויהיו מסוגלים:\n1. לקרוא טקסטים אקדמיים באנגלית בתחומי המדע ולהפיק מהם את הרעיונות העיקריים ואת הפרטים ברמות הבנה שונות - מפורשות ומרומזות.\n2. להבין טקסטים מושמעים באנגלית בתחומי המדע ולהפיק מהם את הרעיונות העיקריים ואת הפרטים ברמות הבנה שונות - מפורשות ומרומזות.\n3. לערוך איטגרציה בין מידע ממקורות שונות לכדי מידע עצמי, תוך נקיטת חשיבה ביקרותית. 4. להתבטא ביתר חפשיות, שטף וקוהרנטיות בנושאים מדעיים, תוך שימוש בקובנציות של תיאור תהליך, תיאור מנגנון פעולה, הסבר של סיבה ותוצאה, הצגת מידע המוצג בגרפים, נימוקים בעד ונגד גישה והבעת דעה המושתת על נימוקי מדעיים.',
                    n: 0.078,
                },
            },
        },
        {
            i: 1270,
            $: {
                '0': { v: '334009', n: 1 },
                '1': { v: 'מכניקת זורמים ביולוגיים', n: 0.577 },
                '2': {
                    v: 'המושג של ביו-זורמים, מכניקת הרצף, דימות ואנליזה בלתי ממדית, משתנים לגרנזים לעומת משתנים אוליירים, שימור מסה, משפט רינולדס, שימור מומנטום, משוואת השימור הקוניסטאטיביות, משוואות אוליר וברנולי, נוייה-סטוקטס, קינמטיקה של נוזלים, משפט פאווסל, זרימה צמיגה ניוטונית, זורמים לא ניוטונים, שכבות גבול, טורבולנציה, מעבר מסה, דיפוזיה משתנה בזמן, משוואת הסעה-דיפוזיה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1271,
            $: {
                '0': { v: '334011', n: 1 },
                '1': { v: 'יסודות תכן ביו-חשמלי', n: 0.577 },
                '2': {
                    v: 'עקרונות מיכשור רפואי, קריטריוני תכן ורגולריזציה. אופיינים סטטיים ודינמיים של מתמרים המשמשים ברפואה, תופעות מיסוך, רעש מדידה וסחיפה. מעגלי תמורה, פונקציות ותמסורת ושגיאות מדידה של ביו-מתמרים. פיסיקה של מוליכים למחצה, עקרונות צומת וטרנזיסטור בי-פולרי, FET ו- CMOS. תכן מעגלים ומגברים לינאריים ע"י מעגלי תמורה ושיטות תכן. דפי מפרט, שימושים סטנדרטיים ומיוחדים לציוד רפואי. תכן מסננים אנלוגיים מסדר ראשון ושני, מסננים מיוחדים. שערים ומעגלי מיתוג. תכן של מערכות מדידה רפואית, התאמת אימפדנסים ושיפור יחס אות לרעש, ושיקולי עיבוד אותות, בטיחות וקרינה.',
                    n: 0.112,
                },
            },
        },
        {
            i: 1272,
            $: {
                '0': { v: '334014', n: 1 },
                '1': { v: 'פרויקט בהנדסה ביו-רפואית 1', n: 0.5 },
                '2': {
                    v: "מיועד לסטודנטים במצב אקדמי תקין, שצברו 110 נק' לפחות. ניתן ללמוד את הקורס עם 3 מתוך 4 הקדמים, כשהקדם החסר יושלם במקביל, בתנאי שהסטודנט יחתים את המנחה הראשי של הפרויקט, את ראש המעבדה ואת האחראי על הפרויקטים על כך שהם יודעים שהקדם חסר לסטודנט ובכל זאת מאשרים לו לעשות את הפרויקט. פרויקט 1 נעשה בקבוצות סטודנטים. כל קבוצה בוחרת נושא מתוך רשימת פרויקטים המפורסמת בראשית הסמסטר. הפרויקט עוסק בתכן מכשור או מערכת לאבחנה או טיפול בתחום הרפואי. העבודה כוללת: סקר ספרות ואיסוף מידע רלבנטי, ניתוח כלכלי של הבעיה כולל סקר שוק, סקירת האפשרויות לפתרון, נתוח פונקציונלי של האפשרויות, בחירת הפתרון האופטימלי והכנת תכן ראשוני. בסוף הסמסטר תוצג מצגת ותוגש עבודה כתובה על הפרוייקט.",
                    n: 0.094,
                },
            },
        },
        {
            i: 1273,
            $: {
                '0': { v: '334019', n: 1 },
                '1': { v: 'מעבדה מתקדמת בהנדסה ביו-רפואית 1', n: 0.447 },
                '2': {
                    v: 'מטרת הקורס לאפשר לסטודנטים מצטיינים להשתלב במעבדת מחקר בהנדסה ביורפואית בתחומים שונים כגון הנדסת רקמות, ביוחומרים ואותות ביולוגיים, תוך לימוד שיטות מחקר וחשיבה מחקרית. על הסטודנט ללמוד את הרקע ולתאר בכתב את הניסויים בהם ישתלב ולקבל אישור מאיש הסגל האחראי על המעבדה. בסוף הסמסטר יסכם הסטודנט את פעילותו במעבדה ויגיש דו"ח כתוב וסמינר.',
                    n: 0.137,
                },
            },
        },
        {
            i: 1274,
            $: {
                '0': { v: '334021', n: 1 },
                '1': { v: 'מגמות בהנדסה ביו-רפואית', n: 0.577 },
                '2': {
                    v: 'מטרת הקורס לחשוף את הסטודנטים לתחומי הפעילות השונים בהנדסה ביו-רפואית ולנושאים אותם ילמדו בצורה יסודית יותר בסמסטרים מתקדמים. במהלך הקורס תינתנה הרצאות שישקפו את ההוראה והמחקר בפקולטה בשלושת המגמות העיקריות: 1. הדמיה ומכשור רפואי 2. מערכות ביומכניות 3. ביו-חומרים וביוטכנולוגיה. הקורס מיועד לסטודנטים מהפקולטה להנדסה ביו-רפואית.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1275,
            $: {
                '0': { v: '334274', n: 1 },
                '1': { v: 'מבוא לאנטומיה של האדם', n: 0.5 },
                '2': {
                    v: 'מטרת הקורס לתת מבוא למבנה גוף האדם, על מנת לספק בסיס ידע באנטומיה מנקודת מבט תפקודית. בסיום הקורס הלומדים יהיו מסוגלים: לתאר את האנטומיה האיזורית של הגוף מבחינת הבאים: מבנה גרמי, שרירים ומפרקים עיקריים, איברים פנימיים עיקריים ויחסיהם המרחביים, עקרונות העצבוב, אספקה דמית וניקוז ורידי ולימפתי. להכיר את עיקרי האנטומיה הרדיולוגית באמצעי הדימות השכיחים ברפואה. להשתמש בבסיס הידע הנרכש על מנת לגשת באופן בסיסי לבעיות קליניות יסודיות.',
                    n: 0.122,
                },
            },
        },
        {
            i: 1276,
            $: {
                '0': { v: '334305', n: 1 },
                '1': { v: 'פרויקט מחקרי לסטודנטים מצטיינים', n: 0.5 },
                '2': {
                    v: 'הקורס מיועד לסטודנטים בתוכנית מצויינים הפקולטית. הסטודנט יונחה באופן אישי ע"י אחד מחברי הסגל בפקולטה ויתמחה באחד מהנושאים בחזית המדע הביו רפואי בהיקף נרחב. הסטודנט יעבוד באופן עצמאי בסיום הקורס יערוך הסטודנט סמינר לקבוצה של חבר הסגל ויגיש דוח.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1277,
            $: {
                '0': { v: '335001', n: 1 },
                '1': { v: 'מעבדה להכרת מכשור ושיטות', n: 0.5 },
                '2': {
                    v: 'המעבדה מתמקדת בהכרה והפעלה של ציוד מדידה בסיסי בתחום החשמל, מכניקה וביו-חומרים, שיטות מדידה וחישובי שגיאות. קביעת ציון עפ"י מעקב במשך הסמסטר, בחני הכנה, הגשת דו"חות ובחינה סופית.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1278,
            $: {
                '0': { v: '335002', n: 1 },
                '1': { v: 'מעבדת נסיון הנדסי וניסויי', n: 0.5 },
                '2': {
                    v: 'במסגרת מעבדה זו סטודנטים מבצעים 6 ניסויים מתקדמים בתחומים של הדמיה ואותות רפואיים, ביומכניקה וזרימה והנדסת רקמות וביו-חומרים. קביעת ציון עפ"י מעקב במשך הסמסטר, בחני הכנה, הגשת דו"חות ובחינה סופית.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1279,
            $: {
                '0': { v: '335003', n: 1 },
                '1': { v: 'מעבדת התמחות בהנדסה ביו-רפואית', n: 0.5 },
                '2': {
                    v: 'במסגרת מעבדה זו סטודנטים מבצעים 5 ניסויים מתקדמים בתחומים של הדמיה ואותות רפואיים, ביומכניקה וזרימה והנדסת רקמות וביו-חומרים. קביעת ציון עפ"י מעקב במשך הסמסטר, בחני הכנה, הגשת דו"חות ובחינה סופית.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1280,
            $: {
                '0': { v: '335005', n: 1 },
                '1': { v: 'מעבדה בהנ. ביו-רפואית 1 לפיזיקאים', n: 0.447 },
                '2': {
                    v: 'המעבדה מתמקדת בהכרה והפעלה של ציוד מדידה בסיסי בתחום החשמל, מכניקה וביו-חומרים, שיטות מדידה וחישובי שגיאות. קביעת ציון עפ"י מעקב במשך הסמסטר, בחני הכנה, הגשת דו"חות ובחינה סופית.',
                    n: 0.189,
                },
            },
        },
        {
            i: 1281,
            $: {
                '0': { v: '335010', n: 1 },
                '1': { v: 'תכן ביומכני בסיסי', n: 0.577 },
                '2': {
                    v: 'קריטריוני כשל ומשמעותם, התעייפות, ריכוז מאמצים, טולרנסים, בחירת חומרים, שחבי ייצור. אנליזה ותכן של: מחברים (הדבקה/ברגים), קפיצים, אמצעי מיסוב, תמסורות, מצמדים. דוגמא: מיסוב ונעילה של מפרק בפרותזה חיצונית, תכן מכניזמים ומתמרים פשוטים. מערכות הנעה ומקורות אנרגיה: סוגים ותכונות של מנועים חשמליים, מערכות הידראוליות ופנאומטיות. דוגמאות: תכן תמסורת ומערכת הנע לכסא גלגלים ממונע ולמערכות הדמיה דינמיות.',
                    n: 0.135,
                },
            },
        },
        {
            i: 1282,
            $: {
                '0': { v: '336001', n: 1 },
                '1': { v: 'רגולציה ומחקר קליני במכשור רפואי', n: 0.447 },
                '2': {
                    v: 'רגולציה של מכשור רפואי בארה"ב, אירופה וישראל. הערכה של מסלול רגולטורי ודרישות תכן בהתאם לשימוש המיועד. מערכת איכות. ניתוח סיכונים. בקרת ציוד רפואי רשום. מחקרים קליניים בבני אדם. מבנה ותכנון פרוטוקול מחקר, לוגיסטיקה,דרישות מקדימות וחוקיות למחקר קליני, הגשה וקבלת אישור מוועדת האתיקה (הלסינקי). תוצאות למידה: בסיום הקורס, הסטודנט:\n1.יכיר מושגים יסודיים ברגולציה ומחקר קליני. 2. יכיר את הדרישות בנוגע לתיעוד של תהליכי פיתוח של מכשור רפואי. 3. יהיה מסוגל לתכנן ולכתוב פרוטוקול מחקר קליני בסיסי. 4. ידע להכין בקשה למחקר קליני לוועדת הלסינקי בארץ. 5. ידע לקבוע מהי הקלסיפיקציה המתאימה למכשיר רפואי נתון. 6. ידע להעריך חלופות למסלול רגולטורי נדרש למכשיר רפואי חדש. 7. יוכל לבחון באופן ביקורתי ישימות ופוטנציאל הצלחה של מחקר קליני על בסיס פרוטוקול המחקר.',
                    n: 0.092,
                },
            },
        },
        {
            i: 1283,
            $: {
                '0': { v: '336020', n: 1 },
                '1': { v: 'תופעות ביו-חשמליות', n: 0.707 },
                '2': {
                    v: 'היבטים הנדסיים ומודלים של תכונות הממברנה, פוטנציאל הפעולה, מודל הודגקין-האקסלי וליו-רודי. פתרונות נומריים של התקדמות פוטנציאל הפעולה בסיב עצב וברקמה דו-מימדית. הגדרת מקורות, מודל מקורות - דיפולים, מונופולים. תיאורית גאוס וגרין, מוליך נפחי. הבעיה הישירה והבעיה ההפוכה. השפעות ביולוגיות של שדות אלקטרו-מגנטיים בתדר נמוך וגבוה (מדידה, השפעות תאיות ולגוף כולו, השפעות טיפוליות). אלקטרופורציה - השפעות השדה על ממברנה, הסעה של מולקולות, תרופות וחומרים גנטיים, יישומים מעבדתיים וברקמות חיות.',
                    n: 0.121,
                },
            },
        },
        {
            i: 1284,
            $: {
                '0': { v: '336022', n: 1 },
                '1': { v: 'מתא לרקמה', n: 0.707 },
                '2': {
                    v: 'תאים ממוינים ומבנה רקמות. נדידת תאים ומגעים בין תאים. המטריקס החוץ תאי. קולטנים והעברת אותות בתקשורת בין תאים. התחדשות ומוות תאים ברקמות. התמיינות תאים ורקמות בהתפתחות העוברית.',
                    n: 0.192,
                },
            },
        },
        {
            i: 1285,
            $: {
                '0': { v: '336024', n: 1 },
                '1': { v: 'חדשנות רפואית במודל ביודזיין 1', n: 0.447 },
                '2': {
                    v: 'הסטודנטים יבחרו, יאפיינו ויבססו צורך קליני ויחלו בסיעור מוחות לגבי פתרונות טכנולוגיים אפשריים. בהמשך, הסטודנטים יעריכו את הפתרונות הטכנולוגיים שהוצעו ויבחרו בפתרון מוביל אותו יפתחו באמצעות בניית אבותי- טיפוס, הפחתת הסיכון הטכני, אסטרטגיות לטיפול בדרישות ספציפיות לבריאות (רגולציה, שיפוי), ואסטרטגיה עסקית (קניין רוחני, מימון, מסחור). תוצאות למידה: הקורס מספק מבוא אינטנסיבי לתהליך של חדשנות טכנולוגית בתחום הרפואי. כחלק מצוות רב-תחומי פרוייקט, ילמד התלמיד:\nכיצד לזהות צורך קליני משמעותי ללא פתרון קיים. לתכנן פתרון טכנולוגי ולייצר אב-טיפוס כדי לענות על הצורך הרפואי שזוהה. להכין תכנית להבאת הפתרון לשוק (כולל התיחסות גיוס מימון, קניין רוחני, רגולציה, שיפוי ומודלים עסקיים).',
                    n: 0.102,
                },
            },
        },
        {
            i: 1286,
            $: {
                '0': { v: '336026', n: 1 },
                '1': { v: 'מחקרים עדכניים בהנדסה ביו-רפואית', n: 0.5 },
                '2': {
                    v: 'הקורס יחשוף בפני סטודנטים להסמכה בשנה האחרונה בתואר (עם ממוצע מעל 82) את מגוון נושאי המחקר בפקולטה וכיווני מחקר עכשווים על מנת לעזור בבחירת נושא מחקר ומנחה בלימודים מתקדמים.\nהקורס יהיה מורכב מהרצאה שבועית שתינתן על ידי חבר סגל בפקולטה, ויכלול כתיבת הצעת מחקר קצרה לפרויקט מחקרי לתואר מתקדם בהנחיית חבר הסגל.\nתוצאות למידה\nבסוף הקורס הסטודנט: 1. יכיר את נושאי המחקר השונים בפקולטה. 2. ירכוש כלים עבור בחירת נושא מחקר ומנחה לתואר גבוה.',
                    n: 0.119,
                },
            },
        },
        {
            i: 1287,
            $: {
                '0': { v: '336027', n: 1 },
                '1': { v: 'עיבוד תמונות רפואיות (עתר)', n: 0.5 },
                '2': {
                    v: 'מבוא לתחום של עיבוד תמונות רפואיות וישומיו, עיבוד אותות דו-מימדיים, התמרה פורייה דיסקרטית דו-מימדית וישומיה בדימות רפואי, שיפור איכות תמונה, טרנספורמציות גיאומטריות, קונבולוציה דו-מימדית, קוונטיזציה של תמונות, שיפור איכות תמונה (פעולות על היסטוגרמה, ניקוי רעש, חידוד), שחזור תמונות, פורמט DICOM לשמירה של תמונות רפואיות, דחיסה. שיטות למידה עמוקה לעיבוד תמונות רפואיות, שפת פייתון ככלי לעיבוד תמונות רפואיות.\nתוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל:\n1. ליישם אלגוריתמים של עיבוד תמונות רפואיות בשפת פייתון.\n2. להחליט איזה אלגוריתם יהיה מתאים לצורך פתרון של אתגר ספציפי בעיבוד תמונות רפואיות. 3. לפתח אלגוריתם לפתרון בעיה נתונה בעיבוד תמונות רפואיות.',
                    n: 0.104,
                },
            },
        },
        {
            i: 1288,
            $: {
                '0': { v: '336208', n: 1 },
                '1': { v: 'שיטות באנליזה של אותות ביולוגיים', n: 0.447 },
                '2': {
                    v: 'אפיון ואנליזה של אותות רציפים או דגימים ע"י סינון, אוטוקרוסקורלציה, ספקטרום הספק וכו\'. דוגמאות מאלקטרוקרדיוגרפיה, אלקטרואנצפלוגרפיה, אלקטרומיוגרפיה. אפיון של עבוד של תהליכים נקודתיים. סטטיסטיקה של מאורעות ושל אינטרולים, אינטראקציה בין מאורעות ובין אינטרולים למאורעות. דוגמאות מאותות נוירופיסיולוגיים. זיהוי פולסים בשיטת TEMPLATE MATCHING, דוגמאות מנוירופיסיולוגיה.',
                    n: 0.151,
                },
            },
        },
        {
            i: 1289,
            $: {
                '0': { v: '336214', n: 1 },
                '1': { v: 'נתוח תהליכים במערכת הראיה', n: 0.5 },
                '2': {
                    v: 'הבסיס הפיסיולוגי של אותות במערכת הראיה: תגובות תאים בודדים ותגובות אוכלוסית תאים (פוטנציאלים ראייתיים מעוררים) לינאריות ואי-לינאריות במערכת הראיה, ברמה הפיסיולוגית והפיסיוכופיסיקלית. שימוש במחשב לשם דגימה, סינון, מיצוע, שמירה ועיבוד של אותות בראיה. שימוש בטכניקות של ניתוח מערכות כגון:פונקציות תמסורת זמנית ומרחבית והתועלת בהן לפיסיולוגיה ולרפואה.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1290,
            $: {
                '0': { v: '336326', n: 1 },
                '1': { v: 'נתוח נתונים ושערוך פרמטרים בהנדסה', n: 0.447 },
                '2': {
                    v: 'מודלים וסווגם, שיערוך כאופטימיזציה. שגיאות ושאריות. הנחות סטטיסטיות סטנדרטיות. רגרסיה לינארית, משערכי מינימום ריבועים רגילים וממושקלים. תוחלת ושונות לפרמטרים ולחזוי. רגרסיה לינארית מרובת משתנים. רגרסיה אי לינארית שיטות חיפוש, אילוצים. מודלים דינמיים סטנדרטיים - משוואות רגישות. תכנון ניסויים. ניתוח השיערוך.',
                    n: 0.158,
                },
            },
        },
        {
            i: 1291,
            $: {
                '0': { v: '336402', n: 1 },
                '1': { v: 'שיטות תכנון ביו-חומרים בביו-רפואה', n: 0.5 },
                '2': {
                    v: "שיטות לתכנון של ביו-חומרים בעזרת צימוד של קבוצות פונקציונליות, כימיה אורגנית של ביו-צימוד, קבוצות פונקציונליות ותגובות נפוצות, מונוסוכרים, פוליסכרידים וציקלודקסטרינים-כימיה, תכונות, שימושים, צימודים, חומצות אמיניות פפטידים ופולי פפטידים, ספריות פאג'ים, אבולוציה מכוונת, תכונות וצימודים, חלבונים ונוגדנים- מוטציות, תצמידים פולימרים אורגניים סינתטיים, אוליגונוקליאוטידים: DNA, RNA, DNA אוריגמי, ליפידים, ליפוזומים, חלקיקי ליפידים מוצקים ננו-צינוריות מפחמן וסיליקון, ביו-חומרים איאורגניים, ביו-חומרים ברפואה מותאמת אישית, שימוש במאגרי מידע גנטיים, CCLE חלבונים, HPA בניה ושימוש במאגרי מידע של ביו-חומרים, תכנון ועיצוב של ביו-חומרים עם CHEMSKETCH, שימוש ב- CEM SPIDER , PUBCHEM. שימוש ב- CEM SPIDER , PUBCHEM. תוצאות למידה:\nבסיום הקורס, הסטודנט יהיה מסוגל: 1. לתכנן ביו-חומרים חדשים עם כלים עדכניים.\n2. להתאים ביו-חומרים לבעיות רפואיות.\n3. להכין תכנית עבודה להוכחת התכננות של חומרים חדשים.",
                    n: 0.093,
                },
            },
        },
        {
            i: 1292,
            $: {
                '0': { v: '336405', n: 1 },
                '1': { v: 'יסודות הנדסיים בביולוגיה וביוטכנו', n: 0.5 },
                '2': {
                    v: '1. ביוטכנולוגיה כמערך ביולוגי - כימופיסיקלי - הנדסי משולב. תחומי יישום. 2. ריאקציה אנזימטית כתהליך יסוד בביוטכנולוגיה. תהליכים רב-שלביים. 3. ביוריאקטורים: יסודות תכנון והפעלה. 4. אנזימים מקובעים: הכנה ואפיון. 5. אינאקטיבציה של ביוקטליזטורים: מנגנונים ודרכי מניעה. 6. פיקוח ובקרה של תהלכים ביוטכנולוגיים. גלאים ביוכימיים. 7. הפרדת תוצרים מביומאסה.',
                    n: 0.144,
                },
            },
        },
        {
            i: 1293,
            $: {
                '0': { v: '336502', n: 1 },
                '1': { v: 'עקרונות הדמיה ברפואה', n: 0.577 },
                '2': {
                    v: 'מבוא: הגדרות יסוד בהדמיה רפואית. הדמיה בעזרת קרני X. עקרונות הטומוגרפיה הממוחשבת ושימושיה. הדמיה באמצעות רדיו-איזוטופים. מצלמת גמא, SPECT, PET. הדמיה באמצעות אולטרסאונד. הדמיה באמצעות תהודה מגנטית גרעינית MRI.',
                    n: 0.186,
                },
            },
        },
        {
            i: 1294,
            $: {
                '0': { v: '336509', n: 1 },
                '1': { v: 'ביומכניקה של רקמות', n: 0.577 },
                '2': {
                    v: 'הקורס עוסק באספקט ההנדסי של מכניקת רקמות ופיתוח כלים אנאליטיים לניתוח דפורמציות ומאמצים במערכות ביולוגיות. הנושאים שידונו : תפקיד מבנה ואפינים מכניים של רקמות. חזרה על מושגי יסוד באלסטיות לינארית, אלסטיות אנאיזוטרופית בעצם. אלסטיות אי-לינארית בדפורמציות גדולות, משוואות קונסטיטוטיביות לרקמות, יחסי מבנה-תפקוד ברקמות, ניתוח מאמצים. מודלים ויסקואלסטים, ויסקואלסטיות לינארית, קוואזי-לינארית ואי-לינארית ברקמות, התנית קדם. מכנקת סחוס ודיסק כחומרים רב-פאזיים תופחים.',
                    n: 0.129,
                },
            },
        },
        {
            i: 1295,
            $: {
                '0': { v: '336521', n: 1 },
                '1': { v: 'עקרונות הנדסיים של המערכת', n: 0.5 },
                '2': {
                    v: 'שיטות מחקר של המערכת הקרדיווסקולרית. אקסיטביליות : יוניות, צימוד בין תאי. צימוד חשמלי-מכני. דינמיקה ואנרגטיקה של הסרכומר. מלקחי-לייזר. חוק פרנק-סטרלינג. רלקסציה ותפקוד דיאסטולי. זרימה קורונרית והצרויות קורונריות. שונות בקצב הלב. בקרת הזרימה הסיסטמית. הפרעות קצב והולכה. כשלון לב מכני. שיטות לכימות תפקוד וחיות הלב.לב מלאכותי.',
                    n: 0.149,
                },
            },
        },
        {
            i: 1296,
            $: {
                '0': { v: '336528', n: 1 },
                '1': { v: 'שחרור מבוקר של תרופות', n: 0.5 },
                '2': {
                    v: 'היבטים מולקולריים: מחלה כהפרעה מטבולית. מנגנוני פעולה של תרופות. תרופות וטרום-תרופות: תכנון מולקולרי, מינון וריכוז בדם. קופולימרים וצמדים פולימר-תרופה. מיקרו-חלקיקים וננו-חלקיקים נושאי תרופות. היבטים אנזימטיים. פרמקוקינטיקה והתפלגות תרופות בגוף. הכוונת תרופות. מערכות הפעלה : מושגים ועקרונות. מנגנוני פעולה. מערכות הפועלות תחת בקרה פיזיולוגית. היבטים הנדסיים, יישומים.',
                    n: 0.147,
                },
            },
        },
        {
            i: 1297,
            $: {
                '0': { v: '336529', n: 1 },
                '1': { v: 'הנדסת רקמות ותחליפים ביולוגיים', n: 0.5 },
                '2': {
                    v: 'אינטגרציה של עקרונות בהנדסה ומדעי החיים בהקשר לפתוח תחליפים ביולוגיים. תאים וביומולקולות :בקרה של התרבות התא וההתמיינות שלו, תאי גזע, מעבר גנים, פקטורי גדילה וחלבונים בתהליכי התפתחות. ביוחומרים : פיגומים- ביולוגיים ממקור סינטתי או ביולוגי, חיקויים לחומרים ביולוגיים. הנדסה : טכנולוגית שימור תאים בביוראקטור, רקמות מהונדסות, מעבר חומר וביומכניקה. יישומים קליניים : השתלות של רקמות ואיברים מלאכותיים, התחדשות רקמה IN-VIVO.',
                    n: 0.129,
                },
            },
        },
        {
            i: 1298,
            $: {
                '0': { v: '336538', n: 1 },
                '1': { v: 'עקרונות ביוהנדסיים לחישת מולקולות', n: 0.5 },
                '2': {
                    v: 'הקורס מתאר את היסודות הפיסיקליים מאחורי הכימות של תהליכים ביולוגיות ברמת המולקולה והתא הבודד. טכניקות מתקדמות לריצוף ד.נ.א., דימוי תאים במיקרוסקופיה באמצעות "ספר-רזולוציה", שימוש במעבר אנרגיה פלורסנטית למדידת מרחקים מולקולריים. תוצאות למידה: בסיום הקורס הסטודנט ידע: 1. יסודות ועקרונות הביו-פיזיקליים אשר מאפשרים מדידות ברמת המולקולה הבודדת. 2. העקרונות הביו-הנדסיים של טכניקות מדידה של מולקולות בודדות. 3. ליישם את ההבנה של עקרונות אלו במסגרת אפליקציות ביו-רפואיות כגון ריצוף מהיר של ד.נ.א, מדידיות תוך תאיות בסופר-רזולוציה ואפיון כוחות ומאמצים של מולקולות ביולוגיות בודדות. 4. כיצד לקרוא מאמרים בתחום, להציגם בצורה תמציתית אך ברורה ולבקר את החומר המוצג בצורה מדעית.',
                    n: 0.102,
                },
            },
        },
        {
            i: 1299,
            $: {
                '0': { v: '336540', n: 1 },
                '1': { v: 'תכן מיכשור רפואי ממוחשב(וירטואלי)', n: 0.5 },
                '2': {
                    v: 'יסודות תכן מיכשור רפואי מבוסס מחשב (וירטואלי). מבוא לתוכנת LABVIEW. שיטות נוספות לתקשורת בין ציוד אלקטרוני לבין מחשבים(USB, 232RS, GPIB). שיטות תיזמון של תוכנה מקבילה (דגימה, ניתוח, תצוגה ושמירה של אותות). תכן של מכשירים וירטואליים לניטור פרמטרים פיזיולוגיים ורפואיים.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1300,
            $: {
                '0': { v: '336546', n: 1 },
                '1': { v: 'מערכות לומדות בתחום הבריאות', n: 0.5 },
                '2': {
                    v: 'למידת תחומי עיבוד מידע בנושא של הסקת נתונים מהמערכות הרפואיות. התחומים הנלמדים: עיבוד מקדים למידע, גרפיקה למידע, רגרסיה למידע , הורדת מימדים ( PCA, ICA ), בחירת תכונות רלוונטים במידע, אלגוריתמי סיווג ( LR, SVM, NN ) רשתות נוירונים עמוקות.\nתוצאות למידה: שימוש בפייתון במערכות לומדות, בניית פרויקטים במערכות לומדות, הכרת תחומים נרחבים במערכות לומדות ומסווגים פופולריים רשתות לומדות עמוקות, אנליזת מערכות רפואיות בהיבטי מערכות לומדות.',
                    n: 0.124,
                },
            },
        },
        {
            i: 1301,
            $: {
                '0': { v: '336548', n: 1 },
                '1': { v: 'מעבדה לתכן מעגלים גנטיים', n: 0.5 },
                '2': {
                    v: 'הקורס מחולק לשני חלקים: ייצור ואפיון מעגלים גנטיים בחיידקים. בחלק הראשון שילוב של שיטות בביולוגיה מולקולרית ליצירת פלסמידים חדשים כגון : תכנון פריימרים, PCR, שיבוט גבסון, אלקטרופורזה בג\'ל, ריצוףDNA, טרנספורמציה של פלסמידים לתוך חיידקים וגידול חייקים. בחלק השני אפיון ובדיקת מעגלים גנטיים בעזרת שימוש באלקטרוכימיה, מיקרוסקופ, חלבונים פלורסנטיים, BIOLUMINESCENCE, ציטומטרית זרימה לאפיון ומיון תאים. הסטודנטים יתכננו, יבנו, ימדדו ויבדקו מעגלים גנטיים שונים : 1. משוב חיובי שמגביר אותות ביולוגים 2. משוב קדמי שמוריד אפקט הדדי בין אותות שונים 3. מתנד ביולוגי תוצאות למידה: בסיום הקורס, הסטודנט יהיה מסוגל: 1.לעבוד בכלים ממוחשבים כדי לתכנן פריימרים לשיבוט וחיבור מקטעי דנ"א. 2. ליישם מודלים הנדסיים בביולוגיה סינטטית. 3. להשתמש בכלים פיזיקליים למדוד סיגנלים ביולוגים בתוך תא חי.',
                    n: 0.094,
                },
            },
        },
        {
            i: 1302,
            $: {
                '0': { v: '336550', n: 1 },
                '1': { v: 'ביופיזיקה חישובית', n: 0.707 },
                '2': {
                    v: "הביופיזיקה היא מדע בינ-תחומי שמסביר תופעות ביולוגיות ורפואיות בעזרת מודלים פיזיקליים. בקורס נעבור על עקרונות הביופיזיקה ונלמד נושאים בסיסיים שחשובים למערכות רבות שנמצאות בטבע: מבנה ה-DNA, התנהגות סטטיסטית של מערכות שונות, תנועה אקראית, דינמיקה של חלקיקים שנעים בפוטנציאל אנרגיה. בנוסף, נכיר שיטות מחקר שונות של מערכות ביופיזיקליות. תוצאות למידה: הסטודנטיות והסטודנטים יפתרו ויעריכו את המימדים, הזמנים והאנרגיה של מבנים ותהליכים ביולוגיים.\nינסחו את המשוואות של תהליכים אקראיים על ידי שימוש במשוואות פיק, לנג'וין וסמולוכובסקי.\nיפתרו בעיות של תנועה אקראית, כולל הערכת סיכוי למיקום, חישוב ממוצעים ושטיות תקן וסימולציה של תהליכים.\nיפרטו את אופן יצירת החלבון בתאים והמשפט המרכזי של הביולוגיה._\nינתחו מבנים של חלבונים, יפרטו את תכונותיהם וישתמשו ביישומים לניתוח מבנה ותכונות של חלבונים.\nיחשבו את זמני התנועה של מולקולות במערכות זרימה שונות._\nיחשבו את התכונות החשמליות של מערכת ביולוגית.__\nיחשבו את מצב שיווי המשקל של תהליך ביוכימי ואת הסיכוי לתהליך ספונטני.\nיחשבו תכונות פיסיקליות של פולימר בתנאים שונים._\nיבחרו את שיטת המדידה המתאימה לחקר מערכת ביופיזיקלית._\nילמדו נושא נבחר בביופיזיקה, יכינו סמינר ויעבירו אותו לכיתה.",
                    n: 0.08,
                },
            },
        },
        {
            i: 1303,
            $: {
                '0': { v: '337002', n: 1 },
                '1': { v: 'פיזיולוגית מערכות הגוף למהנדסים', n: 0.5 },
                '2': {
                    v: 'פיזיולוגיה של הלב, מחזור הדם, חקר זרימת הדם, נשימה, כליה, עיכול וויסות הורמונלי של הסביבה הפנימית של הגוף. זרימה בכלי דם ובדרכי אוויר, פעילות מכנית וחשמלית של הלב, מחזור הדם הכלילי, הריאתי וההיקפי, בקרת הלב ומחזור הדם, שיחלוף גזים בריאה וברקמה, נשיאת חמצן ודו-תחמוצת הפחמן בדם, מכניקה של הנשימה, בקרת הנשימה, מאזן הנוזלים, האלקטרוליטים ויוני מימן בגוף, הפרשת חומרים על ידי הכליה, בקרת תפקוד הכליה, ספיגת חומרי מזון במערכת העיכול, ויסות הורמונלי של מערכות הגוף - בלוטות להפרשה הפנימית ומערכות משוב פיזיולוגיות.\nתוצאות למידה: הסטודנט בסיום הקורס: 1. יהיה בעל ידע רחב בפיזיולוגיה של יונקים עם דגש לבני אדם. 2. יהיה בעל הבנה על תפקוד מערכות פיזיולוגיות בדגש על מערכת הנשימה, לב וכליות.\n3.יבין אינטראקציה בין המערכות. 4. יוכל לעשות ניתוח אותות פיזיולוגיים.',
                    n: 0.091,
                },
            },
        },
        {
            i: 1304,
            $: {
                '0': { v: '337004', n: 1 },
                '1': { v: 'אנטומיה למהנדסים', n: 0.707 },
                '2': {
                    v: 'הגשת ידע בסיסי בצורה מרוכזת ומדוייקת במבנה גוף האדם. ההוראה מוקדשת לאספקטים תיאוריים ופונקציונליים של המערכות השונות בגוף.\nתוצאות למידה\nבסיום הקורס, הסטודנט יהיה מסוגל: 1. הסטודנט יוכל לזהות את השרירים והעצמות בגוף האדם. 2. הסטודנט יוכל לזהות את הפעילות של האברים בגוף.',
                    n: 0.156,
                },
            },
        },
        {
            i: 1305,
            $: {
                '0': { v: '338001', n: 1 },
                '1': { v: 'בקרת ביואנרגטיקה תאית', n: 0.577 },
                '2': {
                    v: 'מבנה ותפקוד של המיטוכונדריה. נשימה תאית וזרחון חמצני. קומפלקס V: מבנה, תפקוד ותכונות מכניות. ממברנת המיטוכונדריה: מדידה ושינוי תכונות בזמן איסכמיה. שיטות מדידה בביואנרגטיקה . שינוי ממדי המיטוכנדריה ומנגנוני הגנה. בקרת יצור האנרגיה: מנגנונים ומודלים מתמטיים. בקרת אנרגיה בתאי קוצב ותאי גזע. אנרגטיקה בתנאים פתולוגים (סכרת, סרטן, אלצהיימר). אבחון רפואי מבוסס ביו-אנרגטיקה. תוצאות למידה : בסיום הקורס הסטודנט יהיה מסוגל: 1. להבין תהליכים בבקרת האנרגיה בתא. 2. לכמת מדדי אנרגטיקה והבנת כלים ניסויים למדדים אנרגטיים. 3. לבנות מודלים חישוביים פיזיקאליים וסימולציות מתמטיות (פתרון משוואות מתמטיות) של המיטוכונדריה וסביבתה באמצעות נתונים שיאספו בסקר ספרות. 4.לבנות מודלים אנליטיים המתארים בקרים של אנרגיה. 5.להעריך ולבקר את הרמה המקצועית של עבודות שפורסמו בנושאים הרלבנטיים.',
                    n: 0.095,
                },
            },
        },
        {
            i: 1306,
            $: {
                '0': { v: '338002', n: 1 },
                '1': { v: 'מרעיון קליני לפתרון בביו-רפואה', n: 0.5 },
                '2': {
                    v: 'הסטודנטים יחשפו לבעיות בעולם הקליני ויציעו פתרונות ויישומים לבעיה.\nהקורס יכלול מפגש ראשוני בהם יחשפו הסטודנטים לסט בעיות ספציפיות בעולם הקליני. לאחר בחירת הבעיה, הסטודנטים יבקרו במחלקה להתרשם מהאמצעיים העומדים לרשותה. במהלך 3 ימים מרוכזים ייערך האקתון, בו הסטודנטים יעבדו על פתרון הבעיה וכן יחשפו להרצאות על בניית תוכנית עסקית.\nתוצאות למידה\nבסיום הקורס, הסטודנט יהיה מסוגל: 1. להבין את היתרונות של פתרונות דיגיטלים ויזמות בהנדסה ביו רפואית. 2.לבנות תוכנית עסקית לרעיונות ביו-רפואיים.',
                    n: 0.12,
                },
            },
        },
        {
            i: 1307,
            $: {
                '0': { v: '338003', n: 1 },
                '1': { v: 'שיטות מתקדמות לטיפול בסרטן', n: 0.5 },
                '2': {
                    v: 'מבוא לסרטן ולרפואה מותאמת אישית לסרטן, הדמיה וגילוי סרטן: מעקב רדיואקטיבי חדשני ואמצעי הדמיה. חזית המחקר ברדיותרפיה וכימותרפיה: היפרתרמיה, אולטרסאונד ממוקד בעוצמה גבוהה, חלקיקי אלפא ו"סכין גאמא", טיפולים ממוקדים: מעכבי קינאז ותרופות ממוקדות, נגיפים אונקוליטים ואימונותרפיה, טיפולים ננו-רפואיים וטיפול פוטודינמי, טיפולים אנטי-אנגיוגנים ורפואה אינטגרטיבית לסרטן נתונים גדולים, מאגרים ופורטלים לחקר הסרטן, טיפולים קומבינטוריים וניתוח מטא ספרותי בחקר הסרטן. תוצאות למידה:\nהתלמידים יוכלו לנווט בעולם המורכב של רפואה בסרטן באמצעות כלים חדשניים ומאגרי מידע ציבוריים כמו אטלס חלבונים האנושי ומאגר הגנים של מכון ברוד. תוצאת הלמידה הסופית תהיה לכתוב ולהציג הצעה לטיפולי שילוב חדשים בהתאמה אישית לחולי מקרה היפותטיים.',
                    n: 0.102,
                },
            },
        },
        {
            i: 1308,
            $: {
                '0': { v: '338014', n: 1 },
                '1': { v: 'נושא. מתקדמים בהנדסה ביו-רפואית 7', n: 0.447 },
                '2': {
                    v: 'קורס מתקדם שנועד לאפשר התמחות בשטח ספציפי. הסילבוס יקבע על ידי המרצה ויאושר לפני תחילת הסמסטר. סמסטר א\' תשפ"ב: שיטות ביו-רפואיות לאיבחון וטיפול בסרטן.',
                    n: 0.204,
                },
            },
        },
        {
            i: 1309,
            $: {
                '0': { v: '338019', n: 1 },
                '1': { v: 'נושא. מתקדמים בהנדסה ביו-רפואית 9', n: 0.447 },
                '2': {
                    v: 'קורס מתקדם שנועד לאפשר התמחות בשטח ספציפי. הסילבוס יקבע על ידי המרצה ויאושר לפני תחילת הסמסטר.',
                    n: 0.25,
                },
            },
        },
        {
            i: 1310,
            $: {
                '0': { v: '338319', n: 1 },
                '1': { v: 'פרוייקט מתקדם בהנדסה ביו-רפואית', n: 0.5 },
                '2': {
                    v: 'הקורס מאפשר למשתלמים ללמוד באופן יסודי נושא ספציפי בתחום הבעיות השייכות להנדסה ביו-רפואית, ולרכז את המידע הקיים בקשר לאותו נושא ולהגיש את החומר בצורה מסודרת כדו"ח בכתב ובדרך כלל גם ע"י הרצאה סמינריונית.',
                    n: 0.174,
                },
            },
        },
        {
            i: 1311,
            $: {
                '0': { v: '338500', n: 1 },
                '1': { v: 'סמינר מתקדם בהנדסה ביו-רפואית', n: 0.5 },
                '2': {
                    v: 'הצגת נושא בהנדסה ביו-רפואית וכתיבת מאמר סקירה שישלח לפרסום בעיתון בתחום. הסטודנט משתלם בנושא באופן עצמאי ומגיש את סיכומו בצורת המאמר הסופי.\nתוצאות למידה: במהלך הקורס הסטודנט:\n1. יתנסה באיסוף וסיכום חומר למאמר בתחום.\n2. יתנסה בכתיבה מדעית\n3. יתנסה בעריכת המאמר לפרסום.',
                    n: 0.16,
                },
            },
        },
        {
            i: 1312,
            $: {
                '0': { v: '394580', n: 1 },
                '1': { v: 'פיתוח קול', n: 0.707 },
                '2': { v: 'יסודות המוסיקה הווקלית ופיתוח קול.', n: 0.447 },
            },
        },
        {
            i: 1313,
            $: {
                '0': { v: '394582', n: 1 },
                '1': { v: 'תזמורת', n: 1 },
                '2': {
                    v: 'לימוד מיומנות בנגינה תזמורתית והבאת יצירות סימפוניות לביצוע. הכנת רפרטואר מגוון כולל ליווי סולנים ומקהלה. מתקבלים רק נגנים בכלי תזמורת, ועל סמך בחינה מעשית. חובה להשתתף החל מהשיעור הראשון.',
                    n: 0.186,
                },
            },
        },
        {
            i: 1314,
            $: {
                '0': { v: '394587', n: 1 },
                '1': { v: 'מקהלה 3', n: 0.707 },
                '2': {
                    v: "לימוד שירה אמנותית במקהלה אורטורית. ידע בסולפג' ורפרטואר סגנוני מגוון כולל הבאת יצירות לביצוע. מתקבלים על סמך בחינה מעשית. חובה להשתתף החל מהשיעור הראשון. במבחנים - חובה להכין קטע שירה ורצוי ידע בתווים.",
                    n: 0.174,
                },
            },
        },
        {
            i: 1315,
            $: {
                '0': { v: '394591', n: 1 },
                '1': { v: 'פיתוח קול 2', n: 0.577 },
                '2': {
                    v: 'יסודות המוסיקה הווקאלית ופיתוח קול (קורס למתקדמים).',
                    n: 0.378,
                },
            },
        },
        {
            i: 1316,
            $: {
                '0': { v: '394800', n: 1 },
                '1': { v: 'חינוך גופני-כושר בנים', n: 0.577 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: חינוך גופני, כושר גופני, היט אנד ראן, אימון פונקציונלי, חדר כושר, חיזוק ומתיחות, פילאטיס, טי.אר.אקס, קורפיטנס, הליכה ספורטיבית ומודעות תנועתית.',
                    n: 0.11,
                },
            },
        },
        {
            i: 1317,
            $: {
                '0': { v: '394801', n: 1 },
                '1': { v: 'חינוך גופני - התעמלות כללית בנות', n: 0.408 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: כושר גופני בקצב אישי, חיזוק ועיצוב, אימון פונקציונלי, היט אנד ראן, פילאטיס, אירובי, חדר כושר, טי.אר.אקס, חיזוק ומתיחות, מודעות תנועתית, הליכה ספוטיבית.',
                    n: 0.109,
                },
            },
        },
        {
            i: 1318,
            $: {
                '0': { v: '394802', n: 1 },
                '1': { v: 'חינוך גופני - שחיה', n: 0.5 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: שחיה - מתחילים, שלב ב\', בינוניים, מתקדמים, שחיה לבנים דתיים, שחיה לבנות דתיות, שייט, קייאקים, סנונית, סאפ וגלישת גלים, אקואפורסה.',
                    n: 0.11,
                },
            },
        },
        {
            i: 1319,
            $: {
                '0': { v: '394803', n: 1 },
                '1': { v: 'חינוך גופני - משחקי כדור', n: 0.447 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: קט רגל מתחילים, קט רגל מתקדמים, כדור עף-מתחילים, כדור עף מתקדמים, כדור סל-מתחילים, כדור סל-מתקדמים, כדור יד, כדור עף חופים, כדורת דשא, כדורת דשא מתקדמים.',
                    n: 0.107,
                },
            },
        },
        {
            i: 1320,
            $: {
                '0': { v: '394804', n: 1 },
                '1': { v: 'חינוך גופני - משחקי מחבט', n: 0.447 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: טניס-מתחילים ומתקדמים, טניס שולחן - מתחילים ומתקדמים, סקווש - מתחילים ומתקדמים, בדמינגטון.',
                    n: 0.116,
                },
            },
        },
        {
            i: 1321,
            $: {
                '0': { v: '394805', n: 1 },
                '1': { v: 'חינוך גופני - אתלטיקה קלה', n: 0.447 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: ניווט ספורטיבי - מתחילים ומתקדמים, אופני הרים, ריצות ארוכות, ריצת לילה, פלדנקרייז, יוגה, טיפוס ספורטיבי, שחמט.',
                    n: 0.113,
                },
            },
        },
        {
            i: 1322,
            $: {
                '0': { v: '394806', n: 1 },
                '1': { v: 'חינוך גופני - הגנה עצמית', n: 0.447 },
                '2': {
                    v: "הציון ייקבע עפ\"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ\"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: הישרדות, קרב מגע - מתחילים ומתקדמים, ג'ודו, קארטה - מתחילים ומתקדמים, טאיקוונדו - מתחילים ומתקדמים, ג'יוג'טסו וסייף.",
                    n: 0.113,
                },
            },
        },
        {
            i: 1323,
            $: {
                '0': { v: '394808', n: 1 },
                '1': { v: 'חינוך גופני-מיועד לסטודנטים חדשים', n: 0.5 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: שחיה מתקדמים, טיאראקס, אקווה פורסה,פילאטיס, זומבה, חדר כושר, שחייה שלב ב\', כדור עף בנות, חיזוק ומתיחות, יוגה מתקדמים.',
                    n: 0.112,
                },
            },
        },
        {
            i: 1324,
            $: {
                '0': { v: '394820', n: 1 },
                '1': { v: 'חינוך גופני - תנועה ומחול', n: 0.447 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. תאוריה ותירגול מיומנויות. קיימות קבוצות מעורבות ומופרדות לבנים ולבנות. כל סטודנט חייב לצבור במהלך לימודיו שתי נקודות מתוך הרשימות הנ"ל. סטודנט אינו רשאי להירשם ליותר ממקצוע ספורט אחד באותו סמסטר או לקחת בנוסף נבחרת ספורט. נוכחות חובה בכל השיעורים. אחריות רישום וביטול קורסים רגילים חלה על הסטודנט בלבד. להלן פירוט הקבוצות במקצוע: בלט, מחול אירובי, זומבה, סלסה - מתחילים ומתקדמים, ריקוד ספורטיבי.',
                    n: 0.118,
                },
            },
        },
        {
            i: 1325,
            $: {
                '0': { v: '394902', n: 1 },
                '1': { v: 'נבחרות ספורט', n: 0.707 },
                '2': {
                    v: 'הציון ייקבע עפ"י מעקב והערכה במשך הסמסטר ו/או מבחני מיומנות. הרישום לנבחרת מתבצע ע"י המאמן לאחר בחינת רמתו הספורטיבית של המועמד במהלך שלושת השיעורים הראשונים של הסמסטר. סטודנט שיתקבל לאחת הנבחרות או קורסי המתקדמים חייב לבטל מיידית את רישומו למקצוע ספורט אחר, אחרת לא ייקלט רישומו. סטודנט אינו רשאי להירשם ליותר מאחד ממקצועות החינוך הגופני והנבחרות באותו סמסטר. נוכחות חובה בכל השיעורים. להלן פירוט הנבחרות: כדור עף - אולמות וחופים, כדור סל, כדור רגל, טניס, טניס שולחן, ריצות ארוכות, כדור יד,סקווש, ג\'ודו, שייט, שחמט, קראטה, סלסה, שחייה, להקת מחול, סקווש, ניווט, אופני הרים, גלישת רוח, קיאקים, סנונית, להקת מעודדות.',
                    n: 0.101,
                },
            },
        },
        {
            i: 1326,
            $: {
                '0': { v: '518006', n: 1 },
                '1': { v: 'אנרגיה של ביו-מסה', n: 0.577 },
                '2': {
                    v: 'עקרונות בסיסיים של ביו-דלקים.ביו-אנרגיה, הזנה ממוחזרת, יתכנות ההפקה של ביו-דלקים, סוגי ביו-מסה, אנזימולוגיה תהליכית, כימיה ופיסיקה של פחמימנים וליגו-צלולוז, המרה ביו-כימית של ביו-מסה, הפקת ביו-דיזל, השפעות סביבתיות של הפקת ביו-דלקים, היבטים כלכליים בביו-דלקים, היבטים כלכליים של שאריות הפקה, דיון בהפקות מעשיות של ביו-דלקים.',
                    n: 0.152,
                },
            },
        },
        {
            i: 1327,
            $: {
                '0': { v: '528001', n: 1 },
                '1': { v: 'מבוא להנדסה ימית', n: 0.577 },
                '2': {
                    v: 'סקירת יישומים בהנדסה ימית בציון היבטים הנדסיים בסיסיים, רקע תיאורטי, הנחות, ושיטות לתכן מעשי: כלי שייט, מבנים צפים, מבנים מבוססים על קרקע הים, שוברי גלים, קווי צינור תת ימיים, מבנים גמישים לחקלאות ימית. מאפייני הסביבה הימית: לחץ הידרוסטאטי, גלים, זרמים ותהליכי הסעת חולות. מדריכי תכן פרקטיקה מומלצת ותקנים.\nתוצאות למידה:הסטודנט יכיר מגוון של יישומים של הנדסה ימית. מאפייני הסביבה הימית בהיבטים של תכן, עקרונות תכן בהנדסה ימית, פילוסופית מבנה קליפה לכלי שייט או אסדות צפות. הסטודנט יתמצא בתיאוריות ושיטות הנדסיות מעשיות לצכן בסביבה ימית וההנחות שבבסיסן.',
                    n: 0.108,
                },
            },
        },
        {
            i: 1328,
            $: {
                '0': { v: '617006', n: 1 },
                '1': { v: 'היבטים של מדיה מקושרת', n: 0.5 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1329,
            $: {
                '0': { v: '617009', n: 1 },
                '1': { v: 'תכנון, יצור אב-טיפוס והערכת ממשק', n: 0.447 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1330,
            $: {
                '0': { v: '617016', n: 1 },
                '1': { v: 'מושגי פרטיות ובטיחות בעולם הגדול', n: 0.447 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1331,
            $: {
                '0': { v: '617028', n: 1 },
                '1': { v: 'מערכות לומדות', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין-יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1332,
            $: {
                '0': { v: '617053', n: 1 },
                '1': { v: 'פרוייקט - אתגרי חברות', n: 0.5 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם מכון טכניון-קורנל ע"ד ג\'קובס. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.224,
                },
            },
        },
        {
            i: 1333,
            $: {
                '0': { v: '617056', n: 1 },
                '1': { v: 'מחקר עצמאי 2', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין ילידתית למדע יישומי, בשיתוף מכון טכניון-קורנל ע"ש ג\'קובס. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1334,
            $: {
                '0': { v: '617065', n: 1 },
                '1': { v: 'קריפטוגרפיה', n: 1 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף מכון טכניון-קורנל ע"ש ג\'קובס. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1335,
            $: {
                '0': { v: '617068', n: 1 },
                '1': { v: 'מבוא לעולם העסקים', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף מכון טכניון-קורנל ע"ש ג\'קובס. הסילבוס המלא פורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1336,
            $: {
                '0': { v: '617069', n: 1 },
                '1': { v: 'שיטות אופטימיזציה', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף מכון טכניון-קורנל ע"ש ג\'קובס. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1337,
            $: {
                '0': { v: '617070', n: 1 },
                '1': { v: 'חשיבה עיצובית', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף מכון טכניון-קורנל ע"ש ג\'קובס. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1338,
            $: {
                '0': { v: '618005', n: 1 },
                '1': { v: 'טכנולוגיות מהפכניות', n: 0.707 },
                '2': {
                    v: 'The Goal of This Course Is to Help Students Deepen Their Theoretical And Historical Perspective On Social Change, and to Creatively Envision Various Alternatives For The Relationship Between Social Change and Technology. We Will Read a Range of Revolutionary Thinkers - Including, But Not Limited To# Karl Marx, Friedrich Engels, Antonio Gramsci, Stuart Hall, Frantz Fanon, Mohandas K. Gandhi and Paulo Freire. We Will Study Their Theories of Revolution, The Underlying Tension Within The Division of Labor in Society, and Discuss The Role That Technology Can Play in Forming and Reforming Social Relations. We Will Use This As a Lens to Reflect Both Upon Existing Technology And The Underlying Relations That Create and Sustain It, As Well As To Envision New Technological Possibilities Supported By (and Supporting) Alternative Forms of Social Organization. Coursework Will Consist of Significant Reading, Reading Reflections, Speculative Design Exercises and Final Course Project.\nLearning Outcomes#\nThe Goal of This Course Is to Help Students Deepen Their Theoretical And Historical Perspective On Social Change, and to Creatively Envision Various Alternatives For The Relationship Between Social Change and Technology. Students Will Learn Critical Reading, Writing And Analysis Skills, As Well As an Exposure to Speculative Design Techniques.',
                    n: 0.071,
                },
            },
        },
        {
            i: 1339,
            $: {
                '0': { v: '618006', n: 1 },
                '1': { v: 'מציאות רבודה ווירטואלית', n: 0.577 },
                '2': {
                    v: 'Rerequisites#\nIntermediate Programming Ability in Java Or C# Experience Programming a User Interface You Must Be in The Final Year of Your Program Description Augmented and Virtual Reality Technologies and Applications Are Becoming Increasingly Popular. This Course Presents an Introduction To This Exciting Area, With an Emphasis On Designing and Developing Virtual and Augmented Reality Applications. The Course Will Cover The History of The Area, Hardware Technologies Involved, Interaction Techniques, Design Guidelines, Evaluation Methods, and Specific Application Areas.\nLearning Outcomes#\n1. Understanding Aand Prespective On The Vr/ar Landscape, Past, Present and Future. 2. Undeerstanding of Fundamental Computer Vision, Computer Graphics and Human-computer Interaction Techniques Related to R/ar. 3. Insights to Key Application Areas For Vr/ar.\n4. The Ability to Design and Implement Vr/ar Experiences.',
                    n: 0.091,
                },
            },
        },
        {
            i: 1340,
            $: {
                '0': { v: '618010', n: 1 },
                '1': { v: 'הכנה לסטודיו', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1341,
            $: {
                '0': { v: '618011', n: 1 },
                '1': { v: 'תכן מוצרי נתונים', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתיצ למדע יישומי, בשיתוף עם המכן לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1342,
            $: {
                '0': { v: '618020', n: 1 },
                '1': { v: 'שיווק דיגיטלי', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1343,
            $: {
                '0': { v: '618021', n: 1 },
                '1': { v: 'הערכות נכסים', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1344,
            $: {
                '0': { v: '618023', n: 1 },
                '1': { v: 'עיבוד ספרתי של אותות ותקשורת', n: 0.447 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1345,
            $: {
                '0': { v: '618025', n: 1 },
                '1': { v: 'מודלים של החלטות', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1346,
            $: {
                '0': { v: '618028', n: 1 },
                '1': { v: 'תכן ועשייה בין-דיסציפלינאריים', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1347,
            $: {
                '0': { v: '618029', n: 1 },
                '1': { v: 'נתונים עירוניים', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוסהמלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1348,
            $: {
                '0': { v: '618033', n: 1 },
                '1': { v: 'פרוייקטי התמחות', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת הועדה הבין-יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1349,
            $: {
                '0': { v: '618045', n: 1 },
                '1': { v: 'הנדסת ערים חכמות', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת הועדה הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1350,
            $: {
                '0': { v: '618047', n: 1 },
                '1': { v: 'מדע נתונים גרפים עבור מערכות', n: 0.447 },
                '2': {
                    v: 'המקצוע ניתן במסגרת הועדה הבין-יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1351,
            $: {
                '0': { v: '618051', n: 1 },
                '1': { v: 'נתונים, אנשים ומערכות', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת הועדה הבין-יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1352,
            $: {
                '0': { v: '618053', n: 1 },
                '1': { v: 'בינה מלאכותית עבור תחום הבריאות', n: 0.447 },
                '2': {
                    v: 'המקצוע ניתן במסגרת הועדה הבין-יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.236,
                },
            },
        },
        {
            i: 1353,
            $: {
                '0': { v: '618088', n: 1 },
                '1': { v: 'מערכת הבריאות האמריקאית', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1354,
            $: {
                '0': { v: '618090', n: 1 },
                '1': { v: 'מידול בתנאי אי-ודאות', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי, בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1355,
            $: {
                '0': { v: '618100', n: 1 },
                '1': { v: 'מערכות עירוניות', n: 0.707 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1356,
            $: {
                '0': { v: '618101', n: 1 },
                '1': { v: 'הנדסת מערכות לומדות', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי בשיתוף עם המכון לחדשנו טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1357,
            $: {
                '0': { v: '618104', n: 1 },
                '1': { v: 'אנליזה אסטרטגית מתקדמת', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1358,
            $: {
                '0': { v: '618115', n: 1 },
                '1': { v: 'פיתוח ותכן של התקנים אינטרקטיביים', n: 0.447 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הביןן יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1359,
            $: {
                '0': { v: '618116', n: 1 },
                '1': { v: 'ניהול כספים יזמי', n: 0.577 },
                '2': {
                    v: 'המקצוע ניתן במסגרת התכנית הבין יחידתית למדע יישומי בשיתוף עם המכון לחדשנות טכניון-קורנל. הסילבוס המלא מפורסם בקובץ המקצועות באנגלית.',
                    n: 0.229,
                },
            },
        },
        {
            i: 1360,
            $: {
                '0': { v: '738001', n: 1 },
                '1': { v: 'פרויקט במערכות אוטונומיות', n: 0.577 },
                '2': {
                    v: 'הפרויקט יהיה בעל אופי אנליטי עיוני או ניסוי. על הסטודנט למצוא מנחה לפרויקט ולתאם עמו נושא. המנחה יהיה מבין חברי הסגל הבכירים בטכניון, הרשומים כחברים בתכנית הטכניונית למערכות אוטונומיות ורובוטיקה.',
                    n: 0.183,
                },
            },
        },
        {
            i: 1361,
            $: {
                '0': { v: '748004', n: 1 },
                '1': { v: 'הנדסת מערכות דיגיטליות', n: 0.577 },
                '2': {
                    v: 'סקירה של מערכות סטנדרטיות לפתוח ויישום בשטח של IOT . הכירות עם עולם הסייבר סקיוריטי והשלכות על תכנון מערכות IOT , כולל מתקפות שכיחות ושיטות הגנה לכל שכבה ברשת. נכיר את תשתית בלוקציין - יישומים בולטים ואלגוריתמים להשגת קונצנזוס ברשת, יישומים ותועלות של בלוקציין בעולם ה IOT . נכיר את עולם הסלולר והשלכתו על יישומיי IOT והמהפכה הצפויה של דור 5 לתחום ורשתות "מבוססות תוכנה" - SDN. נכיר סטנדרטים ופרויקטים של קוד פתוח ( תוכנה וחומרה ) הרלוונטיים ליישום של רשת IOT. מהי מהפיכת התעשיה דור 4 , כיצד מבצעים "טרנספורמציה דיגיטלית" לחברות ומפעלים קיימים ומהם ההתפתחויות הטכנולוגיות הנוכחיות שמסמנות את הדור הבא של מערכות דיגיטליות. תוצאות למידה:\n-הקניית אוריינות דיגיטלית הבנה כוללת של מהפיכת הדיגיטל והשפעתה על כל מקצועות ההנדסה ( "הנדסה דיגיטלית ).\n-הכירות עם עולם ה IOT - השפעתו על ורטיקליים שונים בתעשייה המודרנית כבסיס למהפכה התעשייתית דור 4 - INDUSTRY 0.4 .\nיכולת תכנון מערכות IOT - יישום מערכת IOT מורכבת כ"מערכת של מערכות" ו"רשת של רשתות".\n- הבנת התועלת העסקית של יישום IOT - הפיכת מוצר לשירות ומודלים של כלכלה דיגיטלית.',
                    n: 0.076,
                },
            },
        },
    ],
};
